[
{
  "id": "Cooking Classes-Sheila's Indian Kitchen, Ashton Fitchett Dr, Wellington-Event Finder",
  "name": "Cooking Classes",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2088954-892458-35.jpg",
  "venue": "Sheila's Indian Kitchen, Ashton Fitchett Dr, Wellington",
  "coordinates": {
    "lat": -41.3056843,
    "long": 174.753222
  },
  "dates": [
    "2025-07-26-18:00",
    "2025-08-26-18:00",
    "2025-09-02-18:00",
    "2025-10-02-18:00",
    "2025-10-09-18:00",
    "2025-11-09-18:00",
    "2025-11-16-18:00",
    "2025-12-16-18:00",
    "2025-12-23-18:00",
    "2026-01-23-18:00",
    "2026-01-30-18:00",
    "2026-03-02-18:00",
    "2026-03-09-18:00",
    "2026-04-09-18:00",
    "2026-04-16-18:00",
    "2026-05-16-18:00",
    "2026-05-23-18:00",
    "2026-06-23-18:00",
    "2026-06-30-18:00",
    "2026-07-07-18:00",
    "2026-07-14-18:00",
    "2026-08-14-18:00"
  ],
  "displayDate": "Sat 26 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/cooking-classes2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Custom made classes available for gluten free, dairy free and any other food intolerance and dietary requirements.The ingredients, recipes, complimentary organic karma drinks will be provided with a full course meal.\nAlso a private cooking classes available.\n3) Roasted eggplant curry, plain whole wheat chapatti or roti, jeera aaloo or potato curry, Tuar dahl (split yellow lentil) and Basmati rice with homemade pickle.\n4) Palak paneer (creamy spinach curry with cubes of paneer), jeera rice (basmati rice with fragrant spices, panjabi chhole or spicy chickpeas curry and mango lassi.\nAlso fresh paneer making."
},
{
  "id": "Microsoft Excel - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Microsoft Excel - Beginners",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100911-897710-34.jpg?v=22",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-09-09:00"
  ],
  "displayDate": "Sat 09 Aug",
  "url": "https://www.eventfinda.co.nz/2025/microsoft-excel-beginners3/wellington",
  "source": "Event Finder",
  "eventType": "Business & Networking",
  "description": "An introduction to this popular spreadsheeting package - basic Windows skills essential.\nLearn how to create and use spreadsheets, as well as identify elements of a workbook, enter and edit data, generate basic calculations and use built-in spreadsheet functions.\nWindows skills essential - this is not a course for absolute beginners to computing.\nBy the end of the course, you'll have had a basic introduction to using MS Excel, including how to: - Identify elements of a workbook - Page setup and printing - Enter and edit data and basic formatting - Generate basic calculations - Use cell references and built-in functions Presented by Lachman Prasad."
},
{
  "id": "Yoga Nidra: Moon Bathing-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Yoga Nidra: Moon Bathing",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095954-895561-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-31-18:15"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/yoga-nidra-moon-bathing/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Yoga Nidra: Moon Bathing Slow down, settle in, and let the soft glow of the moon guide you inward.\nThis calming evening will centre around the deeply restorative practice of Yoga Nidra—a guided meditation designed to bring your body into a state of deep rest while your awareness gently drifts between waking and dreaming.\nKnown to activate the parasympathetic nervous system and reduce stress, Yoga Nidra supports emotional balance, mental clarity, and a profound sense of ease.\nThis moon-themed session invites you to tune into the gentle, reflective energy of the lunar cycle—a time for slowing down, softening, and simply being.\nAfter the practice, we’ll be sharing a nourishing plant-based dinner together."
},
{
  "id": "Quiz Night-Eva Beva, 31-35 Dixon Street, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064362-880990-35.png?v=6",
  "venue": "Eva Beva, 31-35 Dixon Street, Wellington",
  "coordinates": {
    "lat": -41.2911443,
    "long": 174.7747326
  },
  "dates": [
    "2025-07-23-19:00",
    "2025-07-30-19:00",
    "2025-08-06-19:00",
    "2025-08-13-19:00",
    "2025-08-20-19:00",
    "2025-08-27-19:00",
    "2025-09-03-19:00",
    "2025-09-10-19:00",
    "2025-09-17-19:00",
    "2025-09-24-19:00",
    "2025-10-01-19:00",
    "2025-10-08-19:00",
    "2025-10-15-19:00",
    "2025-10-22-19:00",
    "2025-10-29-19:00",
    "2025-11-05-19:00",
    "2025-11-12-19:00",
    "2025-11-19-19:00",
    "2025-11-26-19:00",
    "2025-12-03-19:00",
    "2025-12-10-19:00",
    "2025-12-17-19:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night9/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Every Wednesday is trivia night at one of Wellington's most popular quizzes - Eva Beva!\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew!\nSo if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
},
{
  "id": "Yuzu Fest 2025-Garage Project Wild Workshop, 7 Furness Lane Te Aro, Wellington, Wellington-Event Finder",
  "name": "Yuzu Fest 2025",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103562-899016-35.png?v=3",
  "venue": "Garage Project Wild Workshop, 7 Furness Lane Te Aro, Wellington, Wellington",
  "coordinates": {
    "lat": -41.2941855,
    "long": 174.7773907
  },
  "dates": [
    "2025-07-25-16:00",
    "2025-07-26-14:00",
    "2025-07-27-14:00"
  ],
  "displayDate": "Fri 25 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/yuzu-fest-20252/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Get ready to pucker up – Yuzu Fest is back and juicier than ever!\nOur annual celebration of all things citrus is returning in epic fashion, and the 2025 lineup is absolute gold.\nWe’re talking the triumphant return of fan faves like Yuzu Pernicious Weed and the sell-out sensation Yuzukoshu, alongside some fresh new zesty creations.\nCome sip your way through our week-long Yuzu Fest across all Garage Project venues.\nWhether you're a long-time lover of all things yuzu or just here for the citrusy vibes, this is one week you won't want to miss."
},
{
  "id": "Poetry Lab-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Poetry Lab",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095542-895358-35.jpg?v=11",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-17:30"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/poetry-lab2/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Description This course is ideal for poets of all levels hoping to improve their writing skills, develop their voice and get feedback on their work.\nEach class will include a short lecture of things to think about during the session but the rest of the time will be spent workshopping your poems.\nBring pen and paper to all sessions.\nWhat we'll cover: Week 1 - Introduction: experiencing poetry and getting to know your peers Week 2 - Finding Inspiration Week 3 - Avoiding the cliché Week 4 - Bringing out your voice Week 5 - Embracing the page Week 6 - Poetry as performance When the course is complete there will be a live class poetry reading!\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Immersive Yoga: We Are Nature-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Immersive Yoga: We Are Nature",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103030-898754-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-07-18:15"
  ],
  "displayDate": "Thu 07 Aug",
  "url": "https://www.eventfinda.co.nz/2025/immersive-yoga-we-are-nature/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "A one-of-a-kind yoga experience designed to awaken the senses, stir reflection, and bring you into deeper connection — followed by a nourishing plant-based dinner and dessert.\nTake this moment to become grounded in your true nature through embodied movement.\nThis practice is your invitation to appreciate and develop a deeper connection with the Earth — to slow down, to notice the changing landscapes and seasons around you, and to find them within you.\nAs you move through gentle hatha yoga, you’ll be surrounded by breathtaking visuals of our earthly home, designed and projected by Andy from Hype Entertainment.\nLet us find our way back through nature, to our true nature and selves."
},
{
  "id": "Qi Gong-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Qi Gong",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095655-895422-34.jpg?v=3",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-19:30"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/qi-gong2/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Qi gong, pronounced “chi gong,” was developed in China thousands of years ago as part of traditional Chinese medicine.\nQigong has both psychological and physical components and involves the regulation of the mind, breath, and body’s movement and posture.\nIn most forms of qigong: Breath is slow, long, and deep.\nBreath patterns may switch from abdominal breathing to breathing combined with speech sounds.\nDynamic (active) qigong techniques primarily focus on body movements, especially movements of the whole body or arms and legs."
},
{
  "id": "Sculpture - Intro to Creature Sculpting-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Sculpture - Intro to Creature Sculpting",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100909-897708-35.jpg?v=4",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-02-09:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://www.eventfinda.co.nz/2025/sculpture-intro-to-creature-sculpting3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "- Beginners welcome!\nDescription Whether you want to make creatures cute, creepy, in the style of pop-toys, figurines, or a one-of-a-kind character in your own style, this is the class for you!\nWorking with air dry clays, oven bake polymer clays and wire, armatures this workshop offers a variety of modelling methods and approaches - a great opportunity to turn ideas into tangible 3D forms.\nbring a work apron if you have one or wear clothes you don’t mind getting a little grubby.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Best of the Bee Gees Saturday Night Fever Show-The Opera House, 111 - 113 Manners Street, Wellington-Event Finder",
  "name": "Best of the Bee Gees Saturday Night Fever Show",
  "imageUrl": "",
  "venue": "The Opera House, 111 - 113 Manners Street, Wellington",
  "coordinates": {
    "lat": -41.2913572,
    "long": 174.7779946
  },
  "dates": [
    "2025-08-16-20:00"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/best-of-the-bee-gees-saturday-night-fever-show/wellington",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "You should be dancing when the disco era comes alive on stage in Wellington.\nReleased in 1977, the album defined a disco generation.\nSpecial guests Debora McLane (niece of the Bee Gees) and Roslyn Loxton join the tribute band on stage.\nThe album ‘Saturday Night Fever’ was the biggest-selling sound recording between 1977 and 1980.\nIt was awarded Album of the Year at the 1979 Grammys and stayed in the Top 200 for 29 consecutive months."
},
{
  "id": "Moon Jam Nite-Moon, 167 Riddiford Street, Wellington-Event Finder",
  "name": "Moon Jam Nite",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2057961-877809-35.jpg?v=2",
  "venue": "Moon, 167 Riddiford Street, Wellington",
  "coordinates": {
    "lat": -41.3132459,
    "long": 174.7798505
  },
  "dates": [
    "2025-07-29-19:30",
    "2025-08-05-19:30",
    "2025-08-12-19:30",
    "2025-08-19-19:30",
    "2025-08-26-19:30",
    "2025-09-02-19:30",
    "2025-09-09-19:30",
    "2025-09-16-19:30",
    "2025-09-23-19:30",
    "2025-09-30-19:30",
    "2025-10-07-19:30",
    "2025-10-14-19:30",
    "2025-10-21-19:30",
    "2025-10-28-19:30",
    "2025-11-04-19:30",
    "2025-11-11-19:30",
    "2025-11-18-19:30",
    "2025-11-25-19:30",
    "2025-12-02-19:30",
    "2025-12-09-19:30",
    "2025-12-16-19:30"
  ],
  "displayDate": "Tue 29 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/moon-jam-nite2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Newtown's favourite jam night!\nA weekly showcase of the musical talents of Newtown & beyond Come and share your original tunes, jam with other musicians, or simply enjoy the show & drink specials!\nElectric guitar, bass, keyboard, drums, mics, lights and mixer provided, along with support from our in-house sound tech Billy.\nBring your own gear, cymbals, songs, & poems.\nFree entry, sign ups from 7pm, every Tuesday."
},
{
  "id": "French - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "French - Introductory 1",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095662-895429-35.jpg?v=14",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-24-17:30"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/french-introductory-12/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "For beginners who have no prior knowledge of French.\nBy the end of the eight-week course, you'll be able to: - Greet people and introduce yourself and others at a basic level - Use expressions for basic everyday communication - Ask and answer questions about people’s names, nationalities, family, work situation, likes and dislikes (both formal and informal) - Describe and use the rules of pronunciation (including the alphabet) - Understand and use some basic French grammar: the verbs avoir and être, the present tense of a few verbs in -er, articles (definite and indefinite), singular/plural and masculine/feminine of nouns and nationality adjectives, possessive adjectives - Order, offer, accept and refuse food and drink in a café at a basic level - Become more familiar with the cultural aspects related to these topics Duration 8 weeks, Thu 5:30 PM – 7:30 PM"
},
{
  "id": "Beeswax Candle Making-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Beeswax Candle Making",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100903-897703-35.jpg?v=8",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-31-19:00"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/beeswax-candle-making3/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Come along and find out how easy it is to make your very own beeswax candles to give your home a delightful ambience!\nJoin Jill in this 2-hour workshop where you will learn how to make three different styles of these candles using beeswax sheets.\nThese are great for gifting as well!\nAll materials included in course fee, bring a pen and paper to take notes if you wish.\nBy the end of the course, you’ll be able to: Make three styles of candles Know where to source wax and wick to continue making your own at home Be proud of a home-made product created with your own hands Note: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel."
},
{
  "id": "The Overthinking Mind: Finding Peace in Mental Chaos-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "The Overthinking Mind: Finding Peace in Mental Chaos",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095955-895562-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-31-18:15"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/the-overthinking-mind-finding-peace-in-mental-chaos/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "The Overthinking Mind: Finding Peace in Mental Chaos Transform the exhausting cycle of mental loops, rumination, and decision paralysis into mental clarity and peace.\nThis 60-minute workshop will give you practical tools to break the cycle.\nPlus, your ticket includes a nourishing plant-based dinner and dessert—because taking care of your mind is best supported by feeding your body well.\nMeet Krishnaloka, your host Introducing Krishnaloka, who is driven to help others overcome their issues within their mind and pyschology.\nAs a mind technician trained in eutaptics (Faster EFT), she employs the fastest and most powerful method to create lasting change by addressing the root causes of issues rather than just the symptoms."
},
{
  "id": "Peace Over Panic: Rewiring the Anxious Mind-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Peace Over Panic: Rewiring the Anxious Mind",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103033-898757-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-19-18:15"
  ],
  "displayDate": "Tue 19 Aug",
  "url": "https://www.eventfinda.co.nz/2025/peace-over-panic-rewiring-the-anxious-mind2/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "How do we respond when the mind spirals, when uncertainty clouds our judgement, or when we find ourselves at a personal breaking point?\nThis workshop draws from ancient and time-tested wisdom found in yoga philosophy — especially the Bhagavad Gita — to explore how anxiety and inner conflict can become turning points for insight and conscious action.\nRather than avoiding or suppressing discomfort, the Gita offers a way to meet it — with clarity, honesty, and meaningful direction.\nThrough a blend of philosophical reflection and grounded tools, we’ll explore how to steady the mind and reconnect with deeper purpose in the face of pressure or doubt.\nMeet your host, Sivananda Sivananda’s background is in both science and music, holding a Master's Degree in Data Science, a Bachelor of Science in Physics and a long history of playing and performing on the double bass."
},
{
  "id": "True Tales of The Past of The Wellington Botanic Garden - Guided Walk-Wellington Botanic Garden, 101 Glenmore St, Kelburn, Wellington-Event Finder",
  "name": "True Tales of The Past of The Wellington Botanic Garden - Guided Walk",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103591-899029-35.jpg?v=2",
  "venue": "Wellington Botanic Garden, 101 Glenmore St, Kelburn, Wellington",
  "coordinates": {
    "lat": -41.282195,
    "long": 174.763785
  },
  "dates": [
    "2025-08-16-13:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/true-tales-of-the-past-of-the-wellington-botanic-garden-guided-walk/wellington",
  "source": "Event Finder",
  "eventType": "Education & Learning",
  "description": "An easy 60-minute interesting meander.\nMeet at the Founders' Entrance, Glenmore St.\nCost: $5 (cash only, please).\nThis is part of the regular walks run by the Friends of the Wellington Botanic Garden, they run twice monthly throughout the year with a different topic every time.\nJoin the Friends for only $30 a year and all the walks will be free, as well as other great benefit"
},
{
  "id": "Jewellery Making In 8 Weeks - Thursdays-Workspace Studios Ltd, 65 Abel Smith St, Wellington-Event Finder",
  "name": "Jewellery Making In 8 Weeks - Thursdays",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096115-895616-35.jpg?v=8",
  "venue": "Workspace Studios Ltd, 65 Abel Smith St, Wellington",
  "coordinates": {
    "lat": -41.2960596,
    "long": 174.7731283
  },
  "dates": [
    "2025-08-21-17:30"
  ],
  "displayDate": "Thu 21 Aug",
  "url": "https://www.eventfinda.co.nz/2025/jewellery-making-in-weeks-thursdays3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "It starts on Thurs 21 August and runs for 8 weeks until Thurs 9 October, 5.30-8pm.\nBeginners: Cabochon stone set ring.\nWe start with basic ring making in copper or brass, students will learn measuring, texturing, shaping, cutting and soldering.\nOnce your first setting is completed you can move to working in silver and produce another stone set ring with more interesting design elements.\nAdvanced: Chain Making and other projects."
},
{
  "id": "Little Creators-Capital E, 4 Queens Wharf, Wellington-Event Finder",
  "name": "Little Creators",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104227-899309-35.jpg",
  "venue": "Capital E, 4 Queens Wharf, Wellington",
  "coordinates": {
    "lat": -41.2852273,
    "long": 174.7784346
  },
  "dates": [
    "2025-07-23-11:00",
    "2025-07-30-11:00",
    "2025-08-06-11:00",
    "2025-08-13-11:00",
    "2025-08-20-11:00",
    "2025-08-27-11:00",
    "2025-09-03-11:00",
    "2025-09-10-11:00",
    "2025-09-17-11:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/little-creators/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Get creative with Aunty Cara at 11am each Wednesday in PlayHQ!\nCome along and try a sensory-based craft.\nTamariki work with new and exciting materials, learning different techniques to make special creations.\nBest suits ages 3-5, Little Creators is part of our E Tipu E Rea term-time programme.\nFree, donations appreciated."
},
{
  "id": "Ration the Queen's Veges-Circa Theatre, 1 Taranaki St, Wellington-Event Finder",
  "name": "Ration the Queen's Veges",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096530-895791-35.png",
  "venue": "Circa Theatre, 1 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.2902081,
    "long": 174.780383
  },
  "dates": [
    "2025-08-15-19:30",
    "2025-08-16-19:30",
    "2025-08-17-16:30",
    "2025-08-19-19:30",
    "2025-08-20-19:30",
    "2025-08-21-19:30",
    "2025-08-22-19:30",
    "2025-08-23-19:30",
    "2025-08-24-16:30",
    "2025-08-26-19:30",
    "2025-08-27-19:30",
    "2025-08-28-19:30",
    "2025-08-29-19:30",
    "2025-08-30-19:30",
    "2025-08-31-16:30",
    "2025-09-02-19:30",
    "2025-09-03-19:30",
    "2025-09-04-19:30",
    "2025-09-05-19:30",
    "2025-09-06-19:30",
    "2025-09-07-16:30",
    "2025-09-09-19:30",
    "2025-09-10-19:30",
    "2025-09-11-19:30",
    "2025-09-12-19:30",
    "2025-09-13-19:30"
  ],
  "displayDate": "Fri 15 Aug + more",
  "url": "https://www.eventfinda.co.nz/2025/ration-the-queens-veges/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Sometimes all you need to inspire change is a piece of gum Co-written by Te Wehi Ratana and Tainui Tukiwaho Directed by Tainui Tukiwaho In December 2023 the group ‘Te Waka Hourua’ set the country alight when they painted over the English Treaty of Waitangi Exhibition at Te Papa to read… ‘No.\nHer Majesty the Queen of England the alien.\nration the Queens veges.’ This ‘redaction action’ provoked strong opinions across Aotearoa – some sang their praises, others called for blood.\nWhile all of the artists were charged, only one received prison time: Te Wehi Ratana.\nThis uplifting new one-man play is inspired by true events, and shares the remarkable experience of the abseiling activist during his 48 hours at Rimutaka Prison."
},
{
  "id": "Yuzu Fest 2025-Garage Project Taproom, 91 Aro St, Aro Valley, Wellington-Event Finder",
  "name": "Yuzu Fest 2025",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103559-899014-35.png?v=2",
  "venue": "Garage Project Taproom, 91 Aro St, Aro Valley, Wellington",
  "coordinates": {
    "lat": -41.2954497,
    "long": 174.7668888
  },
  "dates": [
    "2025-07-23-15:00",
    "2025-07-24-15:00",
    "2025-07-25-15:00",
    "2025-07-26-12:00",
    "2025-07-27-12:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/yuzu-fest-2025/wellington",
  "source": "Event Finder",
  "eventType": "Food & Drink",
  "description": "Get ready to pucker up – Yuzu Fest is back and juicier than ever!\nOur annual celebration of all things citrus is returning in epic fashion, and the 2025 lineup is absolute gold.\nWe’re talking the triumphant return of fan faves like Yuzu Pernicious Weed and the sell-out sensation Yuzukoshu, alongside some fresh new zesty creations.\nCome sip your way through our week-long Yuzu Fest across all Garage Project venues.\nWhether you're a long-time lover of all things yuzu or just here for the citrusy vibes, this is one week you won't want to miss."
},
{
  "id": "Social Media Marketing for Small Enterprises: Visual Impact-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Social Media Marketing for Small Enterprises: Visual Impact",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103156-898841-35.jpg?v=4",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-21-17:30"
  ],
  "displayDate": "Thu 21 Aug",
  "url": "https://www.eventfinda.co.nz/2025/social-media-marketing-for-small-enterprises-visual-impact2/wellington",
  "source": "Event Finder",
  "eventType": "Business & Networking",
  "description": "You'll transform your social media presence and explore advanced techniques for using graphics, illustrations, and photographs to boost engagement.\nDescription Social Media Marketing for Small Enterprises: Visual Impact Whether you are just starting out or already running a business, having an online and social media presence is essential.\nWhile most of us know in theory that we need a marketing plan, a social media strategy, a consistent post schedule, and engaging reels for TikTok, the reality is that every business is unique, and your approach should reflect that.\nIn this course, we will explore different types of content suitable for your specific needs and audiences, how to create it or where to source it, how to develop the right visual strategy for your online presence, what tools to use, and how to implement it immediately.\nBy the end of the course, you will have an outstanding online presence."
},
{
  "id": "Author Talk - Erik Kennedy-Unity Books, 57 Willis St, Wellington-Event Finder",
  "name": "Author Talk - Erik Kennedy",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103653-899058-35.jpg",
  "venue": "Unity Books, 57 Willis St, Wellington",
  "coordinates": {
    "lat": -41.2878533,
    "long": 174.775679
  },
  "dates": [
    "2025-07-24-12:30"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/author-talk-erik-kennedy/wellington",
  "source": "Event Finder",
  "eventType": "Arts & Theatre",
  "description": "Join us for a unique lunchtime event featuring poet Erik Kennedy in conversation(s) about his bold new collection Sick Power Trip, a fierce exploration of climate change, capitalism, and the contradictions of modern life."
},
{
  "id": "Te Reo Māori - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Te Reo Māori - Introductory 1",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090468-893156-34.jpg?v=13",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-24-18:00"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/te-reo-maori-introductory-1/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "(NZ Citizens and residents pay $109 with ID, all others pay $199).\nDescription Te Reo Māori - Introductory 1 By the end of the course, you’ll be able to: • Have a basic understanding of the Māori spiritual and natural worlds (mana atua, mana whenua), and our important connections to them • Identify the sounds of Māori letters and pronounce letter combinations using correct intonation and stress patterns • Confidently greet people, introduce yourself and communicate basic personal information in an informal context • Identify and respond to phrases in the classroom including basic commands/instructions • Confidently describe the day/date, time, and the weather NOTE: This course is subsidised with funding from the Tertiary Education Commission (TEC) and you must provide photo ID when you attend your first session, if applicable.\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Take a Breathing Break-Johnsonville Library, 34 Moorefield Road, Wellington-Event Finder",
  "name": "Take a Breathing Break",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102989-898738-34.png?v=2",
  "venue": "Johnsonville Library, 34 Moorefield Road, Wellington",
  "coordinates": {
    "lat": -41.2228005,
    "long": 174.8048436
  },
  "dates": [
    "2025-07-31-17:45"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/take-breathing-break/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "This session isn’t about adding more to your to-do list, it’s about taking something off it: stress, overthinking, and emotional weight.\nThrough Breath.\nIn just 45 minutes, you can: 1.\nA grounded sense of calm 3.\nA taste of what the full programme offers Come take a breathing break."
},
{
  "id": "Live at 5 Wednesdays-Cable Top Eatery, 1 Upland Road, Wellington-Event Finder",
  "name": "Live at 5 Wednesdays",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102247-898376-35.jpg",
  "venue": "Cable Top Eatery, 1 Upland Road, Wellington",
  "coordinates": {
    "lat": -41.2856313,
    "long": 174.767663
  },
  "dates": [
    "2025-07-30-17:30"
  ],
  "displayDate": "Wed 30 Jul",
  "url": "https://www.eventfinda.co.nz/2025/live-at-wednesdays4/wellington",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "Calling all Dancing Queens (and Kings)!\nIntroducing The Toffee Pops, an electrifying duo that transforms any venue into a pulsating disco wonderland.\nWith their infectious energy and irresistible setlist of dance party hits, they keep the dance floor buzzing all night long.\nYou won’t be able to stay in your chair as The Toffee Pops perform “sweet as” songs that will get your toes tapping and your body boogying.\nFrom Donna Summer to Gloria Gaynor to the Bee Gees these Disco Divas will have you strutting your stuff with sassy attitude!"
},
]
