[
  {
    "id": "Sunday Jazz - Callum Allardice-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
    "name": "Sunday Jazz - Callum Allardice",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2099183-896916-35.jpg?v=2",
    "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
    "coordinates": {
      "lat": -41.29336,
      "long": 174.7745002
    },
    "dates": [
      "2025-08-03-17:00"
    ],
    "displayDate": "Sun 03 Aug",
    "url": "https://www.eventfinda.co.nz/2025/sunday-jazz-callum-allardice2/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "The Rogue's regular Sunday afternoon jazz. Funky, jazzy, soulful jazz. Beer and jazz, on a Sunday perfect!\n\nThis week featuring local guitarist Callum Allardice and his trio\n\nJoin the Callum Allardice trio for some favourite standards and standard inspired originals, featuring the talents of John Rae and Eli Mulheron.\n\nMusic from 5pm FREE ENTRY, koha for the band encouraged"
  },
  {
    "id": "Quiz Night-Saint Diablo, 25 Courtney Place, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064934-881297-35.jpg?v=2",
    "venue": "Saint Diablo, 25 Courtney Place, Wellington",
    "coordinates": null,
    "dates": [
      "2025-07-23-19:00",
      "2025-07-30-19:00",
      "2025-08-06-19:00",
      "2025-08-13-19:00",
      "2025-08-20-19:00",
      "2025-08-27-19:00",
      "2025-09-03-19:00",
      "2025-09-10-19:00",
      "2025-09-17-19:00",
      "2025-09-24-19:00",
      "2025-10-01-19:00",
      "2025-10-08-19:00",
      "2025-10-15-19:00",
      "2025-10-22-19:00",
      "2025-10-29-19:00",
      "2025-11-05-19:00",
      "2025-11-12-19:00",
      "2025-11-19-19:00",
      "2025-11-26-19:00",
      "2025-12-03-19:00",
      "2025-12-10-19:00",
      "2025-12-17-19:00"
    ],
    "displayDate": "Wed 23 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night15/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Every Wednesday is trivia night at one of Wellington's most popular quiz venues - Saint Diablo's!\n\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew! So if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\n\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
  },
  {
    "id": "Pottery - Handbuilding Basics-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Pottery - Handbuilding Basics",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090512-893187-35.jpg?v=2",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-21-17:30"
    ],
    "displayDate": "Mon 21 Jul",
    "url": "https://www.eventfinda.co.nz/2025/pottery-handbuilding-basics2/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Learn how to prepare and alter clay. (Held at Wellington Potters' Association, 130 Grant Road, Thorndon).\n\nLearn how to prepare and alter clay: pinch, coil, slab, extruder and roller use. Understand shrinkage and clay care, joining techniques, drape and press moulding, mark making, slip making and application - as well as tetrahedron, cone and cylinder production\n\nThe techniques learnt during the making will provide an excellent springboard to creating a wide array of ceramic objects in the future.\n\nThe emphasis will be on learning techniques and honing those skills and by the end of the 8 sessions you will have completed three works which will be fired and glazed.\n\nPottery courses are held at Wellington Potters' Association, 130 Grant Road, Thorndon. All our courses are scheduled up to a year in advance which means the at times we may need to make changes to the original schedule. Please make sure you check your emails regularly in case of any changes.\n\nAll materials included in course fee. For more information about Wellington Potters, click on this link.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\nOffsite Pottery Courses\nPresented by Peter Rumble\n$499. incl. GST"
  },
  {
    "id": "Microsoft Excel - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Microsoft Excel - Beginners",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100911-897710-34.jpg?v=22",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-09-09:00"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.eventfinda.co.nz/2025/microsoft-excel-beginners3/wellington",
    "source": "Event Finder",
    "eventType": "Business & Networking",
    "description": "An introduction to this popular spreadsheeting package - basic Windows skills essential. Learn how to create and use spreadsheets, as well as identify elements of a workbook, enter and edit data, generate basic calculations and use built-in spreadsheet functions.\n\nWindows skills essential - this is not a course for absolute beginners to computing.\n\nBy the end of the course, you'll have had a basic introduction to using MS Excel, including how to:\n- Identify elements of a workbook\n- Page setup and printing\n- Enter and edit data and basic formatting\n- Generate basic calculations\n- Use cell references and built-in functions\n\nPresented by Lachman Prasad."
  },
  {
    "id": "Guitar - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Guitar - Beginners",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090519-893193-35.jpg?v=21",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-17:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/guitar-beginners3/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Learn the basic chords, strumming and lots of songs.\nBring your acoustic guitar.\n\nBy the end of the course, you'll have learned how to play simple guitar tunes, using easy tricks the professionals use. You'll be able to:\n- Demonstrate a number of basic chords\n- Demonstrate a range of basic strumming patterns\n- Play a range of simple songs confidently - Demonstrate how to tune a guitar\n- Demonstrate how to use a capo\nBring your own acoustic guitar.\n\nWellington High School\nPresented by Will Allardice\n$125.00 incl. GST"
  },
  {
    "id": "Writers on Mondays: Jennifer Trevelyan and Jenny Pattrick-Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington-Event Finder",
    "name": "Writers on Mondays: Jennifer Trevelyan and Jenny Pattrick",
    "imageUrl": "",
    "venue": "Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington",
    "coordinates": {
      "lat": -41.2903326,
      "long": 174.7819275
    },
    "dates": [
      "2025-08-11-12:15"
    ],
    "displayDate": "Mon 11 Aug",
    "url": "https://www.eventfinda.co.nz/2025/writers-on-mondays-jennifer-trevelyan-and-jenny-pattrick/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "HIGH TIDE: JENNIFER TREVELYAN AND JENNY PATTRICK\nSeasoned Wellington writer Jenny Pattrick’s latest novel, Sea Change, digs into the developing tensions within a small Kāpiti Coast community forced to negotiate a managed retreat after a rupture in the Alpine fault generates a devastating tsunami. Tensions of a different kind propel debut author Jennifer Trevelyan’s A Beautiful Family. This suspenseful coming-of-age novel turns around a summer holiday on the coast and the search for a missing girl. Two authors at different stages of their careers discuss their work with Kate Duignan.\n\nADMISSION IS FREE—ALL WELCOME\nWriters on Mondays is presented with the Museum of New Zealand Te Papa Tongarewa, Circa Theatre, Meow and Phantom Billstickers National Poetry Day and supported by the Letteri Family."
  },
  {
    "id": "Natural Textured Rings-Workspace Ōtaki, 6 Hewson Crescent, Ōtaki-Event Finder",
    "name": "Natural Textured Rings",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096069-895605-35.jpg?v=10",
    "venue": "Workspace Ōtaki, 6 Hewson Crescent, Ōtaki",
    "coordinates": {
      "lat": -40.735135,
      "long": 175.1251335
    },
    "dates": [
      "2025-07-19-13:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.eventfinda.co.nz/2025/natural-textured-rings3/otaki",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Make your own personalised ring - a gift for yourself or someone special! :-)\n\nLearn the basic technique first in copper or brass, and then craft your final piece in silver!\n\nOver this taster class, you’ll be guided through the process of heating and texturing metal, cutting and shaping with traditional jewellery tools. Use feathers, leaves, or fabrics to create a unique texture for a beautiful ring!\n\nLearn to measure your finger, cut metal to length and texture it without rolling mill, hammers and punches. Then use a jewellers torch, sandpaper and polishing, and your beautiful new ring will be ready to wear.\n\nThis 3-hour class is ideal for beginners, groups of friends and visitors to the city.\n\nIncluded in the class fee are copper and brass for practising on, a sterling silver ring strip and all consumables such as sandpaper, solder and chemicals. Extra metals are available for purchase in the studio.\n\nKids aged 12 (or so) are welcome to attend the class, but any person under the age of 16 must be accompanied by adults."
  },
  {
    "id": "Take a Breathing Break-Johnsonville Library, 34 Moorefield Road, Wellington-Event Finder",
    "name": "Take a Breathing Break",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102989-898738-34.png?v=2",
    "venue": "Johnsonville Library, 34 Moorefield Road, Wellington",
    "coordinates": {
      "lat": -41.2228005,
      "long": 174.8048436
    },
    "dates": [
      "2025-07-31-17:45"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.eventfinda.co.nz/2025/take-breathing-break/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "Take a Breathing Break to Reset - Recharge - Reconnect with yourself!\n\nThis session isn’t about adding more to your to-do list, it’s about taking something off it: stress, overthinking, and emotional weight. Through Breath.\n\nIn just 45 minutes, you can:\n1. Sharpen focus – feel clear and mentally present\n2. Sleep better – calm your nervous system for deeper rest\n3. Be more present – around whānau, friends, and colleagues\n4. Boost wellbeing – reduce stress, emotional overwhelm, and fatigue\n5. Reset – more powerfully than a coffee break\n\nWhat to expect:\nA guided session with easy breathwork techniques suitable for all levels. You’ll leave with:\n1. A simple tool you can practise anytime\n2. A grounded sense of calm\n3. A taste of what the full programme offers\n\nCome take a breathing break. It's no us!"
  },
  {
    "id": "P & K’s - Bangers and Brews-P&K's Martinborough, 14 Jellicoe Street, Martinborough-Event Finder",
    "name": "P & K’s - Bangers and Brews",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100371-897471-35.jpg",
    "venue": "P&K's Martinborough, 14 Jellicoe Street, Martinborough",
    "coordinates": {
      "lat": -41.2189794,
      "long": 175.4585186
    },
    "dates": [
      "2025-08-15-16:00"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.eventfinda.co.nz/2025/p-bangers-and-brews/wairarapa",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "Come and enjoy an evening of Martinborough’s finest! Taste a selection of locally made sausages (bangers) paired with craft beers from our own region. It’s a celebration of the best local flavors, perfect for food and beer lovers alike.\nFree event\nWet weather option and good weather we will be in the carpark."
  },
  {
    "id": "Speed Dating for Friendship-Kanteen Cafe, 7 Waterloo Quay, Wellington-Event Finder",
    "name": "Speed Dating for Friendship",
    "imageUrl": "",
    "venue": "Kanteen Cafe, 7 Waterloo Quay, Wellington",
    "coordinates": {
      "lat": -41.2808254,
      "long": 174.7793741
    },
    "dates": [
      "2025-08-15-18:15"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.eventfinda.co.nz/2025/speed-dating-for-friendship/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Looking to make new friends who really get you? Whether you're into sports, gaming, arts, books, travel, or trying something new—Speed Friending is your chance to meet like-minded people in a relaxed, welcoming environment.\n\nHere’s how it works:\n\nThe room will be set up with themed tables—think sports, creative hobbies, outdoor adventures, pop culture, and more.\n\nEvery round, you'll join a table that matches your interest and chat with others who share your passion.\n\nThis isn’t a romantic speed-dating event—it’s a friend-making experience designed to spark genuine conversations and help you find your people.\n\nAll are welcome—come solo or bring a friend!\n\nPrice includes a drink and delicious food at the break!\n\nWe will have the entire venue for this event."
  },
  {
    "id": "Winterlude-The Undercurrent, 118 Tory Street, Wellington-Event Finder",
    "name": "Winterlude",
    "imageUrl": "",
    "venue": "The Undercurrent, 118 Tory Street, Wellington",
    "coordinates": {
      "lat": -41.2960797,
      "long": 174.7795355
    },
    "dates": [
      "2025-08-01-19:00"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.eventfinda.co.nz/2025/winterlude/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "We are thrilled to announce…\n\nWinterlude: A night of original songs and verse.\n\nWinterlude is a series of intimate winter concerts involving poets and singers/songwriters. The first of these took place last year in Mana Little Theatre in Plimmerton and at the Coastal Musical Theatre in Kapiti, both to well received sold out shows. We are very excited to be hosting their Wellington debut!\n\nPerformers are:\n\n\nBarry Saunders (Warratahs)\n\nCaroline Easther (with friends)\n\nAlan Galloway (with Tatiana Sogrina)\n\nPoet Nikki-Lee Birdsey\n\nPoet Rebekah Burgess\n\n\nDoors 6:30 pm/Gig 7:00 pm\n\nTickets $25 available on the door and online.\n\nComplimentary snacks, wine, beer & soft drinks, tea & coffee, and of course...books available for purchase!\n\nWe’ll see you there..."
  },
  {
    "id": "Anyone Can Draw - Structural - Mornings-Inverlochy Art School, 3 Inverlochy Place, Wellington-Event Finder",
    "name": "Anyone Can Draw - Structural - Mornings",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102406-898468-35.jpg?v=3",
    "venue": "Inverlochy Art School, 3 Inverlochy Place, Wellington",
    "coordinates": {
      "lat": -41.2941697,
      "long": 174.7700143
    },
    "dates": [
      "2025-07-25-10:00"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.eventfinda.co.nz/2025/anyone-can-draw-structural-mornings/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "In this 8 week morning course you will examine structural drawing with a careful helpful approach, focusing on simple perspective drawing and the value of geometric shapes and solids. Both these structural approaches contribute greatly to the success of your drawing.\n\nGeometric shapes can simplifying a subject, unify a drawing and make compositions dynamic. Geometric solids will help render any subject in three dimensions and transition to perspective.\n\nA good working knowledge of the concepts of perspective will help you draw any subject with correct dimensionality. It can also help in your realist drawing, painting and invented subjects and environments. These concepts are also used in most two dimensional art because it enables us to realise great spatial effects, making it an invaluable tool to add to your skill set."
  },
  {
    "id": "Quiz Night-Choice Bros, 62 Ghuznee Street, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064900-881270-35.png?v=4",
    "venue": "Choice Bros, 62 Ghuznee Street, Wellington",
    "coordinates": {
      "lat": -41.2929676,
      "long": 174.7751326
    },
    "dates": [
      "2025-07-22-19:00",
      "2025-07-29-19:00",
      "2025-08-05-19:00",
      "2025-08-12-19:00",
      "2025-08-19-19:00",
      "2025-08-26-19:00",
      "2025-09-02-19:00",
      "2025-09-09-19:00",
      "2025-09-16-19:00",
      "2025-09-23-19:00",
      "2025-09-30-19:00",
      "2025-10-07-19:00",
      "2025-10-14-19:00",
      "2025-10-21-19:00",
      "2025-10-28-19:00",
      "2025-11-04-19:00",
      "2025-11-11-19:00",
      "2025-11-18-19:00",
      "2025-11-25-19:00",
      "2025-12-02-19:00",
      "2025-12-09-19:00",
      "2025-12-16-19:00"
    ],
    "displayDate": "Tue 22 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night14/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Come join us for the weekly ritual on a Tuesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\n\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\n\nAdd to the mix exquisite beers, delicious food and an incredible vibe, it's the place to be on a Tuesday night with plenty of time for laughter, banter and merrymaking!\n\nThe quiz kicks off at 7pm and runs for roughly 2 hours. So, grab your buddies and come on down and join us for one of Wellington's best quiz nights – Choice Bros style!"
  },
  {
    "id": "Mamma Mia!-St James Theatre, 77-87 Courtenay Place, Wellington-Event Finder",
    "name": "Mamma Mia!",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2093398-894441-35.jpg?v=3",
    "venue": "St James Theatre, 77-87 Courtenay Place, Wellington",
    "coordinates": {
      "lat": -41.2932163,
      "long": 174.7803883
    },
    "dates": [
      "2025-08-13-19:30",
      "2025-08-14-19:30",
      "2025-08-15-19:30",
      "2025-08-16-14:00",
      "2025-08-16-19:30",
      "2025-08-17-16:00",
      "2025-08-19-19:30",
      "2025-08-20-19:30",
      "2025-08-21-19:30",
      "2025-08-22-19:30",
      "2025-08-23-14:00",
      "2025-08-23-19:30",
      "2025-08-24-16:00",
      "2025-08-26-19:30",
      "2025-08-27-19:30",
      "2025-08-28-19:30",
      "2025-08-29-19:30",
      "2025-08-30-14:00",
      "2025-08-30-19:30",
      "2025-08-31-14:00"
    ],
    "displayDate": "Wed 13 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/mamma-mia/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Get ready to say “I Do, I Do, I Do, I Do, I Do!” to the smash-hit jukebox musical based on the songs of Swedish super-group ABBA.\n\nThis sunny, funny, international phenomenon unfolds on a Greek island paradise when, on the eve of her wedding, a young woman’s quest to discover the identity of her father brings three men from her mother's past back to the island they last visited 20 years ago.\n\nWith music & lyrics by Benny Andersson & Björn Ulvaeus, Mamma Mia! is written by Catherine Johnson and features non-stop laughs and explosive dance numbers, set to ABBA's hit songs including Super Trouper, Dancing Queen, Knowing Me, Knowing You; Take a Chance on Me, Thank You for the Music, Money, Money, Money; The Winner Takes It All and SOS.\n\nOver 70 million people all around the world have fallen in love with the characters, the story and timeless music that makes Mamma Mia! the ultimate feel-good show. It’s been translated into 16 different languages and in 2011 it became the first Western musical ever to be staged in Mandarin in the People’s Republic of China. MAMMA MIA! became the 8th longest running show in Broadway history where it played a record-breaking run for 14 years."
  },
  {
    "id": "Life Drawing-Fareham Creative Space, 80 Underhill Rd, Featherston-Event Finder",
    "name": "Life Drawing",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103000-898744-35.jpg?v=3",
    "venue": "Fareham Creative Space, 80 Underhill Rd, Featherston",
    "coordinates": {
      "lat": -41.1073902,
      "long": 175.3314082
    },
    "dates": [
      "2025-08-03-14:00",
      "2025-09-07-14:00",
      "2025-10-05-14:00",
      "2025-11-02-14:00",
      "2025-12-07-14:00"
    ],
    "displayDate": "Sun 03 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/life-drawing/featherston",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Life drawing for adults - this is a regular monthly class. Your tutor Joanne will lead you through a series of drawing exercises with a live model, while you work on proportion, light and shadow, and capturing dynamic energy. This is a great regular workshop to practice the basics, and develop your artistry and personal style in your drawing practice.\n\nCome learn with a friendly crowd!\n\n$40 pp bookings at registrations@farehamcreativespace.co.nz"
  },
  {
    "id": "The Mars Blueberry Astrobiology Dome-Martinborough Town Hall, 8 Texas St, Martinborough-Event Finder",
    "name": "The Mars Blueberry Astrobiology Dome",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096225-895664-35.png",
    "venue": "Martinborough Town Hall, 8 Texas St, Martinborough",
    "coordinates": {
      "lat": -41.2190463,
      "long": 175.4612097
    },
    "dates": [
      "2025-08-16-10:30",
      "2025-08-17-14:00"
    ],
    "displayDate": "Sat 16 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/the-mars-blueberry-astrobiology-dome/martinborough",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "The Mars Blueberry Astrobiology Dome is New Zealand's one-of-a-kind portable planetarium experience. It's round, it's blue, and inside it, your mini astronauts will learn about planets, galaxies, the origin of life, and whether aliens are out there.\nMost importantly, they get to ask questions to real space scientists! Hari is an astrobiologist who interned at NASA and is a Mars researcher, and Sam is an astrophysicist. They both love answering questions about space and looking at the stars at night with really large telescopes (make sure you check their Star Safari experience too).\n\nHari and Sam have logged an impressive over 200 school and event visits with the Mars Blueberry since they started in 2022 and have hosted more than 38,000 people through the airlock of the Blueberry.\n\nEach session is a 20-minute live voyage through the universe. No scripts, no recordings – just real science, real stories, and your real questions.\nPlease note: Children must be accompanied by an adult at all times."
  },
  {
    "id": "Quiz Night-Kelburn Village Pub, 87 Upland Rd, Kelburn, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064348-880978-35.png?v=7",
    "venue": "Kelburn Village Pub, 87 Upland Rd, Kelburn, Wellington",
    "coordinates": {
      "lat": -41.2893387,
      "long": 174.7622361
    },
    "dates": [
      "2025-07-22-19:00",
      "2025-07-29-19:00",
      "2025-08-05-19:00",
      "2025-08-12-19:00",
      "2025-08-19-19:00",
      "2025-08-26-19:00",
      "2025-09-02-19:00",
      "2025-09-09-19:00",
      "2025-09-16-19:00",
      "2025-09-23-19:00",
      "2025-09-30-19:00",
      "2025-10-07-19:00",
      "2025-10-14-19:00",
      "2025-10-21-19:00",
      "2025-10-28-19:00",
      "2025-11-04-19:00",
      "2025-11-11-19:00",
      "2025-11-18-19:00",
      "2025-11-25-19:00",
      "2025-12-02-19:00",
      "2025-12-09-19:00",
      "2025-12-16-19:00",
      "2025-12-23-19:00",
      "2025-12-30-19:00",
      "2026-01-06-19:00",
      "2026-01-13-19:00",
      "2026-01-20-19:00",
      "2026-01-27-19:00",
      "2026-02-03-19:00",
      "2026-02-10-19:00"
    ],
    "displayDate": "Tue 22 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night7/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Come join us and legendary host Savage for the weekly ritual on a Tuesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\n\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\n\nAdd to the mix exquisite cocktails, delicious food and an incredible vibe, it's the place to be on a Tuesday night with plenty of time for laughter, banter and merrymaking!\n\nThe quiz kicks off at 7pm and runs for roughly 2 hours. So, grab your buddies and come on down and join us for one of Ponsonby’s best quiz nights – KVP style!\n\nFollow the Facebook pages for updates and new quiz dates for 2025!"
  },
  {
    "id": "Tonga Language Week Flag Raising Ceremony-Te Rauparaha Park, Norrie Street, Porirua, Porirua - Mana-Event Finder",
    "name": "Tonga Language Week Flag Raising Ceremony",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2079858-888412-34.png?v=6",
    "venue": "Te Rauparaha Park, Norrie Street, Porirua, Porirua - Mana",
    "coordinates": null,
    "dates": [
      "2025-08-18-08:00"
    ],
    "displayDate": "Mon 18 Aug",
    "url": "https://www.eventfinda.co.nz/2025/tonga-language-week-flag-raising-ceremony/porirua-mana",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Uike Kātoanga’i ‘o e lea faka-Tonga – Tonga Language Week\nCelebrate: 17 - 23 August 2025\n\nYou are invited to join the formal flag raising ceremony, at the Peace Memorial in Te Rauparaha Park.\n\nThis event is weather dependant and will be moved to the performing arts space at Pātaka if raining. The flag raising ceremony will also be morning tea and refreshments at Pātaka after the ceremony.\n\nFind out more about the Pacific Language Weeks here:\n\nhttps://poriruacity.govt.nz/your-council/pacific-culture-in-porirua-city/pacific-language-weeks/"
  },
  {
    "id": "Te Aro Zero Waste Repair Cafe-Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington-Event Finder",
    "name": "Te Aro Zero Waste Repair Cafe",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2098173-896443-35.png",
    "venue": "Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington",
    "coordinates": {
      "lat": -41.2942803,
      "long": 174.7817841
    },
    "dates": [
      "2025-08-16-13:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/te-aro-zero-waste-repair-cafe/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Come along to our third Repair Cafe for 2025!\nBook your spot online and bring along one item for repair or maintenance - small electrical appliances, welding repair, gardening tools for sharpening, jewellery, or that general item you've been meaning to have repaired.\nOur skilled volunteers will be here to assist you with fixes such as electrical faults, broken clasps, union/wedding ring repair, welding or general fix-up repairs.\nThese sessions will be held at Te Aro Zero Waste (Sustainability Trust), 2 Forresters Lane, Te Aro.\nBookings are necessary, donations welcome. All koha goes straight back to celebrate our community of generous volunteers."
  },
  {
    "id": "Negotiation Skills for Successful Outcomes-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Negotiation Skills for Successful Outcomes",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2088835-892379-34.jpg?v=17",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/negotiation-skills-for-successful-outcomes2/wellington",
    "source": "Event Finder",
    "eventType": "Business & Networking",
    "description": "Everyone negotiates—at work, at home, or anywhere in between. Whether you're closing deals or resolving conflicts, learn how to get what you want and bring others on board with your vision. (NZ citizens and residents free with ID, others pay $100).\n\nDescription\nNegotiation Skills for Successful Outcomes\n\nWhat’s the Goal?\nTo arm you with the strategies, skills, and mindset to walk into any negotiation and leave with the outcome you desire.\n\nWhat You'll Discover:\n\nCrack the Code on People: Spot different types of negotiators and tailor your approach using the DISC methodology.\nGear Up for Success: Build a killer prep list with intel on your opponent and a clear inventory of your strengths.\nOwn the Room: Master the art of negotiation strategy, use space to your advantage, and know the unspoken rules.\nDiscover Your Edge: Tap into your natural negotiation style and make it work for you.\nLearn from the Masters: Unlock game-changing tips and theories from the biggest “gurus” in the field.\nPractice Makes Perfect: Get hands-on with exercises that turn theory into action.\nReady to negotiate like a pro? This workshop will show you how to make your case, win people over, and seal the deal.\n\nYou must be a NZ citizen or resident to register in this course for free and you must provide photo ID when you attend.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\n\n1 day, Sat 9:30 AM - 3:30 PM\nWellington High School\nPresented by Andrew Matushkin\n$100.00 incl. GST\nNZ Residents and Citizens $0.00 incl. GST"
  },
  {
    "id": "Milly Moon - Free Live Music Wednesdays-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "Milly Moon - Free Live Music Wednesdays",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102625-898580-34.jpg?v=2",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-23-19:00"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/milly-moon-free-live-music-wednesdays/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "A vocalist known for remarkable range and diversity, Moon’s joyful veneration for unadorned song is captivating. Her rich melody, storytelling and seamless weaving of prose, inspiring intimate, rare and darkly explosive performances.\n\nMusic from 7pm, $15 pizzas 5.30-9"
  },
  {
    "id": "The Bebop Brigade-The Undercurrent, 118 Tory Street, Wellington-Event Finder",
    "name": "The Bebop Brigade",
    "imageUrl": "",
    "venue": "The Undercurrent, 118 Tory Street, Wellington",
    "coordinates": {
      "lat": -41.2960797,
      "long": 174.7795355
    },
    "dates": [
      "2025-07-25-19:30"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.eventfinda.co.nz/2025/the-bebop-brigade2/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Burning tempo? Cymbal crash? Call the Bebop Brigade!\n\nThis hot new quintet is equipped with all the finest bebop tunes from the 40s and 50s and is ready to go at a moment's notice. They will play a range of songs, from Charlie Parker classics to underground tunes by Lou Donaldson and Fats Navarro.\n\nAppearing for the first time at the Undercurrent, the band is excited to present a new set of rare tunes and bop classics. Expect exhilarating swing, gorgeous ballads, and intricate melodies. Come along for an exciting night of music, relax on a comfortable chair, and join us as we explore these iconic tunes.\n\nPersonnel:\nAlex Trask - alto saxophone\nMichael Costeloe - trumpet\nLockie Bennett - guitar\nElijah Mulheron - bass\nMark Lockett - drums\n\nFriday 25th July\nDoors 7pm/ Gig 7:30pm\n$20\nTickets available on the door and online.\n\nWe'll see you there!"
  },
  {
    "id": "Dried Flower Wreath Workshop-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Dried Flower Wreath Workshop",
    "imageUrl": "",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/dried-flower-wreath-workshop2/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Come and learn how to make a dried flower wreath (25-30cm wide) with Red Ruth from Bloomin Heck Wreaths.\n\nDescription\nA long-lasting decoration for your home, or to give as a gift. Great beginners class with step by step instructions to ensure you make something you are proud to take home!\n\nEnrol with a family member or friend or come and make new friends!\n\nThe fee includes all dried flowers, foliage, vine wreath and box to carry your wreath in.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Paint and Wine Night - Dali - The Persistence of Memory-Cambridge Hotel, 28 Cambridge Terrace, Wellington-Event Finder",
    "name": "Paint and Wine Night - Dali - The Persistence of Memory",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102161-898326-35.jpg?v=2",
    "venue": "Cambridge Hotel, 28 Cambridge Terrace, Wellington",
    "coordinates": {
      "lat": -41.2951329,
      "long": 174.7828783
    },
    "dates": [
      "2025-08-05-19:00"
    ],
    "displayDate": "Tue 05 Aug",
    "url": "https://www.eventfinda.co.nz/2025/paint-and-wine-night-dali-the-persistence-of-memory/wellington",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "The concept is simple - take a brush in one hand, a drink in the other and let’s paint a masterpiece!\n\nJoin us for a creative night of drinking and painting in the heart of Henderson, West Auckland! No previous painting experience necessary. Get your creative juices flowing and your brush strokes going!\n\nDrinks: No drinks are included in the ticket price, but drinks are available for purchase.\n\nFood: A delicious menu will be available to purchase throughout the event.\n\nWhat is Paintvine?\nIt’s a fun social painting class where our artists will run you through step-by-step instructions on how to create your very own masterpiece in a fun and relaxed bar setting. Perfect for dates, catching up with mates or for meeting new friends!\n\nWe provide all the materials you need (high-quality canvas, acrylic paint, brushes). All you need to bring is your creative spirit (or find some at the bottom of a glass). At the end of the night you will leave with your own painting ready to hang up on your wall.\n\nFor tickets, future events, FAQs and more info head to the Paintvine website."
  },
  {
    "id": "Ngaio Repair Cafe-Ngaio Repair Cafe, corner Kenya St and Crofton Road, Ngaio, Wellington-Event Finder",
    "name": "Ngaio Repair Cafe",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2085436-890783-35.jpg",
    "venue": "Ngaio Repair Cafe, corner Kenya St and Crofton Road, Ngaio, Wellington",
    "coordinates": null,
    "dates": [
      "2025-07-19-10:00",
      "2025-08-16-10:00",
      "2025-09-21-10:00",
      "2025-10-21-10:00",
      "2025-11-16-10:00"
    ],
    "displayDate": "Sat 19 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/ngaio-repair-cafe/wellington-region",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Ngaio Repair Café, organised in and by Ngaio Union Church, is part of the worldwide Repair Café movement to cut down waste and reduce greenhouse gas emissions. Our local volunteer repairers will look at and try to fix all sorts of household gear: wooden, metal, electrical, electronic, pottery, computer, fabric, toys, clothing, beads, cardboard – as long as it’s small enough for you to bring. One of our volunteers is a guitar repairer who can mend and tune any fretted instruments. Another has an oilstone and will sharpen knives. While you wait to have your item looked at, tea and coffee and cold drink are provided. Children with care-givers are welcome. We have some basic materials on site but if your broken thing needs specific parts (e.g. zip, plug) please bring those along. It’s all free but a gold coin koha is appreciated to help local community need. We open each third Saturday of the month beginning February and finishing November."
  },
  {
    "id": "Paekākāriki Market Day-St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki-Event Finder",
    "name": "Paekākāriki Market Day",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2060121-878946-35.jpg?v=2",
    "venue": "St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki",
    "coordinates": null,
    "dates": [
      "2025-08-02-09:00",
      "2025-09-06-09:00",
      "2025-10-04-09:00",
      "2025-11-01-09:00"
    ],
    "displayDate": "Sat 02 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/paekakariki-market-day/paekakariki",
    "source": "Event Finder",
    "eventType": "Markets & Fairs",
    "description": "Come to Paekākāriki for great food and coffee, and visit our monthly market.\nThere is an eclectic range of stalls selling crafts, skin care products, food, plants, books and second hand items and more."
  },
  {
    "id": "Memory Mastery for Confidence Workshop-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Memory Mastery for Confidence Workshop",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102737-898642-35.jpg?v=3",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-09-09:30"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.eventfinda.co.nz/2025/memory-mastery-for-confidence-workshop3/wellington",
    "source": "Event Finder",
    "eventType": "Education & Learning",
    "description": "Unlock your mind's full potential with \"Memory Mastery,\" led by Neil Thornton, award-winning educator and founder of NZ Comedy School. Drawing on over 30 years of teaching experience and cognitive research, this workshop equips you with powerful, scientifically-proven memory techniques.\n\nLearn to retain names and lists, learn vocabulary, deliver presentations without notes, and boost your professional efficiency. Discover how to create vivid mental imagery, use spatial memory techniques, and leverage the power of association to revolutionise your recall abilities. Whether you're a busy professional, a student, or simply looking to sharpen your mental acuity, this course offers practical, immediately applicable skills for enhanced memory performance in both personal and professional settings.\n\nBring pen and paper if you wish to take notes.\n\nTea and coffee provided, please bring your lunch and snacks.\n\nNOTE: This course is subsidised with funding from the Tertiary Education Commission (TEC) and you must provide photo ID when you attend your first session, if applicable.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "This Will Suck | A Work in Progress with Raybon Kan-Circus Bar, 17b Allen St, Wellington-Event Finder",
    "name": "This Will Suck | A Work in Progress with Raybon Kan",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102039-898276-35.png",
    "venue": "Circus Bar, 17b Allen St, Wellington",
    "coordinates": {
      "lat": -41.2929705,
      "long": 174.7826363
    },
    "dates": [
      "2025-07-20-18:00"
    ],
    "displayDate": "Sun 20 Jul",
    "url": "https://www.eventfinda.co.nz/2025/this-will-suck-work-in-progress-with-raybon-kan/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Join Raybon Kan for an hour or so of comedy (or should that be pre-comedy?) that isn't quite ready. Ever wondered how comedy is prepared? See the ingredients being mixed and the sausage being made and taste it before it's cooked.\n\nJust $10 but please be aware ... this show will probably suck. You will be humbly implored not to form an impression of Raybon from this experience."
  },
  {
    "id": "Songwriter Showcase #104-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "Songwriter Showcase #104",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2101710-898116-35.png",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-20-18:00"
    ],
    "displayDate": "Sun 20 Jul",
    "url": "https://www.eventfinda.co.nz/2025/songwriter-showcase-104/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Songwriter Showcase presents showcase #104, Sun July 20th at Moon bar in Newtown.\n\nEvery month we showcase four of local songwriters and celebrate the rich culture and depth of talent we have here in Aotearoa.\n\nThis month we present our big busy Midwinter Massive, four great acts.. The Overdogs, The Kingston High All Stars, Buffalo Buffalo Buffalo and Janet Muggeridge and Dave Murphy."
  },
  {
    "id": "Quiz Night-The Featherston Tavern, 133 Featherston St, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2078474-887770-35.jpg?v=2",
    "venue": "The Featherston Tavern, 133 Featherston St, Wellington",
    "coordinates": {
      "lat": -41.2828658,
      "long": 174.7774662
    },
    "dates": [
      "2025-07-22-18:30",
      "2025-07-29-18:30",
      "2025-08-05-18:30",
      "2025-08-12-18:30",
      "2025-08-19-18:30",
      "2025-08-26-18:30",
      "2025-09-02-18:30",
      "2025-09-09-18:30",
      "2025-09-16-18:30",
      "2025-09-23-18:30",
      "2025-09-30-18:30",
      "2025-10-07-18:30",
      "2025-10-14-18:30",
      "2025-10-21-18:30",
      "2025-10-28-18:30",
      "2025-11-04-18:30",
      "2025-11-11-18:30",
      "2025-11-18-18:30",
      "2025-11-25-18:30",
      "2025-12-02-18:30",
      "2025-12-09-18:30",
      "2025-12-16-18:30",
      "2025-12-23-18:30"
    ],
    "displayDate": "Tue 22 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night20/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Featherston Tavern Quiz Night – Every Tuesday!\n\nThink you’ve got the smarts? Grab your team and head down to the Featherston Tavern every Tuesday night for our legendary Quiz Night! Hosted in a fun and relaxed atmosphere, this is your chance to show off your trivia chops and win great prizes.\n\nWhether you’re a quiz veteran or a first-timer, everyone’s welcome. Entry is free, teams can be any size, and the kitchen and bar are open all night\n\nQuiz kicks off at 6.30pm – get in early to grab a table!\n\nPhone 04 472 4045 or email thefeatherston@xtra.co.nz to book your table."
  },
  {
    "id": "Wairarapa Garden Fiesta-Clareville Showgrounds, Chester Road, Clareville, Carterton-Event Finder",
    "name": "Wairarapa Garden Fiesta",
    "imageUrl": "",
    "venue": "Clareville Showgrounds, Chester Road, Clareville, Carterton",
    "coordinates": {
      "lat": -40.9668017,
      "long": 175.5414152
    },
    "dates": [
      "2025-08-16-09:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/wairarapa-garden-fiesta/carterton",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "The ever-popular Wairarapa Garden Fiesta is back for 2025.\n\nCome and enjoy this ONE DAY festival of all things gardening - from plants to produce, and everything in between!\n\nIndoor and Outdoor sites,\n\nProudly brought to you by The Wairarapa A&P Society & Garden Barn Masterton\n\nFree Entry:\n\nPLANTS, PLANTS & MORE"
  },
  {
    "id": "Lost Wax Casting - 6 Weeks Course-Workspace Studios Ltd, 65 Abel Smith St, Wellington-Event Finder",
    "name": "Lost Wax Casting - 6 Weeks Course",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096105-895611-35.jpg?v=11",
    "venue": "Workspace Studios Ltd, 65 Abel Smith St, Wellington",
    "coordinates": {
      "lat": -41.2961131,
      "long": 174.7730097
    },
    "dates": [
      "2025-08-13-17:30"
    ],
    "displayDate": "Wed 13 Aug",
    "url": "https://www.eventfinda.co.nz/2025/lost-wax-casting-weeks-course2/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "A fantastic class full of fun and inspiration! It starts on Wed 13 August and runs until Wed 17 September, 5.30pm-8pm.\n\nLevel one: Students learn carving in hard wax, texture forming in soft wax, and how to clean up and finish your metal pieces. Course costs include basic materials for the process, but do not include the eventual metal costs for the pieces you choose to cast. As this is subject to each students' choice of size and type of metal, we leave this up to you to decide.\n\nCastings may cost between $5 and $40 depending on whether you cast in Silver or Bronze. Casting in Bronze or Brass will be much cheaper.\n\nLevel two: expand your range of designs and skills with the wax you prefer using. Learn to set stones into your designs and either: Cast them IN the metal (exciting and organic) or, more advanced students can learn to set them in a fabrication class.\n\nClasses fill fast so please book now to reserve your place!"
  },
  {
    "id": "Fire Grill-Colombo Martinborough, 107 Todds Road, Martinborough-Event Finder",
    "name": "Fire Grill",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096965-896019-35.png?v=2",
    "venue": "Colombo Martinborough, 107 Todds Road, Martinborough",
    "coordinates": {
      "lat": -41.2236196,
      "long": 175.4743269
    },
    "dates": [
      "2025-08-15-17:30"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.eventfinda.co.nz/2025/fire-grill2/martinborough",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "Dale Keith of Rose & Smith is firing up the grill at Colombo Martinborough on Friday, 15th August from 5.30 pm, serving up his legendary smashed burgers for one flavour-packed winter evening.\n\nThis family-friendly event is all about bold flavours, relaxed vibes, and great local hospitality. Sip on mulled wine, enjoy a local beer, or choose from our full range of Colombo wines and non-alcoholic options while you wait.\nBring the whānau, grab a burger, and settle in for a tasty night out. "
  },
  {
    "id": "Best of the Bee Gees Saturday Night Fever Show-The Opera House, 111 - 113 Manners Street, Wellington-Event Finder",
    "name": "Best of the Bee Gees Saturday Night Fever Show",
    "imageUrl": "",
    "venue": "The Opera House, 111 - 113 Manners Street, Wellington",
    "coordinates": {
      "lat": -41.2913572,
      "long": 174.7779946
    },
    "dates": [
      "2025-08-16-20:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/best-of-the-bee-gees-saturday-night-fever-show/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "You should be dancing when the disco era comes alive on stage in Wellington.\n\nYou’re invited to put on your boogie shoes and salute the Bee Gees album ‘Saturday Night Fever’. Released in 1977, the album defined a disco generation. Tribute act Best of the Bee Gees Saturday Night Fever and the George Ellis Orchestra come to The Opera House in August 2025. They’ll play chart-busters from that album plus songs from other bands from the 70s like K.C. & The Sunshine Band, and The Trammps. Special guests Debora McLane (niece of the Bee Gees) and Roslyn Loxton join the tribute band on stage.\n\nIn a two-act orchestrated performance, you’ll hear some of the best songs written by the Gibb brothers. Groove along to tracks like You Should Be Dancing, Stayin’ Alive, Jive Talkin’, Disco Inferno, More Than A Woman, Warm Ride, and so much more.\n\nThe album ‘Saturday Night Fever’ was the biggest-selling sound recording between 1977 and 1980. It was awarded Album of the Year at the 1979 Grammys and stayed in the Top 200 for 29 consecutive months. It made Barry Gibb the first solo songwriter in history to have three consecutive number ones, and four songs in the top ten simultaneously."
  },
  {
    "id": "Three Days In February-Roxy Cinema, 5 Park Road, Miramar, Wellington-Event Finder",
    "name": "Three Days In February",
    "imageUrl": "",
    "venue": "Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158392,
      "long": 174.8162766
    },
    "dates": [
      "2025-07-19-19:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.eventfinda.co.nz/2025/three-days-in-february/wellington",
    "source": "Event Finder",
    "eventType": "Film & Media",
    "description": "A stunning audiovisual experience of Splore.\nThree Days in February was the winner of Best Sound (New Zealand) at Doc Edge Awards 2025.\n\nFilmed over seven years during a three-day music and art festival, Splore, the film is a cinematic celebration of human connections and our need for play. For decades this festival has created a safe space for playfulness on land that is blessed by the local iwi.\n\nDirected by Doc Edge alumna, Stevenson (Moko – The Art of Living) explores deep human emotion with cinematic frames and a multi-genre score, sinking into moments of humour, joy, family, celebration, love and adventure, where even the mundane is insightful.\n\nJoin us in the Grand Lobby upstairs. DJ Takas will be spinning some tunes before the screening with some fun surprises in place! Followed by a Q&A. Prizes for best dressed so dust off your glad-rages.\nBring your Splore cup to access some special drinks promotions."
  },
  {
    "id": "Menstrual Mates-Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington-Event Finder",
    "name": "Menstrual Mates",
    "imageUrl": "",
    "venue": "Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington",
    "coordinates": {
      "lat": -41.2942803,
      "long": 174.7817841
    },
    "dates": [
      "2025-08-02-10:00"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.eventfinda.co.nz/2025/menstrual-mates5/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "We’ve partnered with Wellington Timebank in the fight against period poverty.\n\nPlease drop in for a morning of making reusable period products, kōrero and empowerment. There is opportunity for everyone to get involved and experience is not necessary.\n\nTea, coffee and baking provided."
  },
  {
    "id": "Cumbia Blazera-Abandoned Taproom Petone, 38 Fitzherbert St, Petone, Lower Hutt-Event Finder",
    "name": "Cumbia Blazera",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2084044-889176-35.jpg?v=2",
    "venue": "Abandoned Taproom Petone, 38 Fitzherbert St, Petone, Lower Hutt",
    "coordinates": {
      "lat": -41.2227099,
      "long": 174.8758616
    },
    "dates": [
      "2025-07-19-20:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.eventfinda.co.nz/2025/cumbia-blazera/lower-hutt",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Cumbia Blazera are bringing our football-infused cumbia dance music to Abandoned for your dancing pleasure! A beautiful blend of originals, cumbia covers, and kiwi popular cumbia-fied covers!\nIf you've seen us at Newtown Festival, Cuba Dupa, or Rogue & Vagabond gigs you'll know the deal.\nBring your friends! Pre-sales $20 at humanitix, or $25 on the door"
  },
  {
    "id": "Quiz Night-Eva Beva, 31-35 Dixon Street, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064362-880990-35.png?v=6",
    "venue": "Eva Beva, 31-35 Dixon Street, Wellington",
    "coordinates": {
      "lat": -41.2902313,
      "long": 174.7718608
    },
    "dates": [
      "2025-07-23-19:00",
      "2025-07-30-19:00",
      "2025-08-06-19:00",
      "2025-08-13-19:00",
      "2025-08-20-19:00",
      "2025-08-27-19:00",
      "2025-09-03-19:00",
      "2025-09-10-19:00",
      "2025-09-17-19:00",
      "2025-09-24-19:00",
      "2025-10-01-19:00",
      "2025-10-08-19:00",
      "2025-10-15-19:00",
      "2025-10-22-19:00",
      "2025-10-29-19:00",
      "2025-11-05-19:00",
      "2025-11-12-19:00",
      "2025-11-19-19:00",
      "2025-11-26-19:00",
      "2025-12-03-19:00",
      "2025-12-10-19:00",
      "2025-12-17-19:00"
    ],
    "displayDate": "Wed 23 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night9/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Every Wednesday is trivia night at one of Wellington's most popular quizzes - Eva Beva!\n\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew! So if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\n\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
  },
  {
    "id": "Trade Wars Zine Market-Victoria University School of Design, 139 Vivian St, Te Aro, Wellington-Event Finder",
    "name": "Trade Wars Zine Market",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102126-898308-35.png",
    "venue": "Victoria University School of Design, 139 Vivian St, Te Aro, Wellington",
    "coordinates": {
      "lat": -41.2953027,
      "long": 174.7756621
    },
    "dates": [
      "2025-07-26-12:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/trade-wars-zine-market/wellington",
    "source": "Event Finder",
    "eventType": "Markets & Fairs",
    "description": "Our Winter Zine Market this year has a special theme! The theme is: Trade Wars.\n\nHere at Wellington Zinefest we dislike Capitalism, so we are dreaming about a sci-fi future where people trade things they love.\n\nEveryone tabling at the Trade Wars Market will have at least one object on their table which is open for trades.\nSo if you make zines, you can come and trade your zine for other zines!\nIf you don’t make zines, you can bring other objects to trade.\n\nAnd look, you can still use money. We live in a society etc etc, zines will still be for sale for cash dollars.\nBut this market prioritises trades / swaps / barter / banter.\n\nExamples of things you could bring to TRADE for ZINES:\nother zines, seasonal produce, trading cards and ephemera, really good jokes, prints.\n\nAccessibility hour will run from 11 am - 12 pm."
  },
  {
    "id": "Moon Open Decks - hosted by Gandoof-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "Moon Open Decks - hosted by Gandoof",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102623-898578-35.jpg",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-14-18:00"
    ],
    "displayDate": "Thu 14 Aug",
    "url": "https://www.eventfinda.co.nz/2025/moon-open-decks-hosted-by-gandoof2/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Moon Open Decks! DJs & producers of all experience levels are welcome to come & share their tunes"
  },
  {
    "id": "George Young - Free Live Music Wednesdays-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "George Young - Free Live Music Wednesdays",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102624-898579-34.jpg?v=2",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-30-19:00"
    ],
    "displayDate": "Wed 30 Jul",
    "url": "https://www.eventfinda.co.nz/2025/george-young-free-live-music-wednesdays/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Every Wednesday come down to Moon for FREE Live Music from 7pm & $15 Pizzas from 5.30-9\n\nGeorge Young has been called “one of the city’s best kept secrets”. With soulful arrangements and originals that spin webs between genres and themes. He is a passionate lyric writer and seasoned songsmith. If you have a blue bone and a sweet heart, he’s got something for you.\n\nCatch him playing a chill solo set this Wednesday at Moon while you sip a craft and have a nibble"
  },
  {
    "id": "Introduction to Watercolour-Fareham Creative Space, 80 Underhill Rd, Featherston-Event Finder",
    "name": "Introduction to Watercolour",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102997-898740-35.jpg?v=2",
    "venue": "Fareham Creative Space, 80 Underhill Rd, Featherston",
    "coordinates": {
      "lat": -41.1073902,
      "long": 175.3314082
    },
    "dates": [
      "2025-08-09-10:00"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.eventfinda.co.nz/2025/introduction-to-watercolour/featherston",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Come learn the art of watercolour painting with Marianne Linton. This one-day introductory session is aimed at beginners and returning painters.\n\nMaterials supplied, bring a notebook, pen, and your lunch."
  },
  {
    "id": "French - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "French - Introductory 1",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095662-895429-35.jpg?v=14",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-24-17:30"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.eventfinda.co.nz/2025/french-introductory-12/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "For beginners who have no prior knowledge of French.\n\nBy the end of the eight-week course, you'll be able to:\n\n- Greet people and introduce yourself and others at a basic level\n- Use expressions for basic everyday communication\n- Ask and answer questions about people’s names, nationalities, family, work situation, likes and dislikes (both formal and informal)\n- Describe and use the rules of pronunciation (including the alphabet)\n- Understand and use some basic French grammar: the verbs avoir and être, the present tense of a few verbs in -er, articles (definite and indefinite), singular/plural and masculine/feminine of nouns and nationality adjectives, possessive adjectives\n- Order, offer, accept and refuse food and drink in a café at a basic level\n- Become more familiar with the cultural aspects related to these topics\n\nDuration 8 weeks, Thu 5:30 PM – 7:30 PM"
  },
  {
    "id": "Quiz Night-Amador, 80 Willis Street, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2082059-889290-35.png",
    "venue": "Amador, 80 Willis Street, Wellington",
    "coordinates": {
      "lat": -41.28821,
      "long": 174.774582
    },
    "dates": [
      "2025-07-22-18:30",
      "2025-07-29-18:30",
      "2025-08-05-18:30",
      "2025-08-12-18:30",
      "2025-08-19-18:30",
      "2025-08-26-18:30",
      "2025-09-02-18:30",
      "2025-09-09-18:30",
      "2025-09-16-18:30",
      "2025-09-23-18:30",
      "2025-09-30-18:30",
      "2025-10-07-18:30",
      "2025-10-14-18:30",
      "2025-10-21-18:30",
      "2025-10-28-18:30",
      "2025-11-04-18:30",
      "2025-11-11-18:30",
      "2025-11-18-18:30",
      "2025-11-25-18:30",
      "2025-12-02-18:30",
      "2025-12-09-18:30",
      "2025-12-16-18:30",
      "2026-01-06-18:30",
      "2026-01-13-18:30",
      "2026-01-20-18:30",
      "2026-01-27-18:30",
      "2026-02-03-18:30"
    ],
    "displayDate": "Tue 22 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night22/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Come join us for the newest weekly ritual on a Tuesday night at one of the coolest little venues on Willis St!\n\nYou and your crew will negotiate five rounds of amazing trivia with your Gee Quiz host Craig. Your team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\n\nAdd to the mix exquisite beers, delicious food and an incredible vibe, it's the place to be on a Tuesday night with plenty of time for laughter, banter and merrymaking!\n\nThe quiz kicks off at 6.30pm and runs for roughly 2 hours. So, grab your buddies and come on down and join us for one of Wellington's best quiz nights – Amador style!"
  },
  {
    "id": "Retro Pack - The Fabulous 50s Show!-Kapiti Playhouse, 7 Ruahine St, Paraparaumu-Event Finder",
    "name": "Retro Pack - The Fabulous 50s Show!",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102403-898463-35.png",
    "venue": "Kapiti Playhouse, 7 Ruahine St, Paraparaumu",
    "coordinates": {
      "lat": -40.9189542,
      "long": 175.0111549
    },
    "dates": [
      "2025-08-09-19:30"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.eventfinda.co.nz/2025/retro-pack-the-fabulous-50s-show/paraparaumu",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Elvis! Bobby Darin! Chuck Berry! the Everly Brothers! Peggy Lee & More - Some choice ballads and plenty of rock'n'roll...Come help us evoke the sounds & styles of the 50s with hits like Why Do Fools Fall in Love, Love Potion Number Nine, Blueberry Hill, This Old House, Heartbreak Hotel & many more!\n\nFeatures April Phillips (vocals) , James Tait-Jamieson (sax), Andrew London (guitar & piano), Kirsten London (bass) and Mike Franklin-Browne (drums). We're gonna rock around the clock!"
  },
  {
    "id": "The Joy of Improvisation-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "The Joy of Improvisation",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095680-895440-35.jpg?v=18",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-24-19:30"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.eventfinda.co.nz/2025/the-joy-of-improvisation3/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Discover your creative potential and enjoy improvising scenes and stories in a safe, positive group environment with the Wellington Improvisation Troupe [WIT].\n\nDescription\nImprov is theatre without a script and a fun way to build your skills in many areas, including team work, public speaking, storytelling and on-your-feet creative thinking.\n\nThis is the perfect place for absolute beginners to get acquainted with the joy and art of improvisation, inspired by the generous creative philosophy of Keith Johnstone. It's also a great place to get back into improv if you've been away from it for a while.\n\nWIT has been teaching this course in association with the CEC for almost 20 years now. It uses fun games and structured exercises to teach the foundation skills of improv. These are a prerequisite for further courses and membership of WIT (www.wit.org.nz), as well as useful in themselves.\n\nIf you have questions about the course, please contact WIT directly on info@wit.org.nz.\n\nBy the end of the course, you'll have:\n\n- Explored basic principles of improvisation\n- Enjoyed interacting in a friendly, positive and supportive environment\n- Developed more confidence, presentation and communication skills\n- Experienced joyful moments of improvisation\n\nThe course will end with a directed demonstration of class exercises for invited friends and family.\n\n[This is a physical activity that involves an element of risk. While all possible measures are taken to prevent accidents or injury, please note that participation is at your own risk].\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\n8 weeks, Thu 7:30 PM – 9:30 PM\nWellington High School\nPresented by WIT (Wellington Improv Troupe)\n$185.incl. GST"
  },
  {
    "id": "Chinese Mandarin - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Chinese Mandarin - Introductory 1",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095538-895354-34.jpg?v=11",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-23-17:30"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/chinese-mandarin-introductory-12/wellington",
    "source": "Event Finder",
    "eventType": "Education & Learning",
    "description": "For beginners who have no prior knowledge of Chinese Mandarin. (NZ Citizens and residents pay $99 with ID, all others pay $199).\n\nBy the end of the course, you'll be able to:\n- Recognise and pronounce some basic Mandarin sounds\n- Identify Yes/no questions\n- Identify content questions - Introduce yourself briefly\n- Use some activity verbs\n- State simple date and time\n\nPlease note the focus of the course is on oral communication, not writing Chinese script.\n\n8 weeks, Wed 5:30 PM- 7:30 PM\nPresented by Mei-Fen Sundgren."
  },
  {
    "id": "The Mixtape Vol. 6-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
    "name": "The Mixtape Vol. 6",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102701-898629-34.jpg?v=2",
    "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
    "coordinates": {
      "lat": -41.29336,
      "long": 174.7745002
    },
    "dates": [
      "2025-07-26-21:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/the-mixtape-vol-6/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "LJ Crichton is back with The Mixtape: Vol 6. A night of RnB, Soul and Funk to heat up the city a bit.\n\nJoined by some heavy musicians it’s gonna be a great night at the Rogue and Vagabond.\n\nFree entry"
  },
  {
    "id": "Floral Watercolour-Ventana Creative Collective, 8 Kitchener St, Martinborough-Event Finder",
    "name": "Floral Watercolour",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096015-895589-35.png",
    "venue": "Ventana Creative Collective, 8 Kitchener St, Martinborough",
    "coordinates": {
      "lat": -41.2174489,
      "long": 175.4587044
    },
    "dates": [
      "2025-08-13-19:30"
    ],
    "displayDate": "Wed 13 Aug",
    "url": "https://www.eventfinda.co.nz/2025/floral-watercolour/martinborough",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "This one’s for our lovely locals- who support Ventana year-round and keep the creative spirit alive in our community.\n\nJoin us for a relaxed evening of watercolour painting, where we’ll explore loose, expressive floral designs. This workshop is all about play, flow, and colour- no perfection required. Whether you’re a beginner or just looking for a creative reset, you’ll leave with a page full of beautiful blooms and a refreshed sense of joy."
  },
  {
    "id": "Retirement Reinvented-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Retirement Reinvented",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2081754-889242-35.jpg?v=9",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-02-09:30"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.eventfinda.co.nz/2025/retirement-reinvented3/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Whether you’re already retired, or planning ahead, this practical workshop will help you to reflect, re-envision and re-vitalise your life and develop a plan for your future, on your own terms. (NZ citizen and residents free with ID, all others pay $109).\n\nIn your middle years, working, retired or somewhere in between? What’s next? Life is about much more than work or leisure, but most of us have given little thought to what “retirement” might mean.\n\nIt’s difficult to speculate what may happen in the future – but we can be proactive and take control.\nThis course offers insights into how to make the most of our time once we’re less focused on career and/or childrearing. It covers many of the issues people face when considering a move from current employment to a different lifestyle that includes more time to do the things we’ve always promised ourselves we’d do – “when we retire”.\n\nAfter the workshop, you’ll be able to identify a number of common issues and potential ways to manage them when considering and planning your “rejuvenation”, rather than a retirement. We won’t cover financial planning, but will focus on some of the personal growth opportunities for living and making a conscious contribution to your community.\n\nBy the end of the day, you’ll have:\n- Developed your own perspective on ageing and retirement in the 21st Century and identified what’s important to you\n- Completed a personal life audit exercise and considered your strengths\n- Explored possibilities in the major aspects of your life and identified potential challenges and strategies for overcoming them\n- Developed a blueprint to maximise the best years of your life and developed a “future proofing” downsizing plan\n- Considered options to include a sense of purpose and explored and implemented choices that provide you with that sense of purpose\nBring a pen and paper.\n\n1 day, Sat 9:30 AM – 4:00 PM\nWellington High School\nPresented by Angela Robertson"
  },
  {
    "id": "On a Good Day - EP Launch - Hihi & The Stitchbirds-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "On a Good Day - EP Launch - Hihi & The Stitchbirds",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102258-898381-35.png",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-16-19:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/on-good-day-ep-launch-hihi-the-stitchbirds/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Come celebrate Hihi & The Stitchbirds' first EP - On a Good Day - an exploration of love, and loss, and the pieces in between.\n\n7:00pm - Doors\n\n7:30pm - The Bidibids\n\n8:30pm - Hihi & The Stitchbirds\n\nAfter a whirlwind 18 months as a five-piece folk band, Hihi & The Stitchbirds are delighted to release their debut EP with five original songs that will make you feel soothed and seen. Written by band members Tess Luff, Elena Saunders and Ellie Stewart, this group of talented musicians invite you into contemplative corners of their brains with a set of gentle and jovial numbers that will entertain and delight.\n\nThey will be joined on stage by their friends the Bidibids.\n\n\nAbout Hihi & The Stitchbirds:\n\nHihi & The Stitchbirds are an exciting five-piece musical experiment, based in Te Whanganui-a-Tara. Pairing rich vocal harmonies with vibrant original music inspired by the folk and Americana playbooks, this band brings something for everyone.\n\nHihi & The Stitchbirds are:\n\n\nElena Saunders - vocals and vibes\n\nChris Goldsbury - guitar, clarinet and vocals\n\nTess Luff - guitar, banjo uke and vocals\n\nMatt Hutton - bass uke and vocals\n\nEllie Stewart - fiddle and vocals\n\n\nAbout the Bidibids:\n\nWith lush harmonies, intricate arrangements, and beguiling melodies, the Bidibids explore what it means to play folk music in New Zealand. The Bidibids are Sarah August on banjo and guitar, Simon Carryer on cello-banjo, and Brendan Schenk on mandolin and guitar. The trio came together at the 2020 Wellington Folk Festival, where they were each supposed to be playing in different groups. Since then, the Wellington-based band have become regulars at some of the region’s best venues for folk music, including the Mussel Inn, Moon, and the Wellington Bluegrass Society.\n\nDriven by Sarah’s honest, intimate songwriting and Brendan’s blazing musicianship, the Bidibids balance soulful ballads that will tug your heart-strings with upbeat numbers which will get your toes tapping. Influenced by American bluegrass and folk bands like Watchhouse and Nickel Creek, they’re also inspired by local acts like the Eastern and Marlon Williams who are forging an authentic New Zealand folk tradition. You can listen to the Bidibids' debut EP here: https://open.spotify.com/album/6Q8HW5g0FzDl3VYz44OZU5?si=4gIRmfaRSiOUlgxJnVUbuw."
  },
  {
    "id": "Corrella Skeletons Winter Tour - Wellington-San Fran, 171 Cuba St, Wellington-Event Finder",
    "name": "Corrella Skeletons Winter Tour - Wellington",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095403-892382-35.jpg",
    "venue": "San Fran, 171 Cuba St, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-08-15-20:00"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.eventfinda.co.nz/2025/corrella-skeletons-winter-tour-wellington/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Corrella Skeletons Winter Tour - Wellington\n\nFriday, August 15 @ San Fran- Wellington\nWith special guests Valley Kids\nLoop, The Edge and Mai FM are stoked to present Corrella and their upcoming Skeletons Winter Tour!\n\nAfter a massive summer of festivals and touring alongside L.A.B across Aotearoa and Australia, Corrella are hitting the road this August for their biggest headline tour yet — bringing their new album Skeletons to the stage for the very first time.\n\nSkeletons marks the next chapter for the band as they continue to cement their place in the New Zealand and Australian music scenes. The album follows their breakout debut Road From 26, which featured the sleeper hit Blue Eyed Māori—a track that now holds the record for the most weeks ever spent at Number One on the NZ Singles Chart.\n\nSince their debut, Corrella have sold out shows nationwide, become festival favourites, and picked up multiple Aotearoa Music Awards and Waiata Māori Music Awards.\nThis run of shows will be their biggest headline tour to date. See Corrella live as they hit the road in August for their Skeletons Winter Tour taking on Auckland's Tuning Fork, Hamilton’s Factory, Wellington’s San Fran, Christchurch’s The Church & Dunedin’s Erricks, presented by Loop. Support for each show to be announced.\n\nPresented by Loop, Mai, The Edge, with thanks to Mānuka Phuel.\n\nTickets are on sale 10am Wednesday 28 March from Loop.co.nz"
  },
  {
    "id": "Hey Mates: Coffee, Walk & Talk-Wellington Waterfront, Wellington-Event Finder",
    "name": "Hey Mates: Coffee, Walk & Talk",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2097571-896161-35.jpg?v=2",
    "venue": "Wellington Waterfront, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-16-10:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/hey-mates-coffee-walk-talk/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Join us for a relaxed morning of good coffee, light walks, and great conversations! We try new cafes each month.\n\nRSVP here: https://heymates.com/wellington/brunch\n\nEntry: $6.25 - reserves your spot and supports the platform.\nThe meeting spot (exact location) and host information is shared with confirmed attendees via email.\n\nJoin this community event hosted by Dhruv!\n\nHey everyone! Let’s start the day with a warm cup of coffee, a refreshing walk, and some good chats.\n\nThis is a casual and welcoming space to meet new people, enjoy the outdoors, and connect over shared stories. Whether you’re up for deep conversations or just some light-hearted company, I’d love to see you there!\n\nRSVP is a must through our website.\n\nNote: If you register and are unable to come without 24hr of notice. The fee would be non-refundable so please be mindful.\n\nPeople in your group are there to socialise, connect and have fun. Who knows? You might just discover your new BFF!\n\nSee you there!"
  },
  {
    "id": "Thyme Well Spent: a Herb-infused Afternoon-Longbush Cottage, 1023 Longbush Road, Carterton-Event Finder",
    "name": "Thyme Well Spent: a Herb-infused Afternoon",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096021-895594-35.png",
    "venue": "Longbush Cottage, 1023 Longbush Road, Carterton",
    "coordinates": {
      "lat": -41.1686705,
      "long": 175.5945696
    },
    "dates": [
      "2025-08-16-14:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/thyme-well-spent-herb-infused-afternoon/carterton",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Nestle into the warmth of the Longbush Cottage glasshouse for a mindful winter afternoon of watercolour nature journaling. Surrounded by the subtle beauty of the winter garden, you’ll be guided to sketch and paint seasonal herbs like rosemary, thyme, and sage, learning techniques to capture detail and texture in your journal. This peaceful session is perfect for slowing down and reconnecting with nature through art. Sip on bubbles and savour warm rosemary focaccia with herb-infused oil as you work. No experience required — just bring a curious eye and a love of seasonal beauty.\n\nDate & Time: Saturday 16th August - 2-4pm\n\nLocation: 1023 Longbush Road, Longbush 5884\n(20 min scenic drive from Martinborough)\n\nPrice: $119"
  },
  {
    "id": "Tīnui Emergency Response Practice-Tinui War Memorial Hall, 3 Black Hill Road, , Masterton-Event Finder",
    "name": "Tīnui Emergency Response Practice",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102713-898633-35.png",
    "venue": "Tinui War Memorial Hall, 3 Black Hill Road, , Masterton",
    "coordinates": null,
    "dates": [
      "2025-07-29-19:00"
    ],
    "displayDate": "Tue 29 Jul",
    "url": "https://www.eventfinda.co.nz/2025/tinui-emergency-response-practice/masterton",
    "source": "Event Finder",
    "eventType": "Education & Learning",
    "description": "A Community Emergency Hub is a place for the community to gather and coordinate efforts to help each other during and after a disaster.\n\nCome along and find out more about the Tīnui Community Emergency Hub and the types of help that may be needed after an emergency.\n\nHave fun meeting together and practicing various roles with an interactive earthquake scenario.\n\nOpen to all ages and abilities, no experience needed!\n\nRefreshments provided.\n\nFor more information, please email info@wremo.nz\n\nWe aim to make our community events inclusive to all people. If you are attending the event and have specific accessibility requirements, you can send us an email at info@wremo.nz with the event name and we will get in touch to see how we can meet your needs as best we can."
  },
  {
    "id": "Book Launch - liz breslin: 'Show You’re Working Out'-Book Haven, 160 Riddiford St, Wellington-Event Finder",
    "name": "Book Launch - liz breslin: 'Show You’re Working Out'",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2101985-898251-35.png",
    "venue": "Book Haven, 160 Riddiford St, Wellington",
    "coordinates": {
      "lat": -41.3134412,
      "long": 174.7795271
    },
    "dates": [
      "2025-08-06-18:00"
    ],
    "displayDate": "Wed 06 Aug",
    "url": "https://www.eventfinda.co.nz/2025/book-launch-liz-breslin-show-yourre-working-out/wellington",
    "source": "Event Finder",
    "eventType": "Education & Learning",
    "description": "We're pleased to be hosting on 6 August at 6pm in the shop, the Te Whanganui-a-Tara launch of liz breslin's third poem collection: 'show you’re working out.' It has poems about scissors, Pilates, reality tv, colonisation, composting the patriarchy, Sharon from the Speights ads, women on bicycles, sharks, viral dresses and more.\n\nliz breslin is a queer, tangata Tiriti writer, editor, performer and facilitator of Polish, Irish and English descent. Matariki Bennett will also be doing a couple of poems at the launch, and H-J Kilkelly will introduce the book.\n\nAnd the absolutely awesome cover is by Jess Hinerangi"
  },
  {
    "id": "Qi Gong-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Qi Gong",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095655-895422-34.jpg?v=3",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-23-19:30"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/qi-gong2/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "Qi gong, pronounced “chi gong,” was developed in China thousands of years ago as part of traditional Chinese medicine. It involves using exercises to optimize energy within the body, mind, and spirit, with the goal of improving and maintaining health and well-being.\n\nQigong has both psychological and physical components and involves the regulation of the mind, breath, and body’s movement and posture.\n\nIn most forms of qigong:\n\nBreath is slow, long, and deep. Breath patterns may switch from abdominal breathing to breathing combined with speech sounds.\nMovements are typically gentle and smooth, aimed for relaxation.\nMind regulation includes focusing one’s attention and visualization.\nDynamic (active) qigong techniques primarily focus on body movements, especially movements of the whole body or arms and legs. Meditative (passive) qigong techniques can be practiced in any posture that can be maintained over time and involve breath and mind exercises, with almost no body movement.\nWear loose, comfortable clothing and bring a bottle of water.\n\n[This is a physical activity that involves an element of risk. While all possible measures are taken to prevent accidents or injury, please note that participation is at your own risk].\n\nDuration 6 weeks"
  },
  {
    "id": "The Magic of Her Body: Readings of Katherine Mansfield's Queer Writing-Katherine Mansfield House & Garden, 25 Tinakori Rd, Thorndon, Wellington-Event Finder",
    "name": "The Magic of Her Body: Readings of Katherine Mansfield's Queer Writing",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2098109-896412-35.png",
    "venue": "Katherine Mansfield House & Garden, 25 Tinakori Rd, Thorndon, Wellington",
    "coordinates": {
      "lat": -41.2701568,
      "long": 174.7798246
    },
    "dates": [
      "2025-08-13-18:00",
      "2025-08-14-18:00",
      "2025-08-15-18:00",
      "2025-08-15-20:00",
      "2025-08-16-18:00",
      "2025-08-16-20:00"
    ],
    "displayDate": "Wed 13 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/the-magic-of-her-body-readings-of-katherine-mansfields-queer-writing/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Back after a sold-out season during the 2025 Wellington Pride Festival!\n\nHeritage New Zealand Pouhere Taonga, Katherine Mansfield House & Garden, and Vixen Temple present The Magic of Her Body: Readings of Katherine Mansfield’s Queer Writing, an immersive theatrical experience in one of Aotearoa’s leading historic house museums.\n\nJoin performance artist Vixen Temple and historian Kerryn Pollock of Heritage New Zealand Pouhere Taonga on a journey through Mansfield’s sensual diary entries and sapphic-coded short stories, moving through the rooms in the home of her birth, Katherine Mansfield House & Garden in Thorndon. Live musical accompaniment will be performed by Ms Weeds.\n\nThe Wednesday performance will be followed by a Q&A session.\n\nKatherine Mansfield (1888-1923) is one of Aotearoa’s most internationally acclaimed writers. Born in Wellington, she lived permanently in England and Europe from 1908 until her untimely death from tuberculosis in 1923. She became a central figure in literary modernism alongside contemporaries such as Virginia Woolf and DH Lawrence. In the words of biographer Gill Boddy, ‘She sought to capture the transitory vividness of life and to bring ordinary moments and people into focus so that their full significance could be understood’. Her passionate diary entries, beginning when she was a teenager, reveal a sapphic sensibility and identity that carried over into her fiction. Mansfield is a messy, relatable teen, a literary diva, and queer icon whose voice speaks to us beyond time.\n\n\"The evening’s structure flows beautifully: a mix of Mansfield’s writings, historical insights, and Temple’s magnetic performance. She holds the audience in the palm of her hand—drawing laughter, gasps and breathless silence at all the right moments.\" - Theatreview\n\n\"Thank you for weaving together history, performance, place, music and queer pride into such a special, moving, beautiful experience. There’s nothing like it, it was unforgettable.\" - Audience feedback\n\nPlease note: Katherine Mansfield House & Garden is a modestly-sized historic house. This event will take place throughout the house and most audience members will need to stand for the duration of the show. Unfortunately, the house is not wheelchair accessible and we do not have an accessible bathroom."
  },
  {
    "id": "Ghost Trio (piano trio)-St Andrews on the Terrace, 30 The Terrace, Wellington-Event Finder",
    "name": "Ghost Trio (piano trio)",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2008121-856705-35.jpg?v=2",
    "venue": "St Andrews on the Terrace, 30 The Terrace, Wellington",
    "coordinates": {
      "lat": -41.2799366,
      "long": 174.7749956
    },
    "dates": [
      "2025-08-17-15:00"
    ],
    "displayDate": "Sun 17 Aug",
    "url": "https://www.eventfinda.co.nz/2025/ghost-trio-piano-trio/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Monique Lapins (violin), Ken Ichinose (cello) and Gabriela Glapska (piano).\n\nThe programme is titled “Between Tides” based upon the concept of a journey through time and cultural landscapes, showcasing the evolution of chamber music from the late 18th century (Beethoven) to the 20th century (Shostakovich), and finally to the contemporary era (Takemitsu, Downie). Each piece offers a distinct musical experience, reflecting the stylistic diversity and cultural richness of classical music through the lens of the piano trio. There is a world premiere of a work by New Zealand’s own Glen Downie, written especially for the Ghost Trio.\n\nLudwig van Beethoven, Piano Trio in D major Op 70 No. 1 “Ghost”\nTōru Takemitsu, Between Tides SJ1091\nGlen Downie, Sonata da chiesa (world premiere) (Aotearoa, 1991)\nDmitri Shostakovich, Piano Trio No. 2 in E minor Op 67"
  },
  {
    "id": "Monthly Jazz Night: Lisa Tomlins-The Thistle Inn, 3 Mulgrave St, Thorndon, Wellington-Event Finder",
    "name": "Monthly Jazz Night: Lisa Tomlins",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095848-895524-35.png",
    "venue": "The Thistle Inn, 3 Mulgrave St, Thorndon, Wellington",
    "coordinates": {
      "lat": -41.2776965,
      "long": 174.7796332
    },
    "dates": [
      "2025-08-15-19:00"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.eventfinda.co.nz/2025/monthly-jazz-night-lisa-tomlins3/wellington",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "Experience an unforgettable Friday night at The Thistle Inn with our Jazz Special! We're thrilled to have the remarkable Lisa Tomlins back on stage, ready to captivate you with her mesmerising talent and stunning vocals.\n\nPrepare for a night filled with soulful melodies and irresistible rhythms, as Lisa's beautiful sound fills the room and sets the perfect ambiance for an evening to remember.\n\nMark your calendars for a jazz-filled night you won't want to miss!"
  },
  {
    "id": "Immersive Yoga: We Are Nature-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
    "name": "Immersive Yoga: We Are Nature",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103030-898754-35.jpg",
    "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
    "coordinates": null,
    "dates": [
      "2025-08-07-18:15"
    ],
    "displayDate": "Thu 07 Aug",
    "url": "https://www.eventfinda.co.nz/2025/immersive-yoga-we-are-nature/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "A one-of-a-kind yoga experience designed to awaken the senses, stir reflection, and bring you into deeper connection — followed by a nourishing plant-based dinner and dessert.\n\nTake this moment to become grounded in your true nature through embodied movement. This practice is your invitation to appreciate and develop a deeper connection with the Earth — to slow down, to notice the changing landscapes and seasons around you, and to find them within you. It’s a chance to remember that we are part of this world, shaped by the same rhythms, held by the same ground.\n\nWe speak of “getting into nature” as something we have to do — yet Earth-based traditions have always seen the plant and all beings as interconnected and sacred, humans as one with the Earth itself.\n\nThis is more than a yoga class — it’s an immersive experience designed to bring you back into that sense of belonging.\n\nAs you move through gentle hatha yoga, you’ll be surrounded by breathtaking visuals of our earthly home, designed and projected by Andy from Hype Entertainment. The space will come alive with images of nature from sunset to sunrise — each scene offering a distinct atmosphere to reflect and move with. A curated soundscape and subtle aromatherapy will support your journey, drawing you deeper into the moment.\n\nLet us weave the scared back in, to weave nature back into the centre of our everyday lives. Let us find our way back through nature, to our true nature and selves.\n\nAfter your practice, stay to enjoy a wholesome plant-based dinner and dessert, included in your ticket.\n\nMeet Nicola, your teacher\nWith over 20 years of teaching experience and a deep connection to yoga philosophy, Nicola’s gentle guidance will lead you on a journey of self-discovery. Her classes are a blend of warmth and wisdom, helping you explore both your body and your spirit. As a teacher, she embraces the essence of yoga in every aspect of her life, creating a space where you can experience not only physical movement but a true connection to your inner self."
  },
  {
    "id": "Quiz Night-Heyday Beer Co, 264a Cuba St, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064913-881282-35.jpg?v=7",
    "venue": "Heyday Beer Co, 264a Cuba St, Wellington",
    "coordinates": {
      "lat": -41.2966834,
      "long": 174.7734708
    },
    "dates": [
      "2025-07-23-18:30",
      "2025-07-30-18:30",
      "2025-08-06-18:30",
      "2025-08-13-18:30",
      "2025-08-20-18:30",
      "2025-08-27-18:30",
      "2025-09-03-18:30",
      "2025-09-10-18:30",
      "2025-09-17-18:30",
      "2025-09-24-18:30",
      "2025-10-01-18:30",
      "2025-10-08-18:30",
      "2025-10-15-18:30",
      "2025-10-22-18:30",
      "2025-10-29-18:30",
      "2025-11-05-18:30",
      "2025-11-12-18:30",
      "2025-11-19-18:30",
      "2025-11-26-18:30",
      "2025-12-03-18:30",
      "2025-12-10-18:30",
      "2025-12-17-18:30"
    ],
    "displayDate": "Wed 23 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night4/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Quiz night is back at Heyday Beer Co. with Welly's own Savage behind the mic!\n\nWith five rounds of trivia, you and your squad will negotiate engaging, relevant and left-field questions that you have a fighting chance to get correct, regardless of your background or how many Master's degrees you have.\n\nIn addition to the epic trivia, we've got get-up-out-of-your-seat games The Line Up and Last Person Standing to mix things up.\nIt's the place to be every Wednesday night! Pet friendly so your four-legged friends are welcome!\n\nGreat food and drink to be consumed, fun to be had and prizes to be won.\n\nA great Heyday initiative is a monthly fundraiser for a chosen charity, so we ask all quizzers for a gold coin donation each week."
  },
  {
    "id": "From Berkahn to Beethoven-Te Raukura ki Kapiti, Coastlands Theatre, 34a Raumati Rd, Paraparaumu-Event Finder",
    "name": "From Berkahn to Beethoven",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103097-898800-35.jpg",
    "venue": "Te Raukura ki Kapiti, Coastlands Theatre, 34a Raumati Rd, Paraparaumu",
    "coordinates": null,
    "dates": [
      "2025-08-16-19:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/from-berkahn-to-beethoven/paraparaumu",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Kāpiti Concert Orchestra's second term concert “BERKAHN TO BEETHOVEN” welcomes well-known pianist Diedre Irons playing Beethoven Piano Concerto No.4.\n\nShe is joined by one of the orchestra’s regular conductors, Michael Vinten.\n\nFor accessibility seating information and wheelchair space bookings please email kiaora@teraukura.nz or call 04)9740535 during office hours."
  },
  {
    "id": "UNDUBBED Goes Rogue-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
    "name": "UNDUBBED Goes Rogue",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102855-898698-35.jpg?v=2",
    "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
    "coordinates": {
      "lat": -41.29336,
      "long": 174.7745002
    },
    "dates": [
      "2025-08-14-21:00"
    ],
    "displayDate": "Thu 14 Aug",
    "url": "https://www.eventfinda.co.nz/2025/undubbed-goes-rogue/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "An unpredictable live show blending electronica, breakbeat, hip-hop, and jazz improvisation.\n\nUNDUBBED. is a three-piece band featuring Blair Gowan (keys), Ciaran Egan (drums), and Alex Cooper (bass).\n\nJoin them for a snug winter's night at the Rogue and Vagabond, where head-nod beats meet cinematic soundscapes.\n\nMusic from 9:00, FREE ENTRY"
  },
  {
    "id": "Moon Jam Nite-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "Moon Jam Nite",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096023-895595-35.jpg",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-22-19:30",
      "2025-07-29-19:30",
      "2025-08-05-19:30",
      "2025-08-12-19:30",
      "2025-08-19-19:30",
      "2025-08-26-19:30"
    ],
    "displayDate": "Tue 22 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/moon-jam-nite4/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Get your 15 minutes of fame at Newtown's famous Moon Jam Nite, every Tuesday from 7.30pm\n\nThe evening starts off as a regular open mic, and transforms into a full on jam towards the end.\n\nPut your moniker into the sign up sheet, and own your time slot. You can call upon the many talented muso's available to help you play your slot.\n\nA full stage with electric guitar, bass, keyboard, drums, mics, lights and full support from our sound tech.\n\nBring your own songs, poems, and friends (and make some new ones too)\n\nCome along for dinner, drink specials & enjoy the show!"
  },
  {
    "id": "The Carterton Monster Annual Book Fair-Wairarapa Events Centre, Holloway St, Carterton-Event Finder",
    "name": "The Carterton Monster Annual Book Fair",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102812-898677-35.jpg",
    "venue": "Wairarapa Events Centre, Holloway St, Carterton",
    "coordinates": {
      "lat": -41.0252935,
      "long": 175.5285977
    },
    "dates": [
      "2025-08-09-10:00",
      "2025-08-10-10:00"
    ],
    "displayDate": "Sat 09 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/the-carterton-monster-annual-book-fair/carterton",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Calling all bookworms and avid readers! Join us at the 2025 Carterton Monster Annual Book Fair! We have thousands of books looking for new homes! Treat your shelves to some fantastic reading material. All the money raised goes back to the community.\n\nCollecting books now! For enquiries or pickups please contact 027 686 9953."
  },
  {
    "id": "Negotiation Skills for Successful Outcomes-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Negotiation Skills for Successful Outcomes",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2088834-892378-34.jpg?v=17",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/negotiation-skills-for-successful-outcomes3/wellington",
    "source": "Event Finder",
    "eventType": "Business & Networking",
    "description": "Everyone negotiates—at work, at home, or anywhere in between. Whether you're closing deals or resolving conflicts, learn how to get what you want and bring others on board with your vision. (NZ citizens and residents free with ID, others pay $100).\n\nDescription\nNegotiation Skills for Successful Outcomes\n\nWhat’s the Goal?\nTo arm you with the strategies, skills, and mindset to walk into any negotiation and leave with the outcome you desire.\n\nWhat You'll Discover:\n\nCrack the Code on People: Spot different types of negotiators and tailor your approach using the DISC methodology.\nGear Up for Success: Build a killer prep list with intel on your opponent and a clear inventory of your strengths.\nOwn the Room: Master the art of negotiation strategy, use space to your advantage, and know the unspoken rules.\nDiscover Your Edge: Tap into your natural negotiation style and make it work for you.\nLearn from the Masters: Unlock game-changing tips and theories from the biggest “gurus” in the field.\nPractice Makes Perfect: Get hands-on with exercises that turn theory into action.\nReady to negotiate like a pro? This workshop will show you how to make your case, win people over, and seal the deal.\n\nYou must be a NZ citizen or resident to register in this course for free and you must provide photo ID when you attend.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\nSat 8 March 2025\n\n1 day, Sat 9:30 AM - 3:30 PM\nWellington High School\nPresented by Andrew Matushkin\n$100.00 incl. GST\nNZ Residents and Citizens $0.00 incl. GST"
  },
  {
    "id": "The Ageing of Pinot Noir – Vertical Tasting-Ata Rangi Winery, 14 Puruatanga Rd, Martinborough-Event Finder",
    "name": "The Ageing of Pinot Noir – Vertical Tasting",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096227-895666-35.jpg",
    "venue": "Ata Rangi Winery, 14 Puruatanga Rd, Martinborough",
    "coordinates": {
      "lat": -41.2158536,
      "long": 175.4679811
    },
    "dates": [
      "2025-08-17-11:00"
    ],
    "displayDate": "Sun 17 Aug",
    "url": "https://www.eventfinda.co.nz/2025/the-ageing-of-pinot-noir-vertical-tasting/martinborough",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "The Ageing of Pinot Noir – vertical tasting\nSunday 17th August 2025\n\nWe love Pinot Noir and take any opportunity to look back at see how our Pinot Noir develops with age. Julia & Ness will take you through a vertical across a series vintages to reflect on seasonal expression and discover where the vintage conditions shine. Alongside the Pinot Noir vertical we will be offering a selection of canapes from our friends at Nara.\nPlease get in touch visit@atarangi.co.nz to secure your spot, at either 11am or 2pm. Limited spaces available. $50 per person.\n\n\nPour & Explore – Ata Rangi Vintage Pour\nAs part of Pour & Explore Martinborough, we invite you to visit Ata Rangi over the month of August as we will have a selection of our cellar aged wines available to taste. Come & join us for the opportunity to try some of our wines of interest, we look forward to seeing you.\nOpen daily 10am – 4pm – just come on by to try a vintage pour at Ata Rangi."
  },
  {
    "id": "Retirement Reinvented-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Retirement Reinvented",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2081755-889243-35.jpg?v=9",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/retirement-reinvented4/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Whether you’re already retired, or planning ahead, this practical workshop will help you to reflect, re-envision and re-vitalise your life and develop a plan for your future, on your own terms. (NZ citizen and residents free with ID, all others pay $109).\n\nIn your middle years, working, retired or somewhere in between? What’s next? Life is about much more than work or leisure, but most of us have given little thought to what “retirement” might mean.\n\nIt’s difficult to speculate what may happen in the future – but we can be proactive and take control.\nThis course offers insights into how to make the most of our time once we’re less focused on career and/or childrearing. It covers many of the issues people face when considering a move from current employment to a different lifestyle that includes more time to do the things we’ve always promised ourselves we’d do – “when we retire”.\n\nAfter the workshop, you’ll be able to identify a number of common issues and potential ways to manage them when considering and planning your “rejuvenation”, rather than a retirement. We won’t cover financial planning, but will focus on some of the personal growth opportunities for living and making a conscious contribution to your community.\n\nBy the end of the day, you’ll have:\n- Developed your own perspective on ageing and retirement in the 21st Century and identified what’s important to you\n- Completed a personal life audit exercise and considered your strengths\n- Explored possibilities in the major aspects of your life and identified potential challenges and strategies for overcoming them\n- Developed a blueprint to maximise the best years of your life and developed a “future proofing” downsizing plan\n- Considered options to include a sense of purpose and explored and implemented choices that provide you with that sense of purpose\nBring a pen and paper.\n\n1 day, Sat 9:30 AM – 4:00 PM\nWellington High School\nPresented by Angela Robertson"
  },
  {
    "id": "Jewellery Making-Soldered Fidget Rings-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Jewellery Making-Soldered Fidget Rings",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100902-897702-35.jpg?v=9",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-26-09:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/jewellery-making-soldered-fidget-rings3/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Classic textured rings, with a unique and exciting twist! Learn to make your own fine jewellery fidget rings from copper, brass and silver - beginners welcome! All materials included in course fee.\n\nDescription\nIn this one-day workshop you are offered a hands-on opportunity to create custom rings with fun mobile components and unique textures. We'll also practice and build experience in the essential jeweller’s fabrication skills of sawing, filing, soldering, sanding and polishing.\n\nWhat are fidget rings? Also known as spinner rings or stim rings, fidget rings have loose bands attached that can move and swivel around - it's interactive sculpture you can wear!\n\nIn this course you’ll be lead through the design and creation of custom copper and silver rings, with copper, brass and silver wire spinner bands adding novelty and movement to a classic ring design.\n\nThis course offers beginners a fun introduction to jewellery making, and for those with some jewellery experience, it offers a great way to advance and expand your making techniques to new levels.\n\nAll materials included in course fee.\n\nPlease wear closed-in footwear suitable for a workshop environment. bring a work apron if you have one or wear clothes you don’t mind getting a little grubby. Remember to bring your reading glasses if a have them.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "National Poetry Day - Soda Can Poetry-Fareham Creative Space, 80 Underhill Rd, Featherston-Event Finder",
    "name": "National Poetry Day - Soda Can Poetry",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103770-899106-34.png?v=2",
    "venue": "Fareham Creative Space, 80 Underhill Rd, Featherston",
    "coordinates": {
      "lat": -41.1073902,
      "long": 175.3314082
    },
    "dates": [
      "2025-08-16-13:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/national-poetry-day-soda-can-poetry/featherston",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Come celebrate National Poetry Day in August with Fareham Creative Space, and Phantom Billstickers!!\n\nYou are invited to perfect your small poem with helpful critique, stamp it on a soda can to create a recycled art object for local exhibition, with Mrs Hope's Second Chance Emporium.\n\nAll poems shall be bound together into the Soda Can Poetry book, which will be offered for sale at one of our local Featherston Booktown bookstores.\n\nRSVP with your poem by August 10 to receive a helpful critique, finalise, and attend our workshop to transform your piece into soda can poetry. (RSVP by August 14 for inclusion without critique.)\n\nThis workshop will suit ages 7-99. Justine will be your host, exhibition curator, and curator of our collected Soda Can Poetry book. Attendees should bring: a recycled soda can (we'll have some here too), your poem for stamping.\n\n#nationalpoetryday"
  },
  {
    "id": "Sculpture - Intro to Creature Sculpting-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Sculpture - Intro to Creature Sculpting",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100909-897708-35.jpg?v=4",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-02-09:30"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.eventfinda.co.nz/2025/sculpture-intro-to-creature-sculpting3/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Join us in an exciting new introduction to creative sculpting - a hands on class to produce unique creature figurines and miniatures to bring your imagination to life! - Beginners welcome! All material costs included in course fee.\n\nDescription\nWhether you want to make creatures cute, creepy, in the style of pop-toys, figurines, or a one-of-a-kind character in your own style, this is the class for you!\n\nWorking with air dry clays, oven bake polymer clays and wire, armatures this workshop offers a variety of modelling methods and approaches - a great opportunity to turn ideas into tangible 3D forms. With modern clays we can create translucent, flexible, and even glow-in-the-dark elements to add more realism or a touch of the surreal into each creation!\n\nWe’ll kick off working with traditional air-dry clay to get a feel for modelling a few simple forms.\n\nOnce familiar with the materials, we’ll go through some basic design elements, guided by animal anatomy and morphology. From here the tutor will show and chat with the group about ways we can transform the creatures from our imagination into unique sculptures full of character.\n\nStudents will be coached through designing and creating a series of small-scale creature sculptures, beginning simple, and building to a more complex final form as we gather practice.\n\nThe class offers beginner students a fun introduction to sculpting organic forms from scratch, and for those with some hands-on creative experience, it offers a great opportunity to experiment, hone and advance your making skills to new levels.\n\nPlease wear closed-in footwear suitable for a workshop environment. bring a work apron if you have one or wear clothes you don’t mind getting a little grubby. Remember to bring your reading glasses if a have them.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Delaney Davidson - Anniversary Tour-St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki-Event Finder",
    "name": "Delaney Davidson - Anniversary Tour",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2070502-884004-34.jpg?v=6",
    "venue": "St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki",
    "coordinates": null,
    "dates": [
      "2025-07-19-19:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.eventfinda.co.nz/2025/delaney-davidson-anniversary-tour/paekakariki",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "With multiple album Anniversaries this year, Delaney Davidson takes to the road in July to celebrate his extensive and star studded catalogue with special band The Anniversaries.\n\n15 years ago, Delaney Davidson joined Reverend Beat Man - cult figure, gospel trash preacher, and founder of the hugely influential Swiss record label VOODOO RHYTHM RECORDS, to release “Self Decapitation” and a year later “Bad Luck Man”.\n\nWatch the Video “I’m So Depressed” , from the album “Back Luck Man”\n\nFor Radio - Download “I’m So Depressed”\n\nSelf Decapitation had such hits as Little Heart (Silver Scroll Finalist 2011) and barnstormer Dirty Dozen while Bad Luck Man had You’re a Loser (country music song of the year 2012), aswell as I’m So Depressed, and evergreen Time Has Gone. These albums cemented him into the Voodoo Rhythm Family and saw him become a distinct cult figure of the European Touring circuit.\n\nGenerally dealing with the darker side of things, Delaney Davidson has been described as “being the reigning king of capturing the essence of “Noir” in Country and Folk Music, pushing at the framework and preconceptions of roots music with his brand of modern gothic Americana.” (Post to Wire).\n\nHaving spent the last 20 years as travelling “troubadour\" around the globe, sometimes solo, sometimes with accomplices, but always with his Ghost Orchestra, Delaney Davidson has found new focus embracing a love of Aotearoa.\n\nThrough his collaborative work with Troy Kingi “ Black Sea, Golden Ladder”, his visual art work with Tame Iti, and his most current album “Out Of My Head” produced by Merk, he has featured such varied talents as Hayley Westenra and Reb Fountain and has toured with Chamber Music New Zealand - all the while continuing to reinvent concepts and challenge expectations, and gaining respect and admiration from audiences.\n\n\n\"Incontestably one of Aotearoa’s most influential and lauded contemporary songwriters” Under The Radar\n\nDelaney Davidson now takes his band of Anniversaries on the local roads around Aotearoa, don’t miss a night of wry sense of humour, some theatre of unease, and a rocking collection of bangers from his extensive back catalogue as he celebrates the music that got him where he is today.\n\nDelaney Davidson Anniversary Tour\n\nThurs July 10 - The Yard, Raglan\nFri July 11 - Double Whammy, Auckland\nSat July 12 - Turner Centre, Kerikeri\nSun July 13 - Sawmill Cafe, Leigh\nFri July 18 - Meow, Wellington\nSat July 19 - St. Peter's, Paekākāriki\nSun July 20 - Paisley Stage, Napier\nFri July 25 - The Crown, Dunedin\nSat July 26 - Cellar Door, Kinross Winery, Queenstown\nFri August 1 - Theatre Royal, Nelson\nSat 2 August - Loons, Lyttelton\n\nPre-sale tickets – 9am, Friday 21 March\nGeneral tickets – 9am, Monday 24 March\n\nTickets from Banished Music.\n\nSubscribe to presale at\nwww.banishedmusic.com/subscribe"
  },
  {
    "id": "Distilled Comedy – One Last Pour Before Spring Blooms.-The Bond Store, 21 Birmingham Street, Paraparaumu-Event Finder",
    "name": "Distilled Comedy – One Last Pour Before Spring Blooms.",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102244-898373-35.jpg",
    "venue": "The Bond Store, 21 Birmingham Street, Paraparaumu",
    "coordinates": {
      "lat": -40.9032191,
      "long": 174.9975829
    },
    "dates": [
      "2025-08-06-19:00"
    ],
    "displayDate": "Wed 06 Aug",
    "url": "https://www.eventfinda.co.nz/2025/distilled-comedy-one-last-pour-before-spring-blooms/paraparaumu",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "5-Minute Mayhem – Distilled Comedy Chaos at The Bond Store!\n\nOne Last Pour Before Spring Blooms?\n\nGet ready for a wild night of laughs (and possibly some well-meaning trainwrecks) at The Bond Store, Kapiti, Wednesday 6th August.\n\n12 comedians, 5 minutes each, open mic style. Like speed dating, but for jokes – if you don’t like one, wait five minutes and try again.\n\nNew feature spot: “Ask the Comedians” – it might be comedy gold, it might be confusion, but it’ll definitely be memorable.\n\nTickets just $10 from Eventfinda or 2020Entertainment.co.nz. Door sales? Yep, we’ve got you.\n\nCome for the laughs. Stay for the accidental genius.\nGrab your ticket, bring a mate, and prepare to holler!"
  },
  {
    "id": "Watercolour & Wine-Colombo Martinborough, 107 Todds Road, Martinborough-Event Finder",
    "name": "Watercolour & Wine",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2098404-896550-35.jpg",
    "venue": "Colombo Martinborough, 107 Todds Road, Martinborough",
    "coordinates": {
      "lat": -41.2236196,
      "long": 175.4743269
    },
    "dates": [
      "2025-08-17-14:00"
    ],
    "displayDate": "Sun 17 Aug",
    "url": "https://www.eventfinda.co.nz/2025/watercolour-wine/martinborough",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "As the soft winter light filters through the vines, step into the warmth of Colombo’s candlelit barrel room for an afternoon of creativity, flavour, and flow.\n\nIn this intimate Paint & Sip workshop, you’ll be guided to create a beautiful watercolour painting of grape clusters, inspired by the fruit that defines this iconic wine region. No experience is needed—just a willingness to relax, reconnect, and let your creativity unfold."
  },
  {
    "id": "Creative Writing - A Tasting Plate-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Creative Writing - A Tasting Plate",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095539-895355-35.jpg?v=10",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-23-17:30"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/creative-writing-tasting-plate2/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Get your creativity flowing by exploring some of the star forms of creative writing, focusing each week on a different area of fiction or creative non-fiction.\n\nHow often have you said, ‘I wish I could write’? There are many different kinds of writing. Starting is easy so why not give it a go by joining this creative writing ‘tasting plate’.\n\nEach week we’ll focus on a different area of fiction or creative non-fiction. By the end of the programme, you’ll have tried your hand at writing a short story, a narrative poem, a travel memoir, a personal essay drawing from your life, an interview article, a story for children, a short film script and a piece of historical fiction.\n\nBy the end of the course, you’ll be able to:\n- Create works of fiction\n- Develop creative non-fiction text\n- Explore the natural inner spirit of writing\n- Discover your unique writer’s voice\n- Reflect on your own experiences in writing\n- Investigate different writing strategies\n- Discover where your personal writing passions sit and what works for you.\n\nBring pen and paper or a laptop.\n\nThis course is designed to help you improve your skills, to develop your unique writer's voice and to encourage you to take risks on the page. It is not a course where you'll be asked to read your work out loud, critique other writers work, or hand in your writing to the tutor. This is a safe place where you will be supported to do what writers do best - write.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Sue Dyson - Welcome To Our Lounge-Hilltop, 17 Upland Road, Kelburn, Wellington-Event Finder",
    "name": "Sue Dyson - Welcome To Our Lounge",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2094453-894902-34.jpg?v=2",
    "venue": "Hilltop, 17 Upland Road, Kelburn, Wellington",
    "coordinates": {
      "lat": -41.2867265,
      "long": 174.7664651
    },
    "dates": [
      "2025-08-16-19:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/sue-dyson-welcome-to-our-lounge-tour/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Welcome To Our Lounge Tour - Featuring songs from Linda Ronstadt & Carole King\nGate opens 6.30pm Music Starts 7pm Saturday 16 August 2025\nSue Dyson, a gifted vocalist known for her warm and captivating stage presence, backed by talented pianist Mitch Dean to offer an extraordinary musical experience that celebrates the enduring legacies of Linda Ronstadt and Carole King. Set in Hilltop's laid-back intimate atmosphere, their performances promise an engaging experience where the audience will tap their feet to the classics that have defined generations. Sue has graced the stage of New Zealand's 'Good Morning Show' multiple times, showcasing her vocal prowess and musical versatility. Additionally, Sue has lent her voice as a backup vocalist at the prestigious New Zealand Music Awards and has enjoyed significant success with her original country music in Australia.\nMitch Dean complements Sue's voice with his extensive expertise as a guitarist and pianist, cultivated over more than 20 years of performing in diverse musical settings. Notably, he played keys and guitar in the acclaimed Wellington Fleetwood Mac Experience, contributing to their successful tour. Mitch’s deep understanding of music, combined with his skillful instrumentation, enriches the duo's sound and enhances the overall performance.\nTogether, Sue and Mitch create a harmonious blend of nostalgia and artistry, celebrating the timeless contributions of Ronstadt and King. Their performances promise to be an unforgettable evening of music that not only bridges generations but also stirs the soul, inviting audiences to revel in the rich tapestry of these legendary artists' works. Join them for a memorable experience that resonates long after the final note has been played. \nNot for profit, supporting our dedicated musicians. Suggested donation $30\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Japanese - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Japanese - Introductory 1",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090534-893199-35.jpg?v=13",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-18:00"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/japanese-introductory-13/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "For beginners who have no prior knowledge of Japanese.\n\nBy the end of the course, you'll be able to:\n- Introduce yourself and have a simple conversation about family and things around you\n- Count up to 10,000 and say phone numbers, dates and ask and tell the time\n- Ask and understand prices and make requests when shopping\n- Ask and give directions to a taxi driver\n- Order food at a restaurant and demonstrate Japanese manners and etiquette\n- Recognize some hiragana, katakana, kanji and Roma-ji\n\n8 weeks, Tue 6:00 PM – 8:00 PM\nWellington High School\nPresented by Hiro Ogawa\n$199. incl. GST"
  },
  {
    "id": "Drag Brunch Club: Divas through the Decades-The Garden Hotel, 63 Courtenay Place, Wellington-Event Finder",
    "name": "Drag Brunch Club: Divas through the Decades",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103092-898793-35.png?v=2",
    "venue": "The Garden Hotel, 63 Courtenay Place, Wellington",
    "coordinates": {
      "lat": -41.2934683,
      "long": 174.7804739
    },
    "dates": [
      "2025-08-16-11:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/drag-brunch-club-divas-through-the-decades/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Join us for a dazzling Drag Brunch celebrating the fiercest icons in music history!\n\nDivas Through the Decades is a glittering tribute to the legendary women who shaped the soundtrack of our lives— from disco queens to pop powerhouses, our performers will serve high energy, fierce looks, and unforgettable tributes to the legendary divas that defined every era.\n\nPaired with delicious brunch, flowing drinks, and non-stop entertainment, this is your chance to celebrate the queens who made music history—with a little drag magic on top!\n\nTicket Price includes:\n\n\nAccess to the Event\n\n2 x Drink Tokens\n\n1x Meal from below\n\n\nDrinks available with Tokens:\n\n\nCocktails\n\nBottled Beer\n\nNon Alcoholic Drinks\n\n\nFood Options include:\n\n\nFish & Chips\n\nSirloin Steak & Fries\n\nFalafel Fusion Burger (GF)\n\nGarden Burger (Beef patty | Cheese | Lettuce | Tomato | Gherkins | Sriracha mayo | fries | Brioche bun)\n\nSouthern Fried Chicken Burger (Fried Chicken Breast | Bacon | Cheddar Cheese | Lettuce | Tomato | gochujang sauce | Brioche Bun | Fries)\n\n\n*Smaller groups may be seated at a table with another group to maximise space available."
  },
  {
    "id": "Kylie night-Ivy Bar and Cabaret, 63 Cuba Street, Te Aro, Wellington-Event Finder",
    "name": "Kylie night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102588-898563-34.jpg?v=2",
    "venue": "Ivy Bar and Cabaret, 63 Cuba Street, Te Aro, Wellington",
    "coordinates": {
      "lat": -41.290983,
      "long": 174.7772014
    },
    "dates": [
      "2025-08-01-22:00"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.eventfinda.co.nz/2025/kylie-night/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Get ready to move like a locomotive and come to Ivy Bar to join drag artists\n\nBlink Bogan\nRain Bowes\nBraiden Butter\nAnd Olivia Dreams!\n\nTickets selling fast!"
  },
  {
    "id": "Mindful Awareness Workshop-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Mindful Awareness Workshop",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2081773-889254-34.jpg?v=11",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-26-09:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/mindful-awareness-workshop2/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "A hands-on, one-day workshop blending mindfulness, neuroscience, and self-awareness to help you feel better, relate better, and live with more clarity and purpose. (NZ Citizens and residents free with photo ID, all others pay $149).\n\nMindful Awareness – One-Day Workshop\n\nCourse is free for NZ citizens and residents (please bring photo ID when attending workshop). If you are not a NZ citizen or resident a fee of $149 will apply, please phone the office on 04 385 8919 to register.\n\n“If we don’t know what we’re doing, how can we do what we want?”\n\nA hands-on, one-day workshop blending mindfulness, neuroscience, and self-awareness to help you feel better, relate better, and live with more clarity and purpose.\n\nWhat you’ll get:\n\nSimple tools to soothe stress and calm your system\nStrategies to respond wisely instead of reacting on autopilot\nInsight into your feelings, needs and inner patterns\nCutting-edge knowledge of the Vagus nerve and how it shapes your wellbeing\nAn intro to Parts Work: understand the different parts of you and how they work together\nPractical ways to build creativity, clarity and genuine connection\nSkills to feel stronger in yourself, your relationships and your work life\nEveryday tools for better health, resilience and emotional balance\nReal tools. Real change. Backed by science, grounded in practice.\n\nTea and coffee provided, please bring your lunch and snacks, and pen and paper to take notes.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Jewellery Making - Faceted Gemstone Settings-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Jewellery Making - Faceted Gemstone Settings",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100917-897715-35.jpg?v=3",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/jewellery-making-faceted-gemstone-settings3/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Evolve and advance your jewellery making with beautiful faceted stone setting methods! Create jewellery embedded with precious glittering gems in copper, brass and silver - beginners welcome! All material costs included in the course fee.\n\nDescription\nIn this challenging and exciting workshop students will learn to set glimmering round-cut faceted gemstones into brass, copper and/or silver. Create a stone set jewellery project from a choice of simple earrings, a pendant, or a ring.\n\nStudents who have already done a Lost Wax Cast Rings class may bring their cast rings and try their hand at setting stones in those instead of starting a new project.\n\nStudents will learn ‘Flush Setting’, a method of embedding gems into the surface of metal without the need for solder or joins. The process is adaptable to a number of jewellery types and styles. Students with prior Flush Setting and soldering experience may advance to other methods and to try their hand at learning ‘Bead Setting’, or a simple form of ‘Prong Setting’.\n\nStudents may choose from lab-created Sapphires, Rubies and other high strength stones such as Cubic Zirconia in a range of colours.\n\nThe workshop is especially satisfying for the magpie in all of us, adding extra colour and shine to jewellery making.\n\nWhile both beginners and returning students are welcome in the class, be aware that the tools and techniques require a level of fine motor skills, keen eye for detail, and strong hand control which take some patience, practice and perseverance to get the best results.\n\nOur magnifying headsets, work clamps, and patient tutor will help you along the way.\n\nPlease wear closed-in footwear suitable for a workshop environment. bring a work apron if you have one or wear clothes you don’t mind getting a little grubby. Remember to bring your reading glasses if you have them.\n\nBy the end of the course, students will be able to:\n\nDevelop jewellery making skills with introductory faceted stone setting methods\n\nCreate a simple stone set project - either earrings, a pendant, or a ring.\n\nUse Vernier Calipers to measure and calculate metal dimensions\n\nUse files to shape brass, copper and/or silver components\n\nUse a soldering torch to attach metal components such as jump rings\n\nFile, sand and polish brass, copper and/or silver creations into finished jewellery\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Sunday Jazz-The Undercurrent, 118 Tory Street, Wellington-Event Finder",
    "name": "Sunday Jazz",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103522-898994-35.jpg",
    "venue": "The Undercurrent, 118 Tory Street, Wellington",
    "coordinates": {
      "lat": -41.2960797,
      "long": 174.7795355
    },
    "dates": [
      "2025-07-20-15:30",
      "2025-07-27-15:30",
      "2025-08-03-15:30",
      "2025-08-10-15:30",
      "2025-08-17-15:30",
      "2025-08-24-15:30",
      "2025-08-31-15:30",
      "2025-09-07-15:30",
      "2025-09-14-15:30",
      "2025-09-21-15:30",
      "2025-09-28-15:30",
      "2025-10-05-15:30",
      "2025-10-12-15:30",
      "2025-10-19-15:30",
      "2025-10-26-15:30",
      "2025-11-02-15:30",
      "2025-11-09-15:30",
      "2025-11-16-15:30",
      "2025-11-23-15:30",
      "2025-11-30-15:30"
    ],
    "displayDate": "Sun 20 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/sunday-jazz5/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Join us for live jazz every Sunday!\n\nRelax in the charming bohemian olde world atmosphere of the Undercurrent and enjoy the suave musical stylings of The Undercurrent All-Stars. Expect to hear the swinging tunes made famous by the great jazz musicians of the 1940's and 50's.\n\nThis Sunday ft. TBC!\n\nDoors at 3pm/ Gig at 3:30pm.\nTickets $15\n\nComplimentary snacks, wine, beer & soft drinks, tea & coffee, and of course...books available for purchase!\n\nWe hope to see you there!"
  },
  {
    "id": "Poetry Lab-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Poetry Lab",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095542-895358-35.jpg?v=11",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-23-17:30"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/poetry-lab2/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Description\nThis course is ideal for poets of all levels hoping to improve their writing skills, develop their voice and get feedback on their work. Each class will include a short lecture of things to think about during the session but the rest of the time will be spent workshopping your poems.\n\nBring pen and paper to all sessions.\n\nWhat we'll cover:\nWeek 1 - Introduction: experiencing poetry and getting to know your peers\nWeek 2 - Finding Inspiration\nWeek 3 - Avoiding the cliché\nWeek 4 - Bringing out your voice\nWeek 5 - Embracing the page\nWeek 6 - Poetry as performance\n\nWhen the course is complete there will be a live class poetry reading!\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\n6 weeks, Wed 5:30 PM - 7:30 PM\nWellington High School\nPresented by Richard Hoffman\n$149.00 incl. GST"
  },
  {
    "id": "Paint Pouring Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Paint Pouring Beginners",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103055-898769-35.jpg",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/paint-pouring-beginners/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Come along and explore different mixing and pouring techniques as well as colour theory and have fun! Pour paint and make beautiful art! Leave with two completed canvases – everything provided!\n\nEmbark on a colourful adventure in our paint pouring workshop, guided by our passionate tutor, Aimee!\n\nDiscover the mesmerising techniques that turn every canvas into a unique masterpiece. Dive into the world of colour theory, unlocking the secrets of blending, contrast, and harmony. Aimee, will lead you through the exciting process, helping you unleash your creative potential. But it's not just about learning – it's about having fun! Enjoy a relaxed, stress-free environment where you can experiment, laugh, and create vibrant art.\n\nEverything you need will be provided for you to complete two canvases.\n\nPlease note your canvases will still be wet when you leave and you will have foil trays to transport them in – but you do need to have suitable transport (e.g. car) to be able to get two wet A4 canvases safely home.\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Writers on Mondays: Ōrongohau | Best New Zealand Poems 2024-Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington-Event Finder",
    "name": "Writers on Mondays: Ōrongohau | Best New Zealand Poems 2024",
    "imageUrl": "",
    "venue": "Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington",
    "coordinates": {
      "lat": -41.2903326,
      "long": 174.7819275
    },
    "dates": [
      "2025-08-18-12:15"
    ],
    "displayDate": "Mon 18 Aug",
    "url": "https://www.eventfinda.co.nz/2025/writers-on-mondays-orongohau-best-new-zealand-poems-2024/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Join editor and poet Nick Ascroft as he introduces a crackling selection of New Zealand poets from his edition of the annual online anthology Ōrongohau | Best New Zealand Poems. James Brown, Robin Peace, Simon Sweetman, Stacey Teague, Philomena Johnson, Kiri Piahana-Wong, Zephyr Zhang, and others will read their work, and poems by the late Fleur Adcock, Vincent O’Sullivan, and Paula Harris will also be celebrated in this warm-up to Phantom Billstickers National Poetry Day.\n\nADMISSION IS FREE—ALL WELCOME\nWriters on Mondays is presented with the Museum of New Zealand Te Papa Tongarewa, Circa Theatre, Meow and Phantom Billstickers National Poetry Day and supported by the Letteri Family."
  },
  {
    "id": "Paint and Wine Night in Wellington - The Scream-The Borough, 162/168 Main Road, Tawa, Wellington-Event Finder",
    "name": "Paint and Wine Night in Wellington - The Scream",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102215-898357-35.jpg?v=2",
    "venue": "The Borough, 162/168 Main Road, Tawa, Wellington",
    "coordinates": {
      "lat": -41.1791961,
      "long": 174.8250853
    },
    "dates": [
      "2025-08-12-18:30"
    ],
    "displayDate": "Tue 12 Aug",
    "url": "https://www.eventfinda.co.nz/2025/paint-and-wine-night-in-wellington-the-scream/wellington",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "The concept is simple - take a brush in one hand, a drink in the other and let’s paint a masterpiece!\n\nJoin us for a creative night of drinking and painting in the heart of Tawa, Wellington! No previous painting experience necessary. Get your creative juices flowing and your brush strokes going!\n\nDrinks: NO DRINKS are included in the ticket price, but drinks are available for purchase.\n\nFood: A delicious menu will be available to purchase throughout the event.\n\nWhat is Paintvine?\nIt’s a fun social painting class where our artists will run you through step-by-step instructions on how to create your very own masterpiece in a fun and relaxed bar setting. Perfect for dates, catching up with mates or for meeting new friends!\n\nWe provide all the materials you need (high-quality canvas, acrylic paint, brushes). All you need to bring is your creative spirit (or find some at the bottom of a glass). At the end of the night you will leave with your own painting ready to hang up on your wall.\n\nFor tickets, future events, FAQs and more info head to the Paintvine website."
  },
  {
    "id": "Adobe InDesign- Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Adobe InDesign- Beginners",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100914-897712-35.jpg?v=13",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-08-16-09:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/adobe-indesign-beginners2/wellington",
    "source": "Event Finder",
    "eventType": "Business & Networking",
    "description": "An introduction to Adobe's page layout and design programme. Good computer skills essential.\nThis introduction to Adobe's program will cover: setting preferences; understanding the frame-based approach through exploration of frame creation, properties and use; placing and editing text (with styles); placing graphics; defining and applying colour and print considerations.\n\nBy the end of the workshop, you'll have been introduced to InDesign. You'll be shown the program and the main features of its desktop, and then be taken through how to create and work with the main publishing items (text and graphics) in order to create your own publication.\n\nYou'll be able to:\n- Describe the features of InDesign and how to work with them\n- Create text frames, connect text frames and format text\n- Create shapes and frames and format them\n- Import pictures into publications\n- Use rulers, guides and the pasteboard to lay out pages\n- Finish off, check and then print\n\nPresented by Paul Messervy."
  },
  {
    "id": "Anyone Can Draw - Observational - Morning-Inverlochy Art School, 3 Inverlochy Place, Wellington-Event Finder",
    "name": "Anyone Can Draw - Observational - Morning",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102395-898451-35.jpg?v=2",
    "venue": "Inverlochy Art School, 3 Inverlochy Place, Wellington",
    "coordinates": {
      "lat": -41.2941697,
      "long": 174.7700143
    },
    "dates": [
      "2025-07-23-10:00"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.eventfinda.co.nz/2025/anyone-can-draw-observational-morning/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "In this day time 8 week cause you will learn to create a realistic drawing from what you see. This introductory class teaches the technical skills of observational drawing using a variety of media, including pen and ink, charcoal, pencil and pastel.\n\nStudents will learn a range of formal skills through exercises in the following:\n\n\nQuality of line\n\nAccurate observation of shape\n\nGesture drawing\n\nUse of negative and positive shapes\n\nUsing tone well\n\n\nDirect observation of spaces such as interiors, buildings or landscapes\nWith expert guidance from Denise you will learn a broad range of skills that can serve as a basis for advancing into classes in painting and assist and finding your own means of expression.\n\nAll materials provided."
  },
  {
    "id": "Sacred Heart Church Singers-Sacred Heart Catholic Church, 60 Main Street, Greytown 5712, Greytown-Event Finder",
    "name": "Sacred Heart Church Singers",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102454-898498-35.png",
    "venue": "Sacred Heart Catholic Church, 60 Main Street, Greytown 5712, Greytown",
    "coordinates": {
      "lat": -41.0782608,
      "long": 175.462513
    },
    "dates": [
      "2025-07-26-18:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/sacred-heart-church-singers/wairarapa",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Enjoy a beautiful choir singing your favourite carols, share encouraging messages around Christmas and indulge in speciality ‘olie bollen’ (delicious Dutch doughnuts) mulled wine, hot chocolate, tea and coffee."
  },
  {
    "id": "InDuna - Go High - EP Release-Moon, 167 Riddiford Street, Wellington-Event Finder",
    "name": "InDuna - Go High - EP Release",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2091353-893566-35.png?v=2",
    "venue": "Moon, 167 Riddiford Street, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-02-21:00"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.eventfinda.co.nz/2025/induna-go-high-ep-release/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Join Afro-Kiwi artist InDuna to celebrate the release of his brand new EP, ‘Go High’, live at Moon, Wellington on Saturday 2nd August.\n\n‘Go High’ is a gift from InDuna’s younger self to the artist he is today. It's an uplifting and reflective Afro-pop project inspired by his South African roots and journey of resilience. The EP is a reminder to keep dreaming boldly, no matter the obstacles.\n\nDoors open: 9:00 PM\nShow starts: 9:30 PM\n\nVenue: Moon, 167 Riddiford Street, Newtown, Wellington\nMoon is a wheelchair-accessible venue with both seated and standing options available.\n\nWhen the NFC ticket bundle is purchased, fans will get exclusive access to a limited edition NFC-enabled EP, featuring the full EP plus unreleased demos and future tracks, delivered directly to your device before they’re available anywhere else. InDuna merchandise will also be available on the night — don’t miss it.\n\nAbout InDuna:\nSelf-taught artist and producer InDuna blends Afro-pop with the vibrant spirit of his South African heritage. He was recently honoured with the Young Global Achiever Award at the 2024 Prince’s Trust Awards in London and recognised at Buckingham Palace by King Charles III.\n\nHis music has reached global ears, with his track ‘Dreams’, written for the documentary Ink and Gold: An Artist’s Journey to Olympic Glory, winning Best Original Song at the International Online Web Fest and climbing to #6 on the NZ Hot Singles Chart."
  },
  {
    "id": "Hutt City Night Market-Dowse Square, Laings Road, Lower Hutt-Event Finder",
    "name": "Hutt City Night Market",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102044-898284-35.png",
    "venue": "Dowse Square, Laings Road, Lower Hutt",
    "coordinates": {
      "lat": -41.2119819,
      "long": 174.90343
    },
    "dates": [
      "2025-07-24-16:00",
      "2025-07-31-16:00",
      "2025-08-07-16:00"
    ],
    "displayDate": "Thu 24 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/hutt-city-night-market/lower-hutt",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Hey Lower Hutt! Something tasty is coming your way!\n\nWe’re excited to launch the Hutt City Night Market starting Thursday, 17 July 2025, at Dowse Square, Laings Road.\n\nCome along every Thursday from 4PM to 8PM to enjoy delicious food trucks serving up a variety of amazing flavours — rain or shine (unless it’s a severe storm)!\n\nIt’s the perfect way to spend your evening with friends and whānau, supporting local food vendors and soaking up great vibes.\n\nMore details — including the food vendors attending each week — will be announced on our Wellington Street Eats Hub Facebook page. Like and follow our page to stay up to date with all the foodie goodness!\n\nMark your calendars and bring your appetite — we can’t wait to see you there!"
  },
  {
    "id": "Park Road Pop-Up Eats-Park Road Post Production, 141 Park Rd, Miramar, Wellington-Event Finder",
    "name": "Park Road Pop-Up Eats",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102041-898283-35.png",
    "venue": "Park Road Post Production, 141 Park Rd, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3081129,
      "long": 174.8210228
    },
    "dates": [
      "2025-08-06-11:00"
    ],
    "displayDate": "Wed 06 Aug",
    "url": "https://www.eventfinda.co.nz/2025/park-road-pop-up-eats/wellington",
    "source": "Event Finder",
    "eventType": "Markets & Fairs",
    "description": "Park Road Pop-Up Eats Are Back!\n\nWe’re excited to announce that Park Road Pop Up Eats are returning to the Miramar Peninsula this August!\n\nJoin us for a delicious midday feast with a tasty line-up of food trucks and local vendors. From street food classics to sweet treats and global flavours—there’s something for every craving!\n\nBring your appetite, your whānau, and your friends, and support local foodies in the heart of Miramar.\n\nStay tuned for vendor announcements and updates via our Facebook page!"
  },
  {
    "id": "Cooking - Vietnamese Street Food-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Cooking - Vietnamese Street Food",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2084824-890552-35.jpg?v=9",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-17:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/cooking-vietnamese-street-food2/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Gain a panoramic picture of popular Vietnamese Street Foods, which you can enjoy at any time of day and find out how to make some of them with ingredients you can easily find in New Zealand.\n\nAll ingredients provided.\n\nJoin our experienced Vietnamese cook and find out how to create a range of traditional dishes from different parts of Vietnam that you can eat for breakfast, lunch and dinner or at any time of day. Recipes include delicious wraps, pancakes, beef noodle soup, fried rolls with rice noodles and much more.\n\nBy the end of the course, you will be able to: - Define what characterises Vietnamese cooking and key ingredients -\n\nRecognise and make popular street food from North to South of Vietnam - Identify retail outlets which supply Vietnamese ingredients - More confidently follow recipes provided and prepare those recipes with supervision - Prepare dishes for home eating or entertaining\n\nAll ingredients provided but bring an apron, dish cloth, tea towels and containers to take food home.\n\nNote:\n\nOur cooking courses are designed to provide a collaborative and immersive learning experience where learners often work in pairs and/or groups. While we wish to create an inclusive environment for all participants, it is important to note that our courses are unable to accommodate specific food allergies or deviate from the preplanned dishes and menus.\n\nCourses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Cooking - Indian Vegetarian-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Cooking - Indian Vegetarian",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095661-895428-35.jpg?v=10",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-24-17:30"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.eventfinda.co.nz/2025/cooking-indian-vegetarian2/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Create a range of delicious and nutritious meat-free dishes, with an Indian focus. All ingredients included in course fee.\n\nDescription\nIndian vegetarian dishes are tasty, nutritious and not expensive and you’ll come away from the course with lots of ideas and recipes to delight the whole family.\n\nAll ingredients included in course fee. Bring an apron, dishcloth, a couple of tea towels and containers to take any leftovers home.\n\nBy the end of the workshop, you'll be able to:\n- Make a range of vegetarian meals with simple ingredients\n- Make a lentil and vegetable curry\n- Use coconut milk and yogurt base in your curries\n- Confidently use a variety of spices\n\nNote: Our cooking courses are designed to provide a collaborative and immersive learning experience where learners often work in pairs and/or groups. While we wish to create an inclusive environment for all participants, it is important to note that our courses are unable to accommodate specific food allergies or deviate from the preplanned dishes and menus.\n\nCourses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\nDuration 4 weeks"
  },
  {
    "id": "Discover Te Muna – Explore the Wines-Craggy Range Te Muna Vineyard, 275 Te Muna Rd, Martinborough-Event Finder",
    "name": "Discover Te Muna – Explore the Wines",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2085102-890675-35.jpg",
    "venue": "Craggy Range Te Muna Vineyard, 275 Te Muna Rd, Martinborough",
    "coordinates": {
      "lat": -41.2585481,
      "long": 175.485943
    },
    "dates": [
      "2025-08-16-13:45"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.eventfinda.co.nz/2025/discover-te-muna-explore-the-wines/wairarapa",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "Born from passionate vignerons who embrace the challenge of extreme weather conditions, Te Muna Valley’s unique microclimate and soil structure produce exceptional wines with a distinctive style. Join us for an interactive tasting led by wine writer and educator Joelle Thomson, as we explore a curated selection of Te Muna wines from a variety of producers.\n\nYou will be picked up from the Square in Martinborough and driven to the stunning Craggy Range Te Muna Estate vineyard, not normally open to the public. Joelle will guide you through a tasting of twelve of Te Muna wines. The experience concludes with a relaxed opportunity to revisit some of your favourites from the tasting and snack on some local products while meeting several of the producers, before being transported back to the Square.\n\nTickets strictly limited to 16 max people."
  },
  {
    "id": "The Warratahs-The Thistle Inn, 3 Mulgrave St, Thorndon, Wellington-Event Finder",
    "name": "The Warratahs",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2089924-892340-35.png",
    "venue": "The Thistle Inn, 3 Mulgrave St, Thorndon, Wellington",
    "coordinates": {
      "lat": -41.2776965,
      "long": 174.7796332
    },
    "dates": [
      "2025-07-26-18:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.eventfinda.co.nz/2025/the-warratahs/wellington",
    "source": "Event Finder",
    "eventType": "Food & Drink",
    "description": "The Thistle Inn proudly present one of New Zealand's most Iconic bands for one night only.\n\nA special new album release show- \"Burning Daylight\".\n\nAcross their 7 albums, The Warratahs play a blend of Barry Saunders penned songs dipping into country, rockabilly, and folk. You might hear the odd cover but really its the sound that The Warratahs have made their own and its become part of the NZ landscape. Poetic lyrics skidding along on an exciting blend of accordion, fiddle drums, guitars and singing.\n\n$40 General Admission - Doors open 7pm\n$100 includes 2 course dinner, a glass of bubbly & show - 6.30pm\n\nDinner will be served in our private dining rooms. Once you have finished dining you can move into the main bar to watch the show.\n\nShow will be a standing room only."
  },
  {
    "id": "Love and Tax-MEOW, Wellington, 9 Edward St, Wellington-Event Finder",
    "name": "Love and Tax",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102514-898532-35.png?v=2",
    "venue": "MEOW, Wellington, 9 Edward St, Wellington",
    "coordinates": {
      "lat": -41.2906466,
      "long": 174.7748395
    },
    "dates": [
      "2025-08-10-19:00"
    ],
    "displayDate": "Sun 10 Aug",
    "url": "https://www.eventfinda.co.nz/2025/love-and-tax/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "The Zimmermans (a highly popular band who play a lot of Bob Dylan music) and singer-songwriter Lake South will entertain you at a fundraiser for the Better Taxes for a Better Future Campaign. Drinks available.\n\nHave fun while supporting a great cause!"
  },
  {
    "id": "Te Aro Zero Waste Just Sew Repair Cafe-Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington-Event Finder",
    "name": "Te Aro Zero Waste Just Sew Repair Cafe",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102675-898611-34.jpg?v=7",
    "venue": "Te Aro Zero Waste @ Sustainability Trust, 2 Forresters Lane, CBD, Wellington",
    "coordinates": {
      "lat": -41.2942803,
      "long": 174.7817841
    },
    "dates": [
      "2025-08-02-13:00"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.eventfinda.co.nz/2025/te-aro-zero-waste-just-sew-repair-cafe5/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Book online and come along to our August Just Sew session for 2025.\n\nRepairing rather than buying new is a great way to take climate action in your own life – and learn new skills along the way.\n\nBook below and bring along 1-2 clothing or lightweight household items (cushion covers etc) for repair – all needles, thread, and sewing machines will be supplied. We will supply a selection of patches and buttons, but you are also welcome to bring your own if you have something specific in mind.\n\nOur skilled volunteers will be here to assist you with repairs such as missing buttons, tears, holes and hemming. There will also be a DIY table for those who are confident at sewing alone but may not have access to a machine at home.\n\nPlease note: this is a repair focused session, not for restyling, embellishing, or creative alterations.\n\nThe afternoon is split into three one hour sessions (1-2 pm, 2-3 pm, 3- 4 pm) with 8-10 spots in each - please arrive ON the hour of the session you book.\n\nAt times, there may be a small waiting time, we invite you to bring your favourite book, check out the Zero Waste Centre or meet a new friend while you enjoy some light refreshments.\n\nDue to time constraints please only bring 1-2 items for repair so we can ensure everyone’s items have the opportunity to be fixed.\n\nThese workshops are made possible thanks to funding from Wellington City Council, Nikau Foundation and support from Repair Café Aotearoa NZ and Repair Café International."
  },
  {
    "id": "Samoan - Introductory 2-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Samoan - Introductory 2",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095669-895436-35.jpg?v=12",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-24-17:30"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.eventfinda.co.nz/2025/samoan-introductory-22/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "For those who have completed Samoan - Introductory 1 recently or have equivalent knowledge.\n\nDiscounted fee of $99 for NZ citizens and residents.\n\nFor those who have done Introductory 1 (16 hours) or have equivalent knowledge e.g. who may have picked up some basic survival language through travel.\n\nBy the end of the course, you will:\n- Build on the language and grammar skills learned in the Introductory 1 course\n- Have sufficient grammar and vocabulary to conduct a basic conversation in Samoan on everyday topics\n- Be able to describe and use (at a basic level) correct sentence structure in Samoan\n- Be able to describe traditional Samoan protocols and use these in practice\n\n8 weeks, Thur 5:30 PM – 7:30 PM\nWellington High School\nPresented by Elizabeth Solomona\nFrom $99 incl. GST"
  },
  {
    "id": "Pour & Explore - Sip & Sauna at Colombo-Colombo Martinborough, 107 Todds Road, Martinborough-Event Finder",
    "name": "Pour & Explore - Sip & Sauna at Colombo",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096862-895950-35.jpg",
    "venue": "Colombo Martinborough, 107 Todds Road, Martinborough",
    "coordinates": {
      "lat": -41.2236196,
      "long": 175.4743269
    },
    "dates": [
      "2025-08-16-17:30",
      "2025-08-16-18:00",
      "2025-08-16-18:30",
      "2025-08-16-19:00",
      "2025-08-16-19:30",
      "2025-08-23-17:30",
      "2025-08-23-18:00",
      "2025-08-23-18:30",
      "2025-08-23-19:00",
      "2025-08-23-19:30",
      "2025-08-30-17:30",
      "2025-08-30-18:00",
      "2025-08-30-18:30",
      "2025-08-30-19:00",
      "2025-08-30-19:30"
    ],
    "displayDate": "Sat 16 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/pour-explore-sip-sauna-at-colombo/martinborough",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Take the edge off winter with a unique evening of warmth and indulgence at Colombo Martinborough, in collaboration with The Sauna Project Wairarapa. Join us for a relaxing escape under the stars.\n\nYour ticket includes a 30-minute express sauna session with an optional cold plunge to revitalise, followed by a delicious takeaway pizza and a mug of mulled wine to enjoy while you wait.\n\nA perfect way to unwind, reconnect, and treat yourself this winter.\n\n\nThe finer details:\n\nPlease arrive 10 minutes before your sauna booking to allow time to get ready to sauna and choose your pizza. If you require a gluten-free base, please email bookings@colombo.co.nz at least 24 hours before your booking to pre-order your base. There is an additional $5 charge for GF bases, payable on the evening.\n\nWhat to Bring:\n2 x Towels (one to sit on and one for afterwards)\nTogs (arrive in your togs, ready to go)\nWater bottle\n\nLeave jewellery at home as it will get hot in the sauna!\n\nSauna Capacity:\nThe sauna accommodates up to 9 people. If you're booking for a group, please make a single reservation for the entire party."
  },
  {
    "id": "Sci-Fi Sundays: Waterworld-Space Place at Carter Observatory, 40 Salamanca Rd, Kelburn, Wellington-Event Finder",
    "name": "Sci-Fi Sundays: Waterworld",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2067071-882408-35.jpg",
    "venue": "Space Place at Carter Observatory, 40 Salamanca Rd, Kelburn, Wellington",
    "coordinates": {
      "lat": -41.2842728,
      "long": 174.7670289
    },
    "dates": [
      "2025-08-17-18:00"
    ],
    "displayDate": "Sun 17 Aug",
    "url": "https://www.eventfinda.co.nz/2025/sci-fi-sundays-waterworld/wellington",
    "source": "Event Finder",
    "eventType": "Film & Media",
    "description": "Beyond the horizon lies the secret to a new beginning. 17th August\n\nPart of Sci-Fi Sundays 2025.\n\nIn a future where the polar ice-caps have melted and Earth is almost entirely submerged, a mutated mariner fights starvation and outlaw “smokers,” and reluctantly helps a woman and a young girl try to find dry land.\n\n$25 per person. Tickets include complimentary popcorn and an optional live star talk after the screening.\n\nSunday 17 August | 6pm | Space Place | PG-13 | doors open 5:30pm"
  },
  {
    "id": "Cocktail Masterclass-Tonic Bistro, 8 Kitchener Street, Martinborough-Event Finder",
    "name": "Cocktail Masterclass",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103349-898913-35.png?v=2",
    "venue": "Tonic Bistro, 8 Kitchener Street, Martinborough",
    "coordinates": {
      "lat": -41.2174351,
      "long": 175.4585861
    },
    "dates": [
      "2025-08-16-16:30",
      "2025-08-30-16:30"
    ],
    "displayDate": "Sat 16 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/cocktail-masterclass/martinborough",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "The first class 16/08 sold out immediately !\n\nSo Michael added a second one (30/08) A great introduction to how to make magic behind the bar. Michael, owner and bartender at Tonic, loves two things in equal measure (pun intended) – cocktails and history. He’ll offer up some of each in this class. Shaken or stirred? Olive or with a twist? How did a wine blight in Europe help create one of the world’s best-known cocktails? And just who, or what, was Harvey Wallbanger? He’ll get back to the roots of some of our favourite drinks and help you make three of your own. $65pp. Registration is required and spots are limited\nMichael McLane, 069272114, tonicbistro@gmail.com"
  },
  {
    "id": "Taoism: How to Eat Wisely-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
    "name": "Taoism: How to Eat Wisely",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103031-898755-35.jpg",
    "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
    "coordinates": null,
    "dates": [
      "2025-08-07-18:15"
    ],
    "displayDate": "Thu 07 Aug",
    "url": "https://www.eventfinda.co.nz/2025/taoism-how-to-eat-wisely/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "Discover the ancient wisdom of food, energy, and balance in this insightful session with Dr. Jinfeng — plus enjoy a nourishing plant-based dinner and dessert, included with your ticket.\n\nMany people believe they’re eating healthily, yet still experience fatigue, inflammation, and discomfort. Why is that?\n\nFrom a Traditional Chinese Medicine (TCM) perspective, health isn’t just about what you eat — it’s also about when you eat, the energetic nature of the food, and how well it suits your unique body type. In this workshop, you’ll explore food as medicine and gain insight into how to eat in a way that restores vitality, supports digestion, and balances your energy naturally.\n\nWhat you’ll learn\n– The energetic qualities of different foods\n– How to identify which foods suit your constitution best\n– The ideal times to eat during the day and why timing matters\n– How TCM views food as fuel for both physical health and life force\n\nWhether you're curious about Eastern approaches to wellness or looking for practical tools to support your health, this workshop will offer a fresh and meaningful perspective on your relationship with food.\n\nMeet Jinfeng, your host\nAs a scholarly well-being practitioner with a long history of family heritage (great grandfather and father), Dr. Jinfeng has been practicing Taoist Qigong and Buddhism Great Awakening Zen Meditation to sharpen her own sense and boost her own physical vitality."
  },
  {
    "id": "Quiz Night-Cambridge Hotel, 28 Cambridge Terrace, Wellington-Event Finder",
    "name": "Quiz Night",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064908-881278-34.jpg?v=4",
    "venue": "Cambridge Hotel, 28 Cambridge Terrace, Wellington",
    "coordinates": {
      "lat": -41.2951329,
      "long": 174.7828783
    },
    "dates": [
      "2025-07-23-18:30",
      "2025-07-30-18:30",
      "2025-08-06-18:30",
      "2025-08-13-18:30",
      "2025-08-20-18:30",
      "2025-08-27-18:30",
      "2025-09-03-18:30",
      "2025-09-10-18:30",
      "2025-09-17-18:30",
      "2025-09-24-18:30",
      "2025-10-01-18:30",
      "2025-10-08-18:30",
      "2025-10-15-18:30",
      "2025-10-22-18:30",
      "2025-10-29-18:30",
      "2025-11-05-18:30",
      "2025-11-12-18:30",
      "2025-11-19-18:30",
      "2025-11-26-18:30",
      "2025-12-03-18:30",
      "2025-12-10-18:30",
      "2025-12-17-18:30"
    ],
    "displayDate": "Wed 23 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/quiz-night3/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "It's the famous Worth It Wednesday Quiz Night at The Camby! Come down for Wellington’s longest-running quiz, grab some mates and come down for a burger and beer for just $25!\n\nKicking off at 6.30pm, you and your crew will be flexing your mental clout through five rounds of big screen trivia, the Bonus Baffler, The Line Up and Last Person Standing!\n\nThere’s a bunch of prizes to be won, so you’ll need to bring your A-game on quiz night to succeed!\n\nFollow the Facebook pages for updates and new quiz dates for 2025!"
  },
  {
    "id": "Live at 5 Wednesdays-Cable Top Eatery, 1 Upland Road, Wellington-Event Finder",
    "name": "Live at 5 Wednesdays",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102247-898376-35.jpg",
    "venue": "Cable Top Eatery, 1 Upland Road, Wellington",
    "coordinates": {
      "lat": -41.2895051,
      "long": 174.7636113
    },
    "dates": [
      "2025-07-30-17:30"
    ],
    "displayDate": "Wed 30 Jul",
    "url": "https://www.eventfinda.co.nz/2025/live-at-wednesdays4/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Calling all Dancing Queens (and Kings)! Introducing The Toffee Pops, an electrifying duo that transforms any venue into a pulsating disco wonderland. With their infectious energy and irresistible setlist of dance party hits, they keep the dance floor buzzing all night long. You won’t be able to stay in your chair as The Toffee Pops perform “sweet as” songs that will get your toes tapping and your body boogying. From Donna Summer to Gloria Gaynor to the Bee Gees these Disco Divas will have you strutting your stuff with sassy attitude! With a setlist and banter that’s at times sweet, spicy, and a little bit salty, they’ll get you into the groove! So grab your flares, sequins and platforms, and join us on the dancefloor!"
  },
  {
    "id": "Ukulele Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Ukulele Beginners",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090549-893206-35.jpg?v=20",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-18:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/ukulele-beginners3/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "By the end of the course, you'll be able to:\n- Play the most useful and common chords: C, F, G7, G and D\n- Play common strum patterns at a basic level - Make basic chord changes\n- Play at least eight campfire songs at a basic level\n- Tune your instrument\n- Play in other keys using more chords\n\nBring your own ukulele.\n\nTuesday 6.30pm - 7.30pm\n\nTutor: Will Allardice"
  },
  {
    "id": "Storytelling On Stage-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Storytelling On Stage",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095537-895352-35.jpg?v=7",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-19:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/storytelling-on-stage2/wellington",
    "source": "Event Finder",
    "eventType": "Hobbies & Interests",
    "description": "Do you love storytelling shows like The Moth? Come join the growing art of live storytelling. Learn how to find ideas from your life, craft a compelling narrative, and deliver your story in a confident and entertaining way.\n\nDescription\nLive storytelling is an artform unto itself, requiring different skills and techniques from standup comedy or prose writing. In this four-part workshop, you’ll learn:\n\n- Creative writing exercises and daily practices to to find meaningful stories from your life\n- Tools for crafting a compelling personal narrative\n- Techniques to build suspense, drama, and humour into your stories\n- Stagecraft and performance skills to heighten and polish your delivery\n\nBy the end of the class you'll have\n- One or more polished 5-10 minute stories to showcase on stage\n- Dozens of ideas to expand upon for future stories\n- Writing practices to improve your life as a creative\n- Less stage fright and more confidence as a speaker\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
  },
  {
    "id": "Vagina Dry: Vagtastic Voyage-Valhalla, 154 Vivian Street, Wellington-Event Finder",
    "name": "Vagina Dry: Vagtastic Voyage",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103631-899049-35.jpg?v=2",
    "venue": "Valhalla, 154 Vivian Street, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-08-20:00"
    ],
    "displayDate": "Fri 08 Aug",
    "url": "https://www.eventfinda.co.nz/2025/vagina-dry-vagtastic-voyage/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Pōnoke! Wellington!\n\nFirst show of the north island line up at Valhalla with Lavendermenacesucks and No Sector.\n\nTo celebrate our final single release: privileged man.\n\nTickets available now on UTR."
  },
  {
    "id": "The Warratahs-St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki-Event Finder",
    "name": "The Warratahs",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096135-895628-35.jpg?v=2",
    "venue": "St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki",
    "coordinates": null,
    "dates": [
      "2025-07-27-19:00"
    ],
    "displayDate": "Sun 27 Jul",
    "url": "https://www.eventfinda.co.nz/2025/the-warratahs/paekakariki",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "The legendary Warratahs make a welcome return to the village to present their beautiful new album \"Burning Daylight\" along with familiar gems from their previous albums.\n\nFeaturing Barry Saunders' songs and the band's unique blend of country, rockabilly and folk, these pioneering icons and their renowned crack musicianship never fail to deliver a fantastic show with a rocking night out guaranteed.\n\n*Tix $40 at www.undertheradar.co.nz (from Monday 23 June)\n*Text/call 0272584251 for phone bookings\n*Cash only please for door sales (if any available)\n*Doors 7pm, show 7.30pm\n*BYO See less"
  },
  {
    "id": "Beeswax Candle Making-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Beeswax Candle Making",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100903-897703-35.jpg?v=8",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-31-19:00"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.eventfinda.co.nz/2025/beeswax-candle-making3/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "Come along and find out how easy it is to make your very own beeswax candles to give your home a delightful ambience!\n\nHave you always admired the beauty and fragrance of beeswax candles and wondered how they are made? Join Jill in this 2-hour workshop where you will learn how to make three different styles of these candles using beeswax sheets. Come along and immerse yourself in this fun and relaxing workshop as you discover how to create your own candles. These are great for gifting as well!\n\nAll materials included in course fee, bring a pen and paper to take notes if you wish.\n\nBy the end of the course, you’ll be able to:\n\nMake three styles of candles\nKnow where to source wax and wick to continue making your own at home\nBe proud of a home-made product created with your own hands\n\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel. We'll let you know by email so please check yours regularly. If you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\n\nThu 31 July 7:00 PM – 9:00 PM\nWellington High School\nPresented by Jill Askew\n$59.00 incl. GST"
  },
  {
    "id": "Writers on Mondays: Delirious: Damien Wilkins-Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington-Event Finder",
    "name": "Writers on Mondays: Delirious: Damien Wilkins",
    "imageUrl": "",
    "venue": "Te Marae, Te Papa Tongarewa, 55 Cable Street, Wellington",
    "coordinates": {
      "lat": -41.2903326,
      "long": 174.7819275
    },
    "dates": [
      "2025-08-04-12:15"
    ],
    "displayDate": "Mon 04 Aug",
    "url": "https://www.eventfinda.co.nz/2025/writers-on-mondays-delirious-damien-wilkins/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Winner of the prestigious Acorn Prize for Fiction at the 2025 Ockham New Zealand Book Awards, Damien Wilkins’s profoundly moving novel, Delirious, explores untimely loss, ageing, and surprise second chances. As well as being one of our most acclaimed novelists and Director of the IIML, Wilkins is a not-to-be-missed speaker. He appears in conversation with writer Emily Perkins to discuss the art of fiction, a career that spans 14 books, and where singing and songwriting fit into it all.\n\nADMISSION IS FREE—ALL WELCOME\nWriters on Mondays is presented with the Museum of New Zealand Te Papa Tongarewa, Circa Theatre, Meow and Phantom Billstickers National Poetry Day and supported by the Letteri Family."
  },
  {
    "id": "Yoga - All Levels-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Yoga - All Levels",
    "imageUrl": "",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-19:00"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/yoga-all-levels3/wellington",
    "source": "Event Finder",
    "eventType": "Health & Wellness",
    "description": "You don't have to be flexible to enjoy this yoga course, where the emphasis is more on body awareness, quietening the nervous system and working at your own pace.\n\nWe'll cover yoga postures, yoga breathing exercises, relaxation techniques, and posture improvement. More importantly, you'll learn to be more aware of your body, which is the key to improvement, both in your yoga practice and in daily life.\n\nBy the end of the course, you'll be able to:\n- Do basic yoga postures with more confidence\n- Refine your performance of yoga postures by learning some of the physiology involved\n- Do some yoga breathing techniques\n- Do a range of warm-up and stretching exercises\n- Have gained more self-awareness of tension levels, breathing and posture\n- Have improved your ability to relax, using basic relaxation techniques\n\nBring a mat and a large towel (towel will be used as a headrest). (This is a physical activity that involves an element of risk. While all possible measures are taken to prevent accidents or injury, please note that participation is at your own risk).\n\n6 weeks, Tue 7:00pm-8:30pm\nPresented by Lucy Brownlee"
  },
  {
    "id": "Bridget Douglas and Michael Tsalka - Flute and Piano-St Andrews on the Terrace, 30 The Terrace, Wellington-Event Finder",
    "name": "Bridget Douglas and Michael Tsalka - Flute and Piano",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2093201-894086-35.jpg",
    "venue": "St Andrews on the Terrace, 30 The Terrace, Wellington",
    "coordinates": {
      "lat": -41.2799366,
      "long": 174.7749956
    },
    "dates": [
      "2025-08-13-12:15"
    ],
    "displayDate": "Wed 13 Aug",
    "url": "https://www.eventfinda.co.nz/2025/bridget-douglas-and-michael-tsalka-flute-and-piano/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Join us for a lunchtime recital of music for flute and piano, featuring works that span the Baroque to the contemporary. The program opens with J.S. Bach’s masterful Flute Sonata in B minor, a cornerstone of the flute repertoire. Internationally renowned visiting pianist, Michael Tsalka, showcases two solo works for piano: Pauline Viardot-Garcia’s charming Sérénade and Gavotte, followed by the World Premiere of Two Poems, One Meditation by British composer Prof. Nicholas Smith. The recital concludes with Schubert’s virtuosic and deeply expressive Introduction and Variations on “Trockne Blumen”, a dramatic tour de force for both flute and piano.\n\nMichael Tsalka is currently serving as a Professor and a Doctoral Supervisor at the School of Music, Chinese University of Hong Kong, Shenzhen. He is also a member of the European Academy of Sciences and Arts (EASA), Salzburg, Austria, The Chairman of the Board (and faculty) of the European Fortepiano Museum and Academy (EFM) in Germany. As a pianist and early keyboard performer, he has won numerous prizes in Europe, Asia, North America, and Latin America. He is a versatile musician, who performs repertoire from the early Baroque era to our days. Dr. Tsalka maintains a busy concert schedule, performing circa 100 concerts a year worldwide. Together with musicologist Dr. Angélica Minero Escobar, he has prepared a critical edition of Daniel Gottlob Türk's 30 keyboard sonatas for Artaria Editions in New Zealand. Additionally, ten of his scholarly articles have been published by music journals, in Italy, the U.S.A., and the Netherlands.\n\nHe has recorded 40 critically acclaimed CDs, with repertoire from the Baroque period to the Contemporary Era (including many world premiere recordings) for NAXOS, Grand Piano, Paladino, Brilliant Classics, IMI, Sheva Collection, Wirripang, Tempus Clasico, and Ljud & Bild. Circa 85 contemporary compositions (which he premiered) were dedicated to him by composers from all over the world.\n\nBridget is Section Principal Flute of the NZSO and an Artist Teacher in Flute at the New Zealand School of Music - Te Kōkī. She collaborates on diverse performance projects with a wide variety of local and international musicians throughout Australasia. Bridget particularly enjoys playing chamber music with her musical friends and is regularly featured on Radio NZ Concert.\n\nBridget has released five albums, four of which were finalists for Best Classical Album at the Aotearoa Music Awards. She encourages the next generation of musicians in Aotearoa through teaching and mentoring at universities and schools nationwide. In 2020 she was awarded the CANZ (Composers Association of NZ) Citation for Services to NZ Music."
  },
  {
    "id": "Good Luck Returns!-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
    "name": "Good Luck Returns!",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2099189-896921-35.jpg",
    "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
    "coordinates": {
      "lat": -41.29336,
      "long": 174.7745002
    },
    "dates": [
      "2025-07-25-21:30"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.eventfinda.co.nz/2025/good-luck-returns/wellington",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "We are back for round 2, exclusively making music to make you move. Good Luck, lead by Mads Taylor (Tahini Bikini) and Lee Stuart (Lee Stuart) is a double vocal lead 8 piece band once again bringing our disco house inspired beats live to the Rogue & Vagabond stage. Mark your calendars and set your reminders to loud cause you won’t want to miss out on this night!\n\nKoha entry!\n\nVocals - Lee Stuart\nVocals - Mads Taylor\nGuitar - Alex Esbee\nKeys - Aidan McCulloch\nBass - Seth Boy\nPrecision - Eric Sebastian\nDrums - Ryder Smith\nTrumpet - Robbo\n\nMusic from 9:30pm"
  },
  {
    "id": "Italian Film Festival 2025-Regent 3 Cinemas, 230 Queen Street, Masterton-Event Finder",
    "name": "Italian Film Festival 2025",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2101112-897809-35.jpg",
    "venue": "Regent 3 Cinemas, 230 Queen Street, Masterton",
    "coordinates": {
      "lat": -40.9511981,
      "long": 175.6587928
    },
    "dates": [
      "2025-07-19-12:30",
      "2025-07-19-19:30",
      "2025-07-20-12:30",
      "2025-07-21-12:30",
      "2025-07-21-19:30",
      "2025-07-22-12:30",
      "2025-07-22-19:30",
      "2025-07-23-12:30",
      "2025-07-23-19:30",
      "2025-07-24-12:30",
      "2025-07-24-19:30",
      "2025-07-25-12:30",
      "2025-07-25-19:30",
      "2025-07-26-12:30",
      "2025-07-26-19:30",
      "2025-07-27-12:30",
      "2025-07-27-19:30"
    ],
    "displayDate": "Sat 19 Jul + more",
    "url": "https://www.eventfinda.co.nz/2025/italian-film-festival-2025/masterton",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "The Italian Film Festival NZ returns to Masterton’s Regent 3 Cinema, bringing two glorious weeks of passion, laughter, romance, and cinematic brilliance to the big screen from 14 to 27 July 2025.\n\nNow celebrating its 10th spectacular year, the festival showcases the very best of contemporary and classic Italian cinema — from timeless masterpieces to exciting new voices. Whether you're a seasoned Italophile or just in need of a winter escape, this is your ticket to La Dolce Vita.\n\nOpening Night – Monday 14 July, 6.30pm\nJoin us for GLORIA!, a bold and joyful story of rebellious young musicians reimagining classical music. Your $25 ticket includes a celebratory drink — Peroni, San Pellegrino, or a glass of sparkling Poderi Crisci Pinot Grigio — plus popcorn to keep things cinematic.\n\nFestival Highlights Include:\n\nThe heartwarming classic Il Postino\nThe stylish thriller The Talented Mr. Ripley\nThe sweeping romance The English Patient\nPaolo Sorrentino’s lush and poetic Parthenope\nThe thought-provoking drama Vermiglio\nA moving tribute to a revolutionary woman in Maria Montessori\n\nArtistic Director Paolo Rotondo and Festival Manager Renee Mark will be in Masterton to introduce this year’s programme to share their love of Italian storytelling. Paolo send this message:\n\n“I am thrilled to bring some of the magic of Italian cinema to Masterton—in person. We wish to share with you a celebration of Italy's storytelling, passion, and rich cultural heritage. We have curated films for you to laugh, reflect, and fall in love with the artistry of our filmmakers. In the middle of a Wairarapa winter, I think you will enjoy an escape to the sun of Italia. I can’t wait to share these unforgettable stories with you. Ci vediamo al cinema.”\n\nDon’t miss this magical midwinter journey through the heart and soul of Italian cinema.\n\nA presto — see you at the movies!\n\nTickets & full programme: www.regent3.co.nz"
  },
  {
    "id": "Tony Lyall - Talking....When I Should Be Listening-The Fringe Bar, 26 Allen Street, Wellington-Event Finder",
    "name": "Tony Lyall - Talking....When I Should Be Listening",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102089-898298-35.jpg",
    "venue": "The Fringe Bar, 26 Allen Street, Wellington",
    "coordinates": {
      "lat": -41.2933007,
      "long": 174.7820939
    },
    "dates": [
      "2025-08-08-18:30"
    ],
    "displayDate": "Fri 08 Aug",
    "url": "https://www.eventfinda.co.nz/2025/tony-lyall-talking-when-should-be-listening/wellington",
    "source": "Event Finder",
    "eventType": "Arts & Theatre",
    "description": "Tony is one of New Zealand's best stand up comedians, dealing predominantly in stories.\n\nTo make sure he still has stories to tell he has had to put himself into more and more outrageous situations and often during these tense moments Tony thinks to himself, at least I'll get a story out of this. Come to this show to hear what happens when you start talking when you should be listening.\n\nKnown for his work on 7 Days, The Project, The ACC Does Game of 2 Halves, Radio Hauraki and multiple NZ International Comedy Festival Galas. He has performed 7 solo hours as part of the NZ International Comedy Festival and at the Melbourne International Comedy Festival. He has also interviewed some of the biggest celebrities on the planet, including Jake Gyllenhaal, Keira Knightley, Ryan Reynolds, Melanie Lynskey, Chris Pratt and the cast of Jackass to name a few. As well as doing all that, he still has time to be a part of the much loved Alternative Commentary Collective.\n\nTony's MC work has taken him to various sports events around the country. He is the regular Match Day MC for the Black Caps and New Zealand Cricket, and has MCed for both Wellington Cricket and the Blues Rugby Club. He's also a sought after corporate MC and performer, and has entertained some of the biggest companies in New Zealand.\n\nOriginally from Blenheim in the South Island, Tony now lives in West Auckland with his wife, three kids and his Toyota Aqua."
  },
  {
    "id": "Meet the Maker - Rachel Hall from Lighthouse Gin-The Runholder, 89 Martins Road, Martinborough-Event Finder",
    "name": "Meet the Maker - Rachel Hall from Lighthouse Gin",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095557-895366-35.jpg",
    "venue": "The Runholder, 89 Martins Road, Martinborough",
    "coordinates": {
      "lat": -41.2248303,
      "long": 175.4898899
    },
    "dates": [
      "2025-08-15-14:30",
      "2025-08-15-18:00"
    ],
    "displayDate": "Fri 15 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/meet-the-maker-rachel-hall-from-lighthouse-gin/martinborough",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Join us at The Runholder for a relaxed afternoon or evening with some of their wine and spirit makers. Each Friday in August, a different maker will be on hand, pouring something special (to be revealed!) and guiding tastings in an informal, drop-in style setting.\n\nRachel Hall from Lighthouse Gin\nThe first female Head Distiller in New Zealand, Rachel has been crafting Lighthouse by hand since 2014."
  },
  {
    "id": "Candle Making Workshop-Wellington Candle Co., Queen Charlotte Drive, Aotea, Porirua - Mana-Event Finder",
    "name": "Candle Making Workshop",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2043946-871665-34.jpg",
    "venue": "Wellington Candle Co., Queen Charlotte Drive, Aotea, Porirua - Mana",
    "coordinates": null,
    "dates": [
      "2025-08-10-14:00",
      "2025-09-07-14:00",
      "2025-10-12-14:00",
      "2025-11-02-14:00",
      "2025-12-07-14:00"
    ],
    "displayDate": "Sun 10 Aug + more",
    "url": "https://www.eventfinda.co.nz/2025/candle-making-workshop/porirua-mana",
    "source": "Event Finder",
    "eventType": "Other",
    "description": "Unleash Your Inner Candle Maker\n\nJoin us for a relaxing and creative workshop where you'll learn how to make your own beautiful, hand-poured candles. Our expert guides will walk you through every step of the process, from selecting fragrances to creating stunning designs.\n\nWhat's included:\n\n- All materials provided, including soy wax, wicks, fragrance oils, dyes, and containers\n- Step-by-step instruction from experienced candle makers\n- Refreshments to enjoy during the workshop\n- A finished candle to take home\n\nWorkshop Details:\n- Duration: 2 hours\n- Limited Spaces: Only 7 spots available per session\n- Child Supervision: Children under 12 must be accompanied by an adult\n\nUpcoming Workshops:\n- Sunday, February 2nd, 2025, at 2 PM\n- Sunday, March 2nd, 2025, at 2 PM\n- Sunday, April 6th, 2025, at 2 PM\n- Sunday, May 4th, 2025, at 2 PM\n\n**Book your spot now!**\nMore details on our Website"
  },
  {
    "id": "Unforgettable Dinah Washington: Lisa Tomlins & Wade Reeve Live-Underworld Tavern, 13 Pirie Street, Wellington-Event Finder",
    "name": "Unforgettable Dinah Washington: Lisa Tomlins & Wade Reeve Live",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102522-898537-34.jpg",
    "venue": "Underworld Tavern, 13 Pirie Street, Wellington",
    "coordinates": {
      "lat": -41.2972108,
      "long": 174.7828717
    },
    "dates": [
      "2025-07-20-13:00"
    ],
    "displayDate": "Sun 20 Jul",
    "url": "https://www.eventfinda.co.nz/2025/unforgettable-dinah-washington-lisa-tomlins-wade-reeve-live/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "A Tribute to the Queen of the Blues\n\nDinah Washington, the self-proclaimed “Queen of the Blues,” was a powerhouse of jazz, blues, and soul whose voice defined an era. Now, her timeless repertoire is being reimagined by Aotearoa’s own queen of soulful expression—the incomparable Lisa Tomlins.\n\nLisa’s vocal versatility is legendary. Whether interpreting Tower of Power, jazz standards, or contemporary pop, she brings depth, warmth, and unmistakable style. She’s graced stages with L.A.B., Fly My Pretties, Neil Finn, and countless others—earning her place as one of New Zealand’s most beloved vocalists.\n\nJoining her is the ever-tasteful guitarist Wade Reeve, whose intuitive playing complements Lisa’s voice with elegance and restraint. If you caught their stunning set at CubaDupa, you already know the magic this duo creates.\n\nMaybe you'll hear Dinah’s most iconic songs—What a Diff’rence a Day Made, Cold, Cold Heart, September in the Rain, and of course, Unforgettable. This afternoon promises to be just that.\n\nCapital Blues Members: $10\nGeneral Admission: $20\nMembers also enjoy 10% off at the bar"
  },
  {
    "id": "Spanish - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
    "name": "Spanish - Introductory 1",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090561-893213-35.jpg?v=7",
    "venue": "Wellington High School, 249 Taranaki St, Wellington",
    "coordinates": {
      "lat": -41.3002102,
      "long": 174.7751281
    },
    "dates": [
      "2025-07-22-19:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.eventfinda.co.nz/2025/spanish-introductory-13/wellington",
    "source": "Event Finder",
    "eventType": "Community & Culture",
    "description": "For beginners who have no prior knowledge of Spanish.\nBy the end of the course, you'll\n\n- Have developed some ability to express yourself in basic Spanish\n- Have some ability to use correctly the present, past and \"going to\" tenses\n- Have some understanding of how adjectives, my-mine, and the verb tener are used\n- Have practised the difference between ser/estar and have some ability to use them correctly\n- Have practised, with some success, the use of numbers and telling the time\n- Have begun to develop some basic working Spanish vocabulary\n\n8 weeks, Tue 7:30 PM -9:30 PM\nWellington High School\nPresented by Tony Ilott $199 incl. GST"
  },
  {
    "id": "Swing Jazz Jam-The Undercurrent, 118 Tory Street, Wellington-Event Finder",
    "name": "Swing Jazz Jam",
    "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100509-897541-34.jpg",
    "venue": "The Undercurrent, 118 Tory Street, Wellington",
    "coordinates": {
      "lat": -41.2960797,
      "long": 174.7795355
    },
    "dates": [
      "2025-08-10-17:30"
    ],
    "displayDate": "Sun 10 Aug",
    "url": "https://www.eventfinda.co.nz/2025/swing-jazz-jam/wellington",
    "source": "Event Finder",
    "eventType": "Music & Concerts",
    "description": "Swing into the golden age of jazz at the Swing Jazz Jam – a toe-tapping evening of classic grooves and spontaneous musical magic!\n\nFeaturing piano, guitar, double bass, and drums, this open jam invites musicians and jazz lovers alike to soak up the rhythm and energy of timeless swing.\n\nWhether you're here to play or just to sway, come down to Undercurrent on Sunday 10th August at 5:30pm. Koha entry – all welcome."
  }
]
