[
{
  "id": "Overcoming Imposter Syndrome for Creatives-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Overcoming Imposter Syndrome for Creatives",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103134-898829-35.jpg?v=2",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-02-09:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://www.eventfinda.co.nz/2025/overcoming-imposter-syndrome-for-creatives2/wellington",
  "source": "Event Finder",
  "eventType": "Business & Networking",
  "description": "Do you often feel your creative work isn't good enough or worry about sharing it with others?\nJoin our workshop to explore the roots of imposter syndrome and discover practical strategies to boost your confidence, allowing you to proudly showcase your art to the world.\nThere is a widespread ‘lack of confidence’ epidemic among creatives, and if you have ever felt like your work is not good enough, hesitated to submit your art to competitions, or doubted your skills when applying for creative jobs, you are not alone!\nBy the end of this workshop, you’ll be able to: Identify and challenge the origins of your imposter syndrome.\nCourses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel."
},
{
  "id": "Take a Breathing Break-Johnsonville Library, 34 Moorefield Road, Wellington-Event Finder",
  "name": "Take a Breathing Break",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102989-898738-34.png?v=2",
  "venue": "Johnsonville Library, 34 Moorefield Road, Wellington",
  "coordinates": {
    "lat": -41.2228005,
    "long": 174.8048436
  },
  "dates": [
    "2025-07-31-17:45"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/take-breathing-break/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "This session isn’t about adding more to your to-do list, it’s about taking something off it: stress, overthinking, and emotional weight.\nThrough Breath.\nIn just 45 minutes, you can: 1.\nA grounded sense of calm 3.\nA taste of what the full programme offers Come take a breathing break."
},
{
  "id": "Happily Never After-Te Raukura ki Kapiti, Sir Jon Trimmer Theatre, 34a Raumati Rd, Paraparaumu-Event Finder",
  "name": "Happily Never After",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104113-899249-35.png",
  "venue": "Te Raukura ki Kapiti, Sir Jon Trimmer Theatre, 34a Raumati Rd, Paraparaumu",
  "coordinates": null,
  "dates": [
    "2025-08-14-18:00"
  ],
  "displayDate": "Thu 14 Aug",
  "url": "https://www.eventfinda.co.nz/2025/happily-never-after/paraparaumu",
  "source": "Event Finder",
  "eventType": "Arts & Theatre",
  "description": "Kapiti College presents a drama production that is completely student-directed and student-led!\nHappily Never After?\nis a bold, original retelling of classic fairy tales—flipping the script on outdated stereotypes, exploring real teen issues, and reimagining what “happily ever after” really means.\nThis heartfelt and hilarious production tackles friendship, heartbreak, identity, and growing up, all through the lens of iconic characters like Ariel, Aladdin, Cinderella, and more.\nWith clever storytelling and powerful performances, our young cast and creative team shine in this unforgettable night of theatre."
},
{
  "id": "Fairytale Adventures-Capital E, 4 Queens Wharf, Wellington-Event Finder",
  "name": "Fairytale Adventures",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104218-899304-35.jpg",
  "venue": "Capital E, 4 Queens Wharf, Wellington",
  "coordinates": {
    "lat": -41.2852273,
    "long": 174.7784346
  },
  "dates": [
    "2025-08-09-11:00",
    "2025-09-06-11:00",
    "2025-10-11-11:00",
    "2025-11-01-11:00"
  ],
  "displayDate": "Sat 09 Aug + more",
  "url": "https://www.eventfinda.co.nz/2025/fairytale-adventures2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Join us in PlayHQ for these Saturday sessions.\nTogether with your tamariki we tell fairytale favourites with a twist!\nThis interactive performance guided by Fairy Cat and Friends invites the audience to use their creativity to guide the story.\nBest suits ages 3-5.\nFree, donations appreciated."
},
{
  "id": "Pottery - Handbuilding Basics-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Pottery - Handbuilding Basics",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095688-895443-35.jpg?v=2",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-25-10:00"
  ],
  "displayDate": "Fri 25 Jul",
  "url": "https://www.eventfinda.co.nz/2025/pottery-handbuilding-basics3/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Understand shrinkage and clay care, joining techniques, drape and press moulding, mark making, slip making and application - as well as tetrahedron, cone and cylinder production The techniques learnt during the making will provide an excellent springboard to creating a wide array of ceramic objects in the future.\nPottery courses are held at Wellington Potters' Association, 130 Grant Road, Thorndon.\nAll our courses are scheduled up to a year in advance which means the at times we may need to make changes to the original schedule.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\nincl."
},
{
  "id": "Little Creators-Capital E, 4 Queens Wharf, Wellington-Event Finder",
  "name": "Little Creators",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104227-899309-35.jpg",
  "venue": "Capital E, 4 Queens Wharf, Wellington",
  "coordinates": {
    "lat": -41.2852273,
    "long": 174.7784346
  },
  "dates": [
    "2025-07-23-11:00",
    "2025-07-30-11:00",
    "2025-08-06-11:00",
    "2025-08-13-11:00",
    "2025-08-20-11:00",
    "2025-08-27-11:00",
    "2025-09-03-11:00",
    "2025-09-10-11:00",
    "2025-09-17-11:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/little-creators/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Get creative with Aunty Cara at 11am each Wednesday in PlayHQ!\nCome along and try a sensory-based craft.\nTamariki work with new and exciting materials, learning different techniques to make special creations.\nBest suits ages 3-5, Little Creators is part of our E Tipu E Rea term-time programme.\nFree, donations appreciated."
},
{
  "id": "NZ Sign Language - Introductory Level 1A-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "NZ Sign Language - Introductory Level 1A",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095541-895357-35.png?v=15",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-17:30"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/nz-sign-language-introductory-level-1a4/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "For beginners who have no prior knowledge of NZ Sign Language.\nDiscounted fee of $109 for NZ citizens and residents - ID required.\nDescription By the end of the course, you'll be able to communicate in basic sign language and will be able to: - Introduce yourself, greet other people and exchange personal information - Demonstrate strategies for: getting attention, asking for clarification, correction and repetition - Demonstrate the finger spelling alphabet - Use numbers (0 – 20) and simple time phrases - Express basic needs and wants - Use a basic signing vocabulary Note: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Guitar - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Guitar - Beginners",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095551-895363-35.jpg?v=21",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-18:30"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/guitar-beginners4/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Learn the basic chords, strumming and lots of songs.\nBy the end of the course, you'll have learned how to play simple guitar tunes, using easy tricks the professionals use.\nYou'll be able to: - Demonstrate a number of basic chords - Demonstrate a range of basic strumming patterns - Play a range of simple songs confidently - Demonstrate how to tune a guitar - Demonstrate how to use a capo Bring your own acoustic guitar.\nWellington High School Presented by Will Allardice $125.00 incl.\nGST"
},
{
  "id": "The Inner Magnet – Manifesting from the Inside Out-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "The Inner Magnet – Manifesting from the Inside Out",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095961-895565-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-22-18:15"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/the-inner-magnet-manifesting-from-the-inside-out/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Tuesday Wellbeing Seminars The Inner Magnet – Manifesting from the Inside Out Why do some desires seem to flow effortlessly into our lives, while others feel blocked at every turn?\nWhat if the key to manifestation isn’t about effort, but alignment?\nThis workshop explores how the wisdom of yoga philosophy can help us shift from the noise of a reactive, conditioned mind into a space of deeper inner alignment.\nBeyond just rewiring thoughts, yoga offers a map back to the part of us that is steady, clear, and deeply connected — an inner magnet that draws what is truly nourishing for our growth and transformation.\nThrough reflection, and an informed practice, you’ll be invited to consider how tuning inwards can begin to shape your outer reality in more meaningful ways."
},
{
  "id": "Jewellery Making - Precious Stones in Cast Rings-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Jewellery Making - Precious Stones in Cast Rings",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090546-893203-35.jpg?v=7",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-22-18:00"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/jewellery-making-precious-stones-in-cast-rings3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Description Expanding on the Lost Wax Cast Rings class, students in this course get to add precious gemstones to their cast jewellery process!\nStudents will learn to work with a range of jeweller waxes, including hard wax, modelling wax, sheet wax, melting wax and more to create wax 'masters', setting stones in wax, as well as turning raw metal casts into shining ready-to-wear jewellery.\nStudents choose their favourite wax masters to be cast professionally outside of class time, transforming the designs into their choice of metals, and are returned to students to polish and finish their casts in class.\nThe course fee includes a range of small precious gemstones, casting 2 rings in either copper, brass, yellow bronze, white bronze, and 2 rings cast in Sterling Silver.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Photography - Unlocking the Secrets to Captivating Images-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Photography - Unlocking the Secrets to Captivating Images",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095665-895433-35.jpg?v=3",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-24-17:30"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/photography-unlocking-the-secrets-to-captivating-images3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "This course will help you find the answers to these questions and show you how to transform your photographs into extraordinary, captivating, and memorable images Elevate your photography from ordinary to extraordinary and ensure your work stands out in the digital age.\nBut how do you turn what you love into something that makes people go, \"Wow\"?\n-Understand why some images linger in memory and how to make your photographs unforgettable.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\".\nFeel passionate about photography but need fresh ideas on what to photograph and how to truly stand out."
},
{
  "id": "Dried Flowers - Meadow Hoop-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Dried Flowers - Meadow Hoop",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095696-895448-35.jpg",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-26-09:30"
  ],
  "displayDate": "Sat 26 Jul",
  "url": "https://www.eventfinda.co.nz/2025/dried-flowers-meadow-hoop3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Come and learn how to make a dried flower meadow hoop (25cm wide) with Red Ruth from Bloomin Heck Wreaths.\nCome along to this workshop and make a dried flower meadow hoop using a combination of dried flowers and foliage (30cm wide).\nEnrol with a family member or friend or come and make new friends!\nThe fee includes all dried flowers, foliage, hoop and box to carry your floral art in.\nWe'll let you know by email so please check yours regularly."
},
{
  "id": "Karaoke Joe-Club Wairarapa, 20 Essex Street, Masterton, Masterton-Event Finder",
  "name": "Karaoke Joe",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103149-898838-35.jpg",
  "venue": "Club Wairarapa, 20 Essex Street, Masterton, Masterton",
  "coordinates": {
    "lat": -40.9505615,
    "long": 175.6568216
  },
  "dates": [
    "2025-08-01-19:30"
  ],
  "displayDate": "Fri 01 Aug",
  "url": "https://www.eventfinda.co.nz/2025/karaoke-joe7/masterton",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Come on down and have a go, or if that is not something that appeals, come down and support those who do.\nThere is always some great music.\nMembers, Affiliated Members and their guests are welcome."
},
{
  "id": "Rogue Sunday Jazz - Emma Hattaway-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
  "name": "Rogue Sunday Jazz - Emma Hattaway",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2099236-896944-34.png?v=2",
  "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
  "coordinates": {
    "lat": -41.29336,
    "long": 174.7745002
  },
  "dates": [
    "2025-07-27-17:00"
  ],
  "displayDate": "Sun 27 Jul",
  "url": "https://www.eventfinda.co.nz/2025/rogue-sunday-jazz-emma-hattaway/wellington",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "The Rogue's regular Sunday afternoon jazz.\nFunky, jazzy, soulful jazz.\nBeer, hangs, and jazz, on a Sunday, perfect!\nThis week featuring local bassist Emma Hattaway and her band.\nJoin Emma and friends for an evening celebrating two of jazz’s most original voices."
},
{
  "id": "Mindfulness Meditation-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Mindfulness Meditation",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095545-895360-34.jpg?v=11",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-18:00"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/mindfulness-meditation2/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Being mindful can help make us more resilient to life’s challenges and give us more tools for dealing with strong emotions and stress or just enlivening the daily grind.\nIf you’d like a hand with learning to relax or would like to get fresh insights into why we behave as we do, this course will help.\nIt’s totally secular, practical and takes us all just as we are.\nBy the end of the course, you’ll be able to: - Describe some elements of Buddhism through a secular lens - Describe practical tips to make your meditation time successful - Practise guided and silent meditation and the importance of ‘noticing how things are’ - Find resources to support you in a long-term, and even life-long, approach to mindfulness - Describe three elements of the mindfulness revolution in psychology and mental health Each session includes practical meditation exercises and opportunities for discussion.\nBring a notepad and pen."
},
{
  "id": "Explorers – The Age of Discovery - with James May-The Opera House, 111 - 113 Manners Street, Wellington-Event Finder",
  "name": "Explorers – The Age of Discovery - with James May",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2072069-884736-35.jpg",
  "venue": "The Opera House, 111 - 113 Manners Street, Wellington",
  "coordinates": {
    "lat": -41.2913572,
    "long": 174.7779946
  },
  "dates": [
    "2025-08-15-19:30"
  ],
  "displayDate": "Fri 15 Aug",
  "url": "https://www.eventfinda.co.nz/2025/explorers-the-age-of-discovery-with-james-may/wellington",
  "source": "Event Finder",
  "eventType": "Education & Learning",
  "description": "James May will premiere a landmark live theatre show in Australia, New Zealand and Singapore, bringing to life the stories of the extraordinary explorers who traversed the deserts, scaled the mountains, sailed into the unknown.\nThe live show combines theatrical techniques and James’ charismatic storytelling to create an evening of compelling intellectual entertainment.\nFrom Ice Age migrations to space travel, the stories of famous, infamous and unknown explorers will come to life in a theatric style, presented by British television presenter and award-winning journalist James May.\nJames May is best known as a co-presenter of the motoring programs Top Gear and The Grand Tour, and as the host of the Our Man in… TV series.\nFew endeavors have captured the imagination and spirit of humanity as profoundly as exploration."
},
{
  "id": "Yoga Nidra: Moon Bathing-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Yoga Nidra: Moon Bathing",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095954-895561-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-31-18:15"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/yoga-nidra-moon-bathing/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Yoga Nidra: Moon Bathing Slow down, settle in, and let the soft glow of the moon guide you inward.\nThis calming evening will centre around the deeply restorative practice of Yoga Nidra—a guided meditation designed to bring your body into a state of deep rest while your awareness gently drifts between waking and dreaming.\nKnown to activate the parasympathetic nervous system and reduce stress, Yoga Nidra supports emotional balance, mental clarity, and a profound sense of ease.\nThis moon-themed session invites you to tune into the gentle, reflective energy of the lunar cycle—a time for slowing down, softening, and simply being.\nAfter the practice, we’ll be sharing a nourishing plant-based dinner together."
},
{
  "id": "Psychology of Money Management-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Psychology of Money Management",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2088833-892376-35.jpg?v=3",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-02-09:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://www.eventfinda.co.nz/2025/psychology-of-money-management3/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Once you understand how you regard money, you can take control of yours!\nIn this workshop, we're not here to tell you to cut your budget or skip your favourite treats.\nInstead, we’ll come together to design a financial plan tailored to your unique needs, making you feel confident, excited, and in control.\nIn this workshop, you’ll explore the psychology of money and how it influences your financial decisions.\nA step-by-step planning process will be taught by working through a case study."
},
{
  "id": "Ngaio Repair Cafe-Ngaio Union Church, 3 Kenya St, Wellington-Event Finder",
  "name": "Ngaio Repair Cafe",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2094297-894830-35.jpg",
  "venue": "Ngaio Union Church, 3 Kenya St, Wellington",
  "coordinates": {
    "lat": -41.2521782,
    "long": 174.7735632
  },
  "dates": [
    "2025-08-16-10:00",
    "2025-09-20-10:00",
    "2025-10-20-10:00",
    "2025-11-15-10:00"
  ],
  "displayDate": "Sat 16 Aug + more",
  "url": "https://www.eventfinda.co.nz/2025/ngaio-repair-cafe2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Ngaio Repair Café, organised in and by Ngaio Union Church, is part of the worldwide Repair Café movement to cut down waste and reduce greenhouse gas emissions.\nOur local volunteer repairers will look at and try to fix all sorts of household gear: wooden, metal, electrical, electronic, pottery, computer, fabric, toys, clothing, beads, cardboard – as long as it’s small enough for you to bring.\nOne of our volunteers is a guitar repairer who can mend and tune any fretted instruments.\nAnother has an oilstone and will sharpen knives.\nWhile you wait to have your item looked at, tea and coffee and cold drink are provided."
},
{
  "id": "New Zealand Book Awards for Children & Young Adults Ceremony 2025-Pipitea Marae, 55 Thorndon Quay, Thorndon, Wellington-Event Finder",
  "name": "New Zealand Book Awards for Children & Young Adults Ceremony 2025",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102712-897498-35.png",
  "venue": "Pipitea Marae, 55 Thorndon Quay, Thorndon, Wellington",
  "coordinates": {
    "lat": -41.2764225,
    "long": 174.7808605
  },
  "dates": [
    "2025-08-13-18:30"
  ],
  "displayDate": "Wed 13 Aug",
  "url": "https://www.eventfinda.co.nz/2025/new-zealand-book-awards-for-children-young-adults-ceremony-2025/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Buy your tickets now for the 2025 New Zealand Book Awards for Children and Young Adults to join the celebration of the best books of the year for young New Zealand readers.\nYou’ll get to meet the finalists and applaud the winners at an exuberant awards ceremony in the characterful Pipitea Marae on Wednesday 13 August.\nTheir achievements will be acknowledged on the night by publishers, politicians, booksellers, librarians, media and supporters of the children’s literature community.\nMembers of the public are welcome to purchase tickets too.\nThis is a popular event with a limited number of seats, so book your place today and enjoy this wonderful celebration of Aotearoa’s very best children’s literature."
},
{
  "id": "Peace over Panic - Rewiring the Anxious Mind-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Peace over Panic - Rewiring the Anxious Mind",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103032-898756-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-05-18:15"
  ],
  "displayDate": "Tue 05 Aug",
  "url": "https://www.eventfinda.co.nz/2025/peace-over-panic-rewiring-the-anxious-mind/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Transform your relationship with anxiety in just 60 minutes using the revolutionary FasterEFT technique that's helping thousands worldwide break free from the grip of panic and overwhelm.\nIn \"Peace over Panic - Rewiring the Anxious Mind,\" you'll discover how your mind creates anxiety through unconscious patterns and learn a simple yet powerful tapping method to literally rewire your nervous system for calm and confidence.\nUnlike traditional therapy that can take months or years, FasterEFT works at the subconscious level where anxiety is actually created, allowing you to experience immediate relief and lasting change.\nWhether you struggle with daily worry, panic attacks, or overwhelming stress, this workshop will give you practical tools to take control of your mental state and create the peaceful, confident life you deserve.\nLeave with a complete system you can use anywhere, anytime to transform anxiety into inner peace."
},
{
  "id": "Quiz Night-Eva Beva, 31-35 Dixon Street, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064362-880990-35.png?v=6",
  "venue": "Eva Beva, 31-35 Dixon Street, Wellington",
  "coordinates": {
    "lat": -41.2919214,
    "long": 174.7771465
  },
  "dates": [
    "2025-07-23-19:00",
    "2025-07-30-19:00",
    "2025-08-06-19:00",
    "2025-08-13-19:00",
    "2025-08-20-19:00",
    "2025-08-27-19:00",
    "2025-09-03-19:00",
    "2025-09-10-19:00",
    "2025-09-17-19:00",
    "2025-09-24-19:00",
    "2025-10-01-19:00",
    "2025-10-08-19:00",
    "2025-10-15-19:00",
    "2025-10-22-19:00",
    "2025-10-29-19:00",
    "2025-11-05-19:00",
    "2025-11-12-19:00",
    "2025-11-19-19:00",
    "2025-11-26-19:00",
    "2025-12-03-19:00",
    "2025-12-10-19:00",
    "2025-12-17-19:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night9/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Every Wednesday is trivia night at one of Wellington's most popular quizzes - Eva Beva!\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew!\nSo if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
},
{
  "id": "Moon Jam Nite-Moon, 167 Riddiford Street, Wellington-Event Finder",
  "name": "Moon Jam Nite",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2057961-877809-35.jpg?v=2",
  "venue": "Moon, 167 Riddiford Street, Wellington",
  "coordinates": {
    "lat": -41.3132459,
    "long": 174.7798505
  },
  "dates": [
    "2025-07-22-19:30",
    "2025-07-29-19:30",
    "2025-08-05-19:30",
    "2025-08-12-19:30",
    "2025-08-19-19:30",
    "2025-08-26-19:30",
    "2025-09-02-19:30",
    "2025-09-09-19:30",
    "2025-09-16-19:30",
    "2025-09-23-19:30",
    "2025-09-30-19:30",
    "2025-10-07-19:30",
    "2025-10-14-19:30",
    "2025-10-21-19:30",
    "2025-10-28-19:30",
    "2025-11-04-19:30",
    "2025-11-11-19:30",
    "2025-11-18-19:30",
    "2025-11-25-19:30",
    "2025-12-02-19:30",
    "2025-12-09-19:30",
    "2025-12-16-19:30"
  ],
  "displayDate": "Tue 22 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/moon-jam-nite2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Newtown's favourite jam night!\nA weekly showcase of the musical talents of Newtown & beyond Come and share your original tunes, jam with other musicians, or simply enjoy the show & drink specials!\nElectric guitar, bass, keyboard, drums, mics, lights and mixer provided, along with support from our in-house sound tech Billy.\nBring your own gear, cymbals, songs, & poems.\nFree entry, sign ups from 7pm, every Tuesday."
},
{
  "id": "Watercolour Basics-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Watercolour Basics",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095543-895359-35.jpg?v=8",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-23-19:30"
  ],
  "displayDate": "Wed 23 Jul",
  "url": "https://www.eventfinda.co.nz/2025/watercolour-basics2/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "A chance to experiment with watercolour paints and different sorts of paper - no experience needed and all materials provided.\nFind out more about the fascinating medium that is watercolour.\nNo experience is required - you'll look at your favourite landscape and portrait artists and learn to be more confident with watercolour as you develop your own style.\nAll materials included in course fee.\nBy the end of the course, you'll be able to: - Pencil a basic sketch with simple perspective - Demonstrate the workings of watercolour brushes and paint - Describe the different weights of paper and their effects - Gain more insight into the use of colour - Become more confident in the watercolour medium 4 weeks, Presented by Charlotte Hird."
},
{
  "id": "Quiz Night-Archie Brothers Cirque Electriq Wellington, 1 Willis St, Wellington Central, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2063455-880499-34.jpg?v=4",
  "venue": "Archie Brothers Cirque Electriq Wellington, 1 Willis St, Wellington Central, Wellington",
  "coordinates": {
    "lat": -41.2866853,
    "long": 174.7762672
  },
  "dates": [
    "2025-07-22-18:00",
    "2025-07-29-18:00",
    "2025-08-05-18:00",
    "2025-08-12-18:00",
    "2025-08-19-18:00",
    "2025-08-26-18:00",
    "2025-09-02-18:00",
    "2025-09-09-18:00",
    "2025-09-16-18:00",
    "2025-09-23-18:00",
    "2025-09-30-18:00",
    "2025-10-07-18:00",
    "2025-10-14-18:00",
    "2025-10-21-18:00",
    "2025-10-28-18:00",
    "2025-11-04-18:00",
    "2025-11-11-18:00",
    "2025-11-18-18:00",
    "2025-11-25-18:00",
    "2025-12-02-18:00",
    "2025-12-09-18:00",
    "2025-12-16-18:00"
  ],
  "displayDate": "Tue 22 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night6/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Kicking off at 6pm, gather your crew and come along to two hours of quizzing, with some amazing prizes on offer!\nWith five rounds of big screen trivia, you and your squad will negotiate engaging, relevant and left-field questions that you have a fighting chance to get correct, regardless of your background or how many Masters degrees you have.\nIn addition to the epic trivia, we've got get-up-out-of-your-seat games The Line Up and Last Person Standing to mix things up.\nIf that wasn't good enough, it's Happy Hour between 5:30pm-6:30pm, so come in early to settle in!\nHosted by Malcolm, it's the place to be every Tuesday night!"
},
{
  "id": "Acing The Interview-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Acing The Interview",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100913-897711-34.jpg?v=17",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-09-09:30"
  ],
  "displayDate": "Sat 09 Aug",
  "url": "https://www.eventfinda.co.nz/2025/acing-the-interview2/wellington",
  "source": "Event Finder",
  "eventType": "Business & Networking",
  "description": "Resourceful You - Think 2.\nManaging You - Feel 3.\nBy the end of the course, you’ll be able to: - Manage your thoughts and critical voice under pressure - Visualise and mentally rehearse for success - Recognise your emotional reactions and manage your emotions under pressure - Utilise techniques to manage anxiety - Demonstrate interview skills and deliver well-formed responses to questions - Understand the star model and other communication techniques and how and when to use them Note: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly.\nPresented by Tony Yuile."
},
{
  "id": "Roller Derby - Home Brew Round 2-Kilbirnie Recreation Centre, 101 Kilbirnie Crescent, Kilbirnie, Wellington-Event Finder",
  "name": "Roller Derby - Home Brew Round 2",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103233-898870-35.jpg",
  "venue": "Kilbirnie Recreation Centre, 101 Kilbirnie Crescent, Kilbirnie, Wellington",
  "coordinates": {
    "lat": -41.3161962,
    "long": 174.7947853
  },
  "dates": [
    "2025-07-26-17:00"
  ],
  "displayDate": "Sat 26 Jul",
  "url": "https://www.eventfinda.co.nz/2025/roller-derby-home-brew-round-2/wellington",
  "source": "Event Finder",
  "eventType": "Sports & Fitness",
  "description": "Join us for the next round in our 2025 Home Brew Series where the freshly brewed teams ‘Stone Cold Classics’ and ‘Craft Heads’ go helmet-to-helmet over three action-packed events.\nThis year we celebrate 10 years of partnership between Richter City Roller Derby and the rad crew at Garage Project, who will be slinging brews rink-side.\nEach event will feature a rapid round in which our emerging talent will play a snappy 40 min game, followed by a regulation round where more experienced players will face off in standard derby format.\nSee you at 5pm for rapid round kick off, and 6.30pm for our regulation players to take the track.\nBrace yourself for a jam-packed night!!"
},
{
  "id": "That F**kn Quiz-Shady Lady, 66 Courtenay Plce, Wellington-Event Finder",
  "name": "That F**kn Quiz",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2083350-889826-35.png",
  "venue": "Shady Lady, 66 Courtenay Plce, Wellington",
  "coordinates": {
    "lat": -41.0437313,
    "long": 173.0057194
  },
  "dates": [
    "2025-07-24-19:30",
    "2025-07-31-19:30",
    "2025-08-07-19:30",
    "2025-08-14-19:30",
    "2025-08-21-19:30",
    "2025-08-28-19:30",
    "2025-09-04-19:30",
    "2025-09-11-19:30",
    "2025-09-18-19:30",
    "2025-09-25-19:30"
  ],
  "displayDate": "Thu 24 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/that-f-kn-quiz/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "That F**kn Quiz – The Rudest Quiz in Town!"
},
{
  "id": "Cooking Classes-Sheila's Indian Kitchen, Ashton Fitchett Dr, Wellington-Event Finder",
  "name": "Cooking Classes",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2088954-892458-35.jpg",
  "venue": "Sheila's Indian Kitchen, Ashton Fitchett Dr, Wellington",
  "coordinates": {
    "lat": -41.3056843,
    "long": 174.753222
  },
  "dates": [
    "2025-07-26-18:00",
    "2025-08-26-18:00",
    "2025-09-02-18:00",
    "2025-10-02-18:00",
    "2025-10-09-18:00",
    "2025-11-09-18:00",
    "2025-11-16-18:00",
    "2025-12-16-18:00",
    "2025-12-23-18:00",
    "2026-01-23-18:00",
    "2026-01-30-18:00",
    "2026-03-02-18:00",
    "2026-03-09-18:00",
    "2026-04-09-18:00",
    "2026-04-16-18:00",
    "2026-05-16-18:00",
    "2026-05-23-18:00",
    "2026-06-23-18:00",
    "2026-06-30-18:00",
    "2026-07-07-18:00",
    "2026-07-14-18:00",
    "2026-08-14-18:00"
  ],
  "displayDate": "Sat 26 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/cooking-classes2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Custom made classes available for gluten free, dairy free and any other food intolerance and dietary requirements.The ingredients, recipes, complimentary organic karma drinks will be provided with a full course meal.\nAlso a private cooking classes available.\n3) Roasted eggplant curry, plain whole wheat chapatti or roti, jeera aaloo or potato curry, Tuar dahl (split yellow lentil) and Basmati rice with homemade pickle.\n4) Palak paneer (creamy spinach curry with cubes of paneer), jeera rice (basmati rice with fragrant spices, panjabi chhole or spicy chickpeas curry and mango lassi.\nAlso fresh paneer making."
},
{
  "id": "Quiz Night-Cambridge Hotel, 28 Cambridge Terrace, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064908-881278-34.jpg?v=4",
  "venue": "Cambridge Hotel, 28 Cambridge Terrace, Wellington",
  "coordinates": {
    "lat": -41.2951329,
    "long": 174.7828783
  },
  "dates": [
    "2025-07-23-18:30",
    "2025-07-30-18:30",
    "2025-08-06-18:30",
    "2025-08-13-18:30",
    "2025-08-20-18:30",
    "2025-08-27-18:30",
    "2025-09-03-18:30",
    "2025-09-10-18:30",
    "2025-09-17-18:30",
    "2025-09-24-18:30",
    "2025-10-01-18:30",
    "2025-10-08-18:30",
    "2025-10-15-18:30",
    "2025-10-22-18:30",
    "2025-10-29-18:30",
    "2025-11-05-18:30",
    "2025-11-12-18:30",
    "2025-11-19-18:30",
    "2025-11-26-18:30",
    "2025-12-03-18:30",
    "2025-12-10-18:30",
    "2025-12-17-18:30"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night3/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "It's the famous Worth It Wednesday Quiz Night at The Camby!\nCome down for Wellington’s longest-running quiz, grab some mates and come down for a burger and beer for just $25!\nKicking off at 6.30pm, you and your crew will be flexing your mental clout through five rounds of big screen trivia, the Bonus Baffler, The Line Up and Last Person Standing!\nThere’s a bunch of prizes to be won, so you’ll need to bring your A-game on quiz night to succeed!\nFollow the Facebook pages for updates and new quiz dates for 2025!"
},
{
  "id": "Quiz Night-Duke of Wellington, 29 Waterloo Quay, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064914-881283-35.jpg?v=5",
  "venue": "Duke of Wellington, 29 Waterloo Quay, Wellington",
  "coordinates": {
    "lat": -41.2804175,
    "long": 174.7799666
  },
  "dates": [
    "2025-07-23-18:00",
    "2025-07-30-18:00",
    "2025-08-06-18:00",
    "2025-08-13-18:00",
    "2025-08-20-18:00",
    "2025-08-27-18:00",
    "2025-09-03-18:00",
    "2025-09-10-18:00",
    "2025-09-17-18:00",
    "2025-09-24-18:00",
    "2025-10-01-18:00",
    "2025-10-08-18:00",
    "2025-10-15-18:00",
    "2025-10-22-18:00",
    "2025-10-29-18:00",
    "2025-11-05-18:00",
    "2025-11-12-18:00",
    "2025-11-19-18:00",
    "2025-11-26-18:00",
    "2025-12-03-18:00",
    "2025-12-10-18:00",
    "2025-12-17-18:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night5/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us and Legendary host Sammy Win-Win for the weekly ritual on a Wednesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the delicious food and an incredible vibe, it's the place to be on a Wednesday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 6pm and runs for roughly 2 hours.\nSo, grab your buddies and come on down and join us for one of Wellington's best quiz nights – DoW style!"
},
{
  "id": "Quiz Night-Heyday Beer Co, 264a Cuba St, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064913-881282-35.jpg?v=7",
  "venue": "Heyday Beer Co, 264a Cuba St, Wellington",
  "coordinates": {
    "lat": -41.2966834,
    "long": 174.7734708
  },
  "dates": [
    "2025-07-23-18:30",
    "2025-07-30-18:30",
    "2025-08-06-18:30",
    "2025-08-13-18:30",
    "2025-08-20-18:30",
    "2025-08-27-18:30",
    "2025-09-03-18:30",
    "2025-09-10-18:30",
    "2025-09-17-18:30",
    "2025-09-24-18:30",
    "2025-10-01-18:30",
    "2025-10-08-18:30",
    "2025-10-15-18:30",
    "2025-10-22-18:30",
    "2025-10-29-18:30",
    "2025-11-05-18:30",
    "2025-11-12-18:30",
    "2025-11-19-18:30",
    "2025-11-26-18:30",
    "2025-12-03-18:30",
    "2025-12-10-18:30",
    "2025-12-17-18:30"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night4/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Quiz night is back at Heyday Beer Co. with Welly's own Savage behind the mic!\nWith five rounds of trivia, you and your squad will negotiate engaging, relevant and left-field questions that you have a fighting chance to get correct, regardless of your background or how many Master's degrees you have.\nIn addition to the epic trivia, we've got get-up-out-of-your-seat games The Line Up and Last Person Standing to mix things up.\nIt's the place to be every Wednesday night!\nPet friendly so your four-legged friends are welcome!"
},
{
  "id": "Quiz Night-Blend Bar & Bistro, 7 King Street, Upper Hutt-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064918-881287-34.jpg?v=4",
  "venue": "Blend Bar & Bistro, 7 King Street, Upper Hutt",
  "coordinates": {
    "lat": -41.1232791,
    "long": 175.0747997
  },
  "dates": [
    "2025-07-24-18:30",
    "2025-07-31-18:30",
    "2025-08-07-18:30",
    "2025-08-14-18:30",
    "2025-08-21-18:30",
    "2025-08-28-18:30",
    "2025-09-04-18:30",
    "2025-09-11-18:30",
    "2025-09-18-18:30",
    "2025-09-25-18:30",
    "2025-10-02-18:30",
    "2025-10-09-18:30",
    "2025-10-16-18:30",
    "2025-10-23-18:30",
    "2025-10-30-18:30",
    "2025-11-06-18:30",
    "2025-11-13-18:30",
    "2025-11-20-18:30",
    "2025-11-27-18:30",
    "2025-12-04-18:30",
    "2025-12-11-18:30",
    "2025-12-18-18:30",
    "2026-01-08-18:30",
    "2026-01-15-18:30",
    "2026-01-22-18:30",
    "2026-01-29-18:30",
    "2026-02-05-18:30",
    "2026-02-12-18:30",
    "2026-02-19-18:30",
    "2026-02-26-18:30"
  ],
  "displayDate": "Thu 24 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night/upper-hutt",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us for the weekly ritual on a Thursday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz and your host Tory!\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the mix delicious food and an incredible vibe, it's the place to be on a Thursday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 6.30pm and runs for roughly 2 hours.\nSo, grab your buddies and come on down and join us for one of Upper Hutt's best quiz nights!"
},
{
  "id": "Just B-Club Wairarapa, 20 Essex Street, Masterton, Masterton-Event Finder",
  "name": "Just B",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103147-898837-35.jpg?v=2",
  "venue": "Club Wairarapa, 20 Essex Street, Masterton, Masterton",
  "coordinates": {
    "lat": -40.9505615,
    "long": 175.6568216
  },
  "dates": [
    "2025-07-25-19:30"
  ],
  "displayDate": "Fri 25 Jul",
  "url": "https://www.eventfinda.co.nz/2025/just-b/masterton",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "Just B, from Taranaki, has a wide range of music from classic hits to rock from the 80’s to today that will have you tapping your feet and dancing the night away.\nWhatman Restaurant open from 5.30pm for dinner or a snack.\nMembers, Affiliated Members and their guests welcome."
},
{
  "id": "Transforming Self-Sabotage: FasterEFT Techniques for Effective Change-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Transforming Self-Sabotage: FasterEFT Techniques for Effective Change",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104388-899340-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-14-18:15"
  ],
  "displayDate": "Thu 14 Aug",
  "url": "https://www.eventfinda.co.nz/2025/transforming-self-sabotage-fastereft-techniques-for-effective-change/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "You’ll walk away with a personalised action plan to support real, lasting change.\nThis workshop will help you: •⁠ ⁠Identify your personal self-sabotage patterns and triggers •⁠ ⁠Understand how these patterns affect different areas of your life •⁠ ⁠Recognize the emotional and physiological roots of self-sabotage •⁠ ⁠Learn practical FasterEFT techniques to change sabotaging behaviours •⁠ ⁠Understand the connection between trauma responses and self-sabotaging behaviours Your ticket includes a nourishing plant-based dinner and dessert – come for the insight, stay for the meal shared with like-minded others.\nMeet Krishnaloka, your host Krishnaloka is driven to help others overcome their issues within their mind and pyschology.\nAs a mind technician trained in eutaptics (Faster EFT), she employs the fastest and most powerful method to create lasting change by addressing the root causes of issues rather than just the symptoms.\nHer warm and caring nature makes every interaction with her both comforting and transformative."
},
{
  "id": "Welcome to the Sven's!-Kiwi Hall, 62 Bell Street, Featherston-Event Finder",
  "name": "Welcome to the Sven's!",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103102-898804-34.png?v=2",
  "venue": "Kiwi Hall, 62 Bell Street, Featherston",
  "coordinates": {
    "lat": -41.1157439,
    "long": 175.3286014
  },
  "dates": [
    "2025-08-02-19:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://www.eventfinda.co.nz/2025/welcome-to-the-svens/featherston",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "A rare winter gathering of Wellington chamber pop band the Sven Olsens at the charming Kiwi Hall in Featherston at the beginning of August.\nThere'll be around a dozen of us, band, singers, strings playing for 70 mins.\nWe sing and play lots of songs about some of the more bizarre aspects of life in Aotearoa New Zealand.\nPeople boogie boarding over Huka Falls, getting tasered at the local chicken joint, the resurrection of Kron of Hastings, the once prolific street artist.\nAll on for young and old, all welcome and it's all free."
},
{
  "id": "Guitar - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Guitar - Beginners",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090519-893193-35.jpg?v=21",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-22-17:30"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/guitar-beginners3/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Learn the basic chords, strumming and lots of songs.\nBy the end of the course, you'll have learned how to play simple guitar tunes, using easy tricks the professionals use.\nYou'll be able to: - Demonstrate a number of basic chords - Demonstrate a range of basic strumming patterns - Play a range of simple songs confidently - Demonstrate how to tune a guitar - Demonstrate how to use a capo Bring your own acoustic guitar.\nWellington High School Presented by Will Allardice $125.00 incl.\nGST"
},
{
  "id": "Stargazing 101: Astronomy for Beginners-Space Place at Carter Observatory, 40 Salamanca Rd, Kelburn, Wellington-Event Finder",
  "name": "Stargazing 101: Astronomy for Beginners",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103971-899182-35.jpg?v=9",
  "venue": "Space Place at Carter Observatory, 40 Salamanca Rd, Kelburn, Wellington",
  "coordinates": {
    "lat": -41.2842728,
    "long": 174.7670289
  },
  "dates": [
    "2025-08-13-19:00"
  ],
  "displayDate": "Wed 13 Aug",
  "url": "https://www.eventfinda.co.nz/2025/stargazing-101-astronomy-for-beginners7/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Perfect for anyone interested in the night sky, this two-hour live session under our immersive planetarium dome will guide you through the basics of stargazing: how and why the stars and planets move the way they do; how to find South and other useful markers in the sky; and how to locate your place in space.\nSit back and enjoy being taken on a detailed tour of the night sky with our high-definition laser projectors.\nIncludes: - Intermission with refreshments - Access to Space Place’s galleries and interactive exhibits - 20% discount at Space Place Shop Doors open 6:30pm | Event 7:00pm-9:00pm | Space Place | R16"
},
{
  "id": "Cooking: Homemade Chinese Egg Noodles And Pan-Fried Buns-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Cooking: Homemade Chinese Egg Noodles And Pan-Fried Buns",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100838-897668-35.jpg?v=2",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-26-09:30"
  ],
  "displayDate": "Sat 26 Jul",
  "url": "https://www.eventfinda.co.nz/2025/cooking-homemade-chinese-egg-noodles-and-pan-fried-buns3/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Keen to make your own meat buns but unsure where to start?\nCome and discover how you can easily replicate these delicious specialities at home.\nThe meat buns you create are soft with succulent and juicy meat filling, perfect for a simple breakfast, lunch, or as a snack.\nSome communal ingredients will be supplied but a list of additional ingredients needed will be sent out when course numbers are confirmed.\nBy the end of the course, you’ll be able to: - Make a selection of Chinese egg noodles and buns to take home - Understand more about the Chinese egg noodle-making process - Understand more about the Chinese bun-making process - Feel more confident to make Chinese egg noodles and buns by hand at home Note: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel."
},
{
  "id": "Little Creators-Capital E, 4 Queens Wharf, Wellington-Event Finder",
  "name": "Little Creators",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104232-899311-35.jpg",
  "venue": "Capital E, 4 Queens Wharf, Wellington",
  "coordinates": {
    "lat": -41.2852273,
    "long": 174.7784346
  },
  "dates": [
    "2025-07-24-11:00",
    "2025-07-31-11:00",
    "2025-08-07-11:00",
    "2025-08-14-11:00",
    "2025-08-21-11:00",
    "2025-08-28-11:00",
    "2025-09-04-11:00",
    "2025-09-11-11:00",
    "2025-09-18-11:00"
  ],
  "displayDate": "Thu 24 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/little-creators2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Join us in PlayHQ for these 11am Thursday sessions.\nProfessor Inventus brings science, laughter and chaos to PlayHQ on Thursdays.\nTamariki learn curious concepts about science, nature and the changing seasons.\nBest suits ages 3-5, Science Jam is part of our E Tipu E Rea term-time programme.\nFree, donations appreciated."
},
{
  "id": "Baby Rock & Rhyme-Capital E, 4 Queens Wharf, Wellington-Event Finder",
  "name": "Baby Rock & Rhyme",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104223-899308-35.jpg",
  "venue": "Capital E, 4 Queens Wharf, Wellington",
  "coordinates": {
    "lat": -41.2852273,
    "long": 174.7784346
  },
  "dates": [
    "2025-07-22-11:00",
    "2025-07-29-11:00",
    "2025-08-05-11:00",
    "2025-08-12-11:00",
    "2025-08-19-11:00",
    "2025-08-26-11:00",
    "2025-09-02-11:00",
    "2025-09-09-11:00",
    "2025-09-16-11:00"
  ],
  "displayDate": "Tue 22 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/baby-rock-rhyme/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Join us in PlayHQ for these 11am Tuesday sessions.\nBaby Rock & Rhyme with Wellington City Libraries & Nōku te Ao Capital E. Ideal for babies and tiny tots, Baby Rock & Rhyme is a weekly drop-in programme for you to spend quality time with your baby through rhymes, fingerplays and stories.\nBest suits ages 0-2, Baby Rock & Rhyme is part of our E Tipu E Rea term-time programme.\nFree, donations appreciated.\nPram parking and accessible bathrooms available."
},
{
  "id": "Stitch n B*tch-Southern Cross Garden Bar Restaurant, 39 Abel Smith St, Te Aro, Wellington-Event Finder",
  "name": "Stitch n B*tch",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103242-898876-34.png",
  "venue": "Southern Cross Garden Bar Restaurant, 39 Abel Smith St, Te Aro, Wellington",
  "coordinates": {
    "lat": -41.296484,
    "long": 174.7744171
  },
  "dates": [
    "2025-07-28-18:30",
    "2025-08-04-18:30",
    "2025-08-11-18:30",
    "2025-08-18-18:30",
    "2025-08-25-18:30",
    "2025-09-01-18:30",
    "2025-09-08-18:30",
    "2025-09-15-18:30",
    "2025-09-22-18:30",
    "2025-09-29-18:30",
    "2025-10-06-18:30",
    "2025-10-13-18:30",
    "2025-10-20-18:30",
    "2025-10-27-18:30",
    "2025-11-03-18:30",
    "2025-11-10-18:30",
    "2025-11-17-18:30",
    "2025-11-24-18:30",
    "2025-12-01-18:30",
    "2025-12-08-18:30",
    "2025-12-15-18:30"
  ],
  "displayDate": "Mon 28 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/stitch-b-tch/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Holy Knit Batman!\nIt’s the Southern Cross Yarning Circle!\nNow you can wile away the evening hours, knitting and nattering or flip the script and give Grandma a cardie next Christmas.\nJust bring down some wool and needles, or your preferred stitchcraft.\nCrocheters and other stitchers all welcome."
},
{
  "id": "Quiz Night-Kelburn Village Pub, 87 Upland Rd, Kelburn, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064348-880978-35.png?v=7",
  "venue": "Kelburn Village Pub, 87 Upland Rd, Kelburn, Wellington",
  "coordinates": {
    "lat": -41.2893387,
    "long": 174.7622361
  },
  "dates": [
    "2025-07-22-19:00",
    "2025-07-29-19:00",
    "2025-08-05-19:00",
    "2025-08-12-19:00",
    "2025-08-19-19:00",
    "2025-08-26-19:00",
    "2025-09-02-19:00",
    "2025-09-09-19:00",
    "2025-09-16-19:00",
    "2025-09-23-19:00",
    "2025-09-30-19:00",
    "2025-10-07-19:00",
    "2025-10-14-19:00",
    "2025-10-21-19:00",
    "2025-10-28-19:00",
    "2025-11-04-19:00",
    "2025-11-11-19:00",
    "2025-11-18-19:00",
    "2025-11-25-19:00",
    "2025-12-02-19:00",
    "2025-12-09-19:00",
    "2025-12-16-19:00",
    "2025-12-23-19:00",
    "2025-12-30-19:00",
    "2026-01-06-19:00",
    "2026-01-13-19:00",
    "2026-01-20-19:00",
    "2026-01-27-19:00",
    "2026-02-03-19:00",
    "2026-02-10-19:00"
  ],
  "displayDate": "Tue 22 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night7/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us and legendary host Savage for the weekly ritual on a Tuesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the mix exquisite cocktails, delicious food and an incredible vibe, it's the place to be on a Tuesday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 7pm and runs for roughly 2 hours.\nSo, grab your buddies and come on down and join us for one of Ponsonby’s best quiz nights – KVP style!"
},
{
  "id": "Retirement Reinvented-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Retirement Reinvented",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2081755-889243-35.jpg?v=9",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-16-09:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/retirement-reinvented4/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Whether you’re already retired, or planning ahead, this practical workshop will help you to reflect, re-envision and re-vitalise your life and develop a plan for your future, on your own terms.\n(NZ citizen and residents free with ID, all others pay $109).\nWhat’s next?\nAfter the workshop, you’ll be able to identify a number of common issues and potential ways to manage them when considering and planning your “rejuvenation”, rather than a retirement.\nBy the end of the day, you’ll have: - Developed your own perspective on ageing and retirement in the 21st Century and identified what’s important to you - Completed a personal life audit exercise and considered your strengths - Explored possibilities in the major aspects of your life and identified potential challenges and strategies for overcoming them - Developed a blueprint to maximise the best years of your life and developed a “future proofing” downsizing plan - Considered options to include a sense of purpose and explored and implemented choices that provide you with that sense of purpose Bring a pen and paper."
},
{
  "id": "Te Reo Māori - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Te Reo Māori - Introductory 1",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090522-893194-34.jpg?v=13",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-22-17:30"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/te-reo-maori-introductory-12/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "(NZ Citizens and residents pay $109 with ID, all others pay $199).\nDescription Te Reo Māori - Introductory 1 By the end of the course, you’ll be able to: • Have a basic understanding of the Māori spiritual and natural worlds (mana atua, mana whenua), and our important connections to them • Identify the sounds of Māori letters and pronounce letter combinations using correct intonation and stress patterns • Confidently greet people, introduce yourself and communicate basic personal information in an informal context • Identify and respond to phrases in the classroom including basic commands/instructions • Confidently describe the day/date, time, and the weather NOTE: This course is subsidised with funding from the Tertiary Education Commission (TEC) and you must provide photo ID when you attend your first session, if applicable.\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Retirement Reinvented-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Retirement Reinvented",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2102744-898644-35.jpg?v=10",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-16-09:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/retirement-reinvented5/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Whether you’re already retired, or planning ahead, this practical workshop will help you to reflect, re-envision and re-vitalise your life and develop a plan for your future, on your own terms.\n(NZ citizen and residents free with ID, all others pay $109).\nWhat’s next?\nAfter the workshop, you’ll be able to identify a number of common issues and potential ways to manage them when considering and planning your “rejuvenation”, rather than a retirement.\nBy the end of the day, you’ll have: - Developed your own perspective on ageing and retirement in the 21st Century and identified what’s important to you - Completed a personal life audit exercise and considered your strengths - Explored possibilities in the major aspects of your life and identified potential challenges and strategies for overcoming them - Developed a blueprint to maximise the best years of your life and developed a “future proofing” downsizing plan - Considered options to include a sense of purpose and explored and implemented choices that provide you with that sense of purpose Bring a pen and paper."
},
{
  "id": "Winterlude-The Undercurrent, 118 Tory Street, Wellington-Event Finder",
  "name": "Winterlude",
  "imageUrl": "",
  "venue": "The Undercurrent, 118 Tory Street, Wellington",
  "coordinates": {
    "lat": -41.2960797,
    "long": 174.7795355
  },
  "dates": [
    "2025-08-01-19:00"
  ],
  "displayDate": "Fri 01 Aug",
  "url": "https://www.eventfinda.co.nz/2025/winterlude/wellington",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "We are thrilled to announce… Winterlude: A night of original songs and verse.\nWinterlude is a series of intimate winter concerts involving poets and singers/songwriters.\nThe first of these took place last year in Mana Little Theatre in Plimmerton and at the Coastal Musical Theatre in Kapiti, both to well received sold out shows.\nWe are very excited to be hosting their Wellington debut!\nPerformers are: Barry Saunders (Warratahs) Caroline Easther (with friends) Alan Galloway (with Tatiana Sogrina) Poet Nikki-Lee Birdsey Poet Rebekah Burgess Doors 6:30 pm/Gig 7:00 pm Tickets $25 available on the door and online."
},
{
  "id": "Crime Writing - An Introduction-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Crime Writing - An Introduction",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095693-895447-35.jpg?v=10",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-26-09:30"
  ],
  "displayDate": "Sat 26 Jul",
  "url": "https://www.eventfinda.co.nz/2025/crime-writing-an-introduction2/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Join successful crime author Cat Connor as she shows you where and how!\nBring notebook and pens.\nBy the end of the course, you’ll be able to: Create an outline for a crime novel or short story.\nConstruct characters’ maps and believable characters.\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel."
},
{
  "id": "Quiz Night-7 Bar, 3 King St, Upper Hutt-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064909-881279-35.png?v=4",
  "venue": "7 Bar, 3 King St, Upper Hutt",
  "coordinates": {
    "lat": -41.1236314,
    "long": 175.0748745
  },
  "dates": [
    "2025-07-23-19:00",
    "2025-07-30-19:00",
    "2025-08-06-19:00",
    "2025-08-13-19:00",
    "2025-08-20-19:00",
    "2025-08-27-19:00",
    "2025-09-03-19:00",
    "2025-09-10-19:00",
    "2025-09-17-19:00",
    "2025-09-24-19:00",
    "2025-10-01-19:00",
    "2025-10-08-19:00",
    "2025-10-15-19:00",
    "2025-10-22-19:00",
    "2025-10-29-19:00",
    "2025-11-05-19:00",
    "2025-11-12-19:00",
    "2025-11-19-19:00",
    "2025-11-26-19:00",
    "2025-12-03-19:00",
    "2025-12-10-19:00",
    "2025-12-17-19:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night2/upper-hutt",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us for the weekly ritual on a Wednesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the delicious food and an incredible vibe, it's the place to be on a Wednesday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 7pm and runs for roughly 2 hours.\nSo, grab your buddies and come on down and join us for one of Upper Hutt's best quiz nights – 7 Bar style!"
},
{
  "id": "The Hip-Town Bangers-The Rogue and Vagabond, 18 Garrett St, Wellington-Event Finder",
  "name": "The Hip-Town Bangers",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2099184-896917-35.jpg?v=3",
  "venue": "The Rogue and Vagabond, 18 Garrett St, Wellington",
  "coordinates": {
    "lat": -41.29336,
    "long": 174.7745002
  },
  "dates": [
    "2025-07-31-21:00"
  ],
  "displayDate": "Thu 31 Jul",
  "url": "https://www.eventfinda.co.nz/2025/the-hip-town-bangers2/wellington",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "Wellington's hardest swinging quintet are back for another round at The Rogue and Vagabond.\nLast time was so much fun we just had to go in again!\nFeaturing: Chris Buckland - tenor saxophone Ben Hunt - trumpet Anita Schwabe - piano Emma Hattaway - bass Mike Jensen - drums Music from 9pm - Koha for the band welcome!"
},
{
  "id": "Quiz Night-The Office Cafe and Bar, 124 Riddiford St, Newtown, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064361-880989-34.jpg?v=3",
  "venue": "The Office Cafe and Bar, 124 Riddiford St, Newtown, Wellington",
  "coordinates": {
    "lat": -41.3123147,
    "long": 174.7792263
  },
  "dates": [
    "2025-07-23-19:00",
    "2025-07-30-19:00",
    "2025-08-06-19:00",
    "2025-08-13-19:00",
    "2025-08-20-19:00",
    "2025-08-27-19:00",
    "2025-09-03-19:00",
    "2025-09-10-19:00",
    "2025-09-17-19:00",
    "2025-09-24-19:00",
    "2025-10-01-19:00",
    "2025-10-08-19:00",
    "2025-10-15-19:00",
    "2025-10-22-19:00",
    "2025-10-29-19:00",
    "2025-11-05-19:00",
    "2025-11-12-19:00",
    "2025-11-19-19:00",
    "2025-11-26-19:00",
    "2025-12-03-19:00",
    "2025-12-10-19:00",
    "2025-12-17-19:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night8/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Every Wednesday is trivia night at one of Wellington's most popular quizzes - The Office Bar!\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew!\nSo if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
},
{
  "id": "Zentangle Method - Beginners-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Zentangle Method - Beginners",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100918-897716-35.jpg?v=7",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-16-09:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/zentangle-method-beginners3/wellington",
  "source": "Event Finder",
  "eventType": "Business & Networking",
  "description": "Zentangle method is an easy to learn, relaxing and fun method to create amazing images by drawing structured patterns.\nIn this course you will learn to make beautiful zen-art, following the 8 steps of the Zentangle method from a certified Zentangle teacher.\nDescription The Zentangle method is an easy-to-learn, relaxing and fun method to create amazing images by drawing structured patterns.\nIn this course you will learn to make beautiful art, following the 8 steps of the Zentangle method from a certified Zentangle teacher.\nDiscover your creative side, even if you think you don’t have one."
},
{
  "id": "Storytelling On Stage-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Storytelling On Stage",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090563-893214-35.jpg?v=7",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-22-19:30"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/storytelling-on-stage3/wellington",
  "source": "Event Finder",
  "eventType": "Hobbies & Interests",
  "description": "Do you love storytelling shows like The Moth?\nCome join the growing art of live storytelling.\nDescription Live storytelling is an artform unto itself, requiring different skills and techniques from standup comedy or prose writing.\nIn this four-part workshop, you’ll learn: - Creative writing exercises and daily practices to to find meaningful stories from your life - Tools for crafting a compelling personal narrative - Techniques to build suspense, drama, and humour into your stories - Stagecraft and performance skills to heighten and polish your delivery By the end of the class you'll have - One or more polished 5-10 minute stories to showcase on stage - Dozens of ideas to expand upon for future stories - Writing practices to improve your life as a creative - Less stage fright and more confidence as a speaker Note: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly."
},
{
  "id": "Breathwork: A Journey into Embodied Memory & Inner Truth-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Breathwork: A Journey into Embodied Memory & Inner Truth",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2104385-899339-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-14-18:15"
  ],
  "displayDate": "Thu 14 Aug",
  "url": "https://www.eventfinda.co.nz/2025/breathwork-journey-into-embodied-memory-inner-truth/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Plus - there is an amazing plant-based dinner included in your ticket!\nWhat to Expect Guided Elebreath®️ session (conscious, rhythmic breathing and somatic presence) Embodiment practices to awaken sensory awareness and deepen body connection Intuitive visualization cues and energetic attunement Gentle music and sacred space to support emotional and energetic release Closing prompts for reflection and emotional integration You’ll be gently guided back into your own inner landscape—where truth lives, tension releases, and the nervous system finds a place to land.\nContraindications This session involves intentional breath modulation, somatic awareness, and nervous system stimulation.\nPlease consult a medical professional or get in contact if any of the following apply: Pregnancy (2nd or 3rd trimester especially) History of cardiovascular issues, stroke, or high blood pressure Epilepsy or severe respiratory conditions Diagnosed PTSD, schizophrenia, or other unmanaged mental health conditions Currently taking medications that affect heart rate or nervous system regulation All participants will be guided to listen to their body’s cues.\nAs the founder of Elebreath®️, her work bridges somatic breathwork, nervous system regulation, and energetic mastery with intuitive embodiment and deep manifestation practices."
},
{
  "id": "Inspired: Using Notion for Mindful Productivity-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Inspired: Using Notion for Mindful Productivity",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095953-895560-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-24-18:15"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/inspired-using-notion-for-mindful-productivity/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "This is the perfect 60-minute live workshop where Elebreath®️ meets mindful systems—a space to organize your life and business without slipping into hustle mode.\nWe’ll blend somatic awareness with Notion, the all-in-one tool I use to manage my energy, organize my mind, and create with more ease.\nWhat You’ll Learn: How your nervous system influences focus, clarity, and creative flow How I integrate Elebreath®️ to map my energy before taking action The exact Notion system I use to track tasks, brain dumps, and flow states How to design a dashboard that moves with your body, not against it You’ll Walk Away With: A fully set-up Notion workspace that mirrors your calmest, clearest self A Daily Flow Tracker + Brain Dump Inbox to release the mental clutter Tools to show up consistently—even on low-energy days Included in your ticket: Lifetime access to the free resources like: guided breathwork, fatigue guide, and many more My Notion templates & tracker bundle Bonus PDF: Nervous-System Safe Productivity Rituals An amazing plant-based dinner & dessert!\nThis is productivity with breath, intention, and soul.\nUsing Notion as a soul-aligned system, we co-create space for structure, ease, and clarity—so you can live and work in a way that honors your energy."
},
{
  "id": "Author Alley-Big Mac Slabs Creative Centre, 289 Mazengarb Rd, Paraparaumu-Event Finder",
  "name": "Author Alley",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2098785-896711-35.png",
  "venue": "Big Mac Slabs Creative Centre, 289 Mazengarb Rd, Paraparaumu",
  "coordinates": {
    "lat": -40.8967087,
    "long": 175.0113085
  },
  "dates": [
    "2025-08-10-10:00"
  ],
  "displayDate": "Sun 10 Aug",
  "url": "https://www.eventfinda.co.nz/2025/author-alley/paraparaumu",
  "source": "Event Finder",
  "eventType": "Markets & Fairs",
  "description": "Indulge in a stroll through Bookmark Kāpiti’s very own Author Alley.\nMeet local authors, creatives and service providers within the workshop space of Big Mac Slabs, transformed for one day only in a book-lovers market.\nVenture down to discover your next great read and make connections with others in the industry.\nCome down anytime between 10–3pm.\nStallholders can register interest via our website."
},
{
  "id": "Quiz Night-Parrotdog Bar, 60 - 66 Kingsford Smith St, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064920-881288-35.jpg?v=3",
  "venue": "Parrotdog Bar, 60 - 66 Kingsford Smith St, Wellington",
  "coordinates": {
    "lat": -41.3269451,
    "long": 174.7994714
  },
  "dates": [
    "2025-07-31-18:30",
    "2025-08-14-18:30",
    "2025-08-28-18:30",
    "2025-09-11-18:30",
    "2025-09-25-18:30",
    "2025-10-09-18:30",
    "2025-10-23-18:30",
    "2025-11-06-18:30",
    "2025-11-20-18:30",
    "2025-12-04-18:30",
    "2025-12-18-18:30"
  ],
  "displayDate": "Thu 31 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night2/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us for the fortnightly ritual on a Thursday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the exquisite beers, delicious food and an incredible vibe, it's the place to be on a Thursday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 6.30pm and runs for roughly 2.5 hours.\nSo, grab your buddies and come on down and join us for one of Wellington's best quiz nights – Parrotdog style!"
},
{
  "id": "Cooking: Mumbai Street Food-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Cooking: Mumbai Street Food",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2100915-897713-35.jpg?v=7",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-16-09:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://www.eventfinda.co.nz/2025/cooking-mumbai-street-food/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Take a culinary tour of the streets of Mumbai and learn how to create a range of great Indian foods and snacks.\nAll ingredients provided.\nAll ingredients provided but bring an apron, tea towels and a dish cloth and containers to take any leftovers home.\nWe'll let you know by email so please check yours regularly.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Te Reo Māori - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Te Reo Māori - Introductory 1",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090468-893156-34.jpg?v=13",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-24-18:00"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/te-reo-maori-introductory-1/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "(NZ Citizens and residents pay $109 with ID, all others pay $199).\nDescription Te Reo Māori - Introductory 1 By the end of the course, you’ll be able to: • Have a basic understanding of the Māori spiritual and natural worlds (mana atua, mana whenua), and our important connections to them • Identify the sounds of Māori letters and pronounce letter combinations using correct intonation and stress patterns • Confidently greet people, introduce yourself and communicate basic personal information in an informal context • Identify and respond to phrases in the classroom including basic commands/instructions • Confidently describe the day/date, time, and the weather NOTE: This course is subsidised with funding from the Tertiary Education Commission (TEC) and you must provide photo ID when you attend your first session, if applicable.\nNote: Courses need a minimum number to go ahead so if we don't have enough enrolments a few days before the start date, we have to cancel.\nWe'll let you know by email so please check yours regularly.\nIf you need to cancel your registration, here are our terms and conditions: \"What You Need to Know\"."
},
{
  "id": "Italian - Introductory 1-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Italian - Introductory 1",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2090557-893211-35.jpg?v=3",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-07-22-19:30"
  ],
  "displayDate": "Tue 22 Jul",
  "url": "https://www.eventfinda.co.nz/2025/italian-introductory-1/wellington",
  "source": "Event Finder",
  "eventType": "Education & Learning",
  "description": "For beginners who have no prior knowledge of Italian.\nBy the end of the course, you'll be able to: - Formulate greetings, introductions and other expressions for basic everyday communication - Use the rules of pronunciation - Enquire and reply (formally and informally) about people's names, work situation, origin and family - Recognise the verbs essere (to be) and avere (to have) and use the present tense in basic phrases - Order, offer, accept and refuse food and drink in a cafe at a basic level Presented by Juliana Stroghiu."
},
{
  "id": "Retirement Reinvented-Wellington High School, 249 Taranaki St, Wellington-Event Finder",
  "name": "Retirement Reinvented",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2081754-889242-35.jpg?v=9",
  "venue": "Wellington High School, 249 Taranaki St, Wellington",
  "coordinates": {
    "lat": -41.3002102,
    "long": 174.7751281
  },
  "dates": [
    "2025-08-02-09:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://www.eventfinda.co.nz/2025/retirement-reinvented3/wellington",
  "source": "Event Finder",
  "eventType": "Community & Culture",
  "description": "Whether you’re already retired, or planning ahead, this practical workshop will help you to reflect, re-envision and re-vitalise your life and develop a plan for your future, on your own terms.\n(NZ citizen and residents free with ID, all others pay $109).\nWhat’s next?\nAfter the workshop, you’ll be able to identify a number of common issues and potential ways to manage them when considering and planning your “rejuvenation”, rather than a retirement.\nBy the end of the day, you’ll have: - Developed your own perspective on ageing and retirement in the 21st Century and identified what’s important to you - Completed a personal life audit exercise and considered your strengths - Explored possibilities in the major aspects of your life and identified potential challenges and strategies for overcoming them - Developed a blueprint to maximise the best years of your life and developed a “future proofing” downsizing plan - Considered options to include a sense of purpose and explored and implemented choices that provide you with that sense of purpose Bring a pen and paper."
},
{
  "id": "Peace Over Panic: Rewiring the Anxious Mind-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Peace Over Panic: Rewiring the Anxious Mind",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103033-898757-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-08-19-18:15"
  ],
  "displayDate": "Tue 19 Aug",
  "url": "https://www.eventfinda.co.nz/2025/peace-over-panic-rewiring-the-anxious-mind2/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "How do we respond when the mind spirals, when uncertainty clouds our judgement, or when we find ourselves at a personal breaking point?\nThis workshop draws from ancient and time-tested wisdom found in yoga philosophy — especially the Bhagavad Gita — to explore how anxiety and inner conflict can become turning points for insight and conscious action.\nRather than avoiding or suppressing discomfort, the Gita offers a way to meet it — with clarity, honesty, and meaningful direction.\nThrough a blend of philosophical reflection and grounded tools, we’ll explore how to steady the mind and reconnect with deeper purpose in the face of pressure or doubt.\nMeet your host, Sivananda Sivananda’s background is in both science and music, holding a Master's Degree in Data Science, a Bachelor of Science in Physics and a long history of playing and performing on the double bass."
},
{
  "id": "Quiz Night-Saint Diablo, 25 Courtney Place, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064934-881297-35.jpg?v=2",
  "venue": "Saint Diablo, 25 Courtney Place, Wellington",
  "coordinates": {
    "lat": 46.7676177,
    "long": -92.1550418
  },
  "dates": [
    "2025-07-23-19:00",
    "2025-07-30-19:00",
    "2025-08-06-19:00",
    "2025-08-13-19:00",
    "2025-08-20-19:00",
    "2025-08-27-19:00",
    "2025-09-03-19:00",
    "2025-09-10-19:00",
    "2025-09-17-19:00",
    "2025-09-24-19:00",
    "2025-10-01-19:00",
    "2025-10-08-19:00",
    "2025-10-15-19:00",
    "2025-10-22-19:00",
    "2025-10-29-19:00",
    "2025-11-05-19:00",
    "2025-11-12-19:00",
    "2025-11-19-19:00",
    "2025-11-26-19:00",
    "2025-12-03-19:00",
    "2025-12-10-19:00",
    "2025-12-17-19:00"
  ],
  "displayDate": "Wed 23 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night15/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Every Wednesday is trivia night at one of Wellington's most popular quiz venues - Saint Diablo's!\nKicking off at 7pm, the quiz offers five rounds of big-screen trivia that's not too hard, not too easy, but includes content that relates to you and your crew!\nSo if you've got some street smarts, a good attitude, and a dash of luck, you'll be a good chance on the night.\nAdd to the mix some bonus games, great food & drink, a stack of prizes, great banter and laughs aplenty, it's the place to be on a Wednesday for a rollicking good time!"
},
{
  "id": "Habits Mastery Series: Mindset Reset - Rewire Your Thinking for Growth-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Habits Mastery Series: Mindset Reset - Rewire Your Thinking for Growth",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095962-895566-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-29-18:15"
  ],
  "displayDate": "Tue 29 Jul",
  "url": "https://www.eventfinda.co.nz/2025/habits-mastery-series-mindset-reset-rewire-your-thinking-for-growth/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "It’s a mindset that doesn't serve your purpose.\nJoin us for the next workshop in our Habits Mastery Series: In this interactive 1-hour workshop, you’ll learn: How your beliefs shape your habits and outcomes The difference between a fixed and growth mindset How to shift your internal dialogue and self-image Tools to break limiting beliefs and unlock your potential “Whether you think you can, or you think you can’t — you’re right.” — Henry Ford Walk away with practical tools, inspiring insights, and the motivation to think bigger about your life.\nMeet your host, Nava Nava’s natural interest in studying physics blossomed into metaphysics when she arrived in the land of the long white cloud.\nOriginally from Germany, Nava was travelling on a quest to find purpose and answers to the mysteries of life.\nMesmerized by the depth and broad-mindedness that a yoga lifestyle offers, Nava is keen to share with you that wisdom and love, along with her experiences on the road of life."
},
{
  "id": "Paula Story-Club Wairarapa, 20 Essex Street, Masterton, Masterton-Event Finder",
  "name": "Paula Story",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2103155-898840-35.jpg?v=2",
  "venue": "Club Wairarapa, 20 Essex Street, Masterton, Masterton",
  "coordinates": {
    "lat": -40.9505615,
    "long": 175.6568216
  },
  "dates": [
    "2025-08-08-19:30"
  ],
  "displayDate": "Fri 08 Aug",
  "url": "https://www.eventfinda.co.nz/2025/paula-story2/masterton",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "Let Paula's soulful voice take you on a musical journey.\nShe performs classic rock, old-school rock, rock n roll, pop and disco.\nMembers, Affiliated members and their guests are welcome"
},
{
  "id": "The Warratahs-St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki-Event Finder",
  "name": "The Warratahs",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2096135-895628-35.jpg?v=2",
  "venue": "St Peters Village Hall, Cnr Beach Rd and Ames St, Paekākāriki",
  "coordinates": {
    "lat": -40.9882599,
    "long": 174.9509209
  },
  "dates": [
    "2025-07-27-19:00"
  ],
  "displayDate": "Sun 27 Jul",
  "url": "https://www.eventfinda.co.nz/2025/the-warratahs/paekakariki",
  "source": "Event Finder",
  "eventType": "Music & Concerts",
  "description": "The legendary Warratahs make a welcome return to the village to present their beautiful new album \"Burning Daylight\" along with familiar gems from their previous albums.\nFeaturing Barry Saunders' songs and the band's unique blend of country, rockabilly and folk, these pioneering icons and their renowned crack musicianship never fail to deliver a fantastic show with a rocking night out guaranteed.\n*Tix $40 at www.undertheradar.co.nz (from Monday 23 June) *Text/call 0272584251 for phone bookings *Cash only please for door sales (if any available) *Doors 7pm, show 7.30pm *BYO See less"
},
{
  "id": "Quiz Night-Choice Bros, 62 Ghuznee Street, Wellington-Event Finder",
  "name": "Quiz Night",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2064900-881270-35.png?v=4",
  "venue": "Choice Bros, 62 Ghuznee Street, Wellington",
  "coordinates": {
    "lat": -41.2929676,
    "long": 174.7751326
  },
  "dates": [
    "2025-07-22-19:00",
    "2025-07-29-19:00",
    "2025-08-05-19:00",
    "2025-08-12-19:00",
    "2025-08-19-19:00",
    "2025-08-26-19:00",
    "2025-09-02-19:00",
    "2025-09-09-19:00",
    "2025-09-16-19:00",
    "2025-09-23-19:00",
    "2025-09-30-19:00",
    "2025-10-07-19:00",
    "2025-10-14-19:00",
    "2025-10-21-19:00",
    "2025-10-28-19:00",
    "2025-11-04-19:00",
    "2025-11-11-19:00",
    "2025-11-18-19:00",
    "2025-11-25-19:00",
    "2025-12-02-19:00",
    "2025-12-09-19:00",
    "2025-12-16-19:00"
  ],
  "displayDate": "Tue 22 Jul + more",
  "url": "https://www.eventfinda.co.nz/2025/quiz-night14/wellington",
  "source": "Event Finder",
  "eventType": "Other",
  "description": "Come join us for the weekly ritual on a Tuesday night, where you and your crew will negotiate five rounds of amazing trivia with Gee Quiz.\nYour team's street cred, life smarts and common sense will go a long way to ensuring success on the night.\nAdd to the mix exquisite beers, delicious food and an incredible vibe, it's the place to be on a Tuesday night with plenty of time for laughter, banter and merrymaking!\nThe quiz kicks off at 7pm and runs for roughly 2 hours.\nSo, grab your buddies and come on down and join us for one of Wellington's best quiz nights – Choice Bros style!"
},
{
  "id": "Yin Yoga & Sound Healing-Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington-Event Finder",
  "name": "Yin Yoga & Sound Healing",
  "imageUrl": "https://cdn.eventfinda.co.nz/uploads/events/transformed/2095941-895558-35.jpg",
  "venue": "Bhakti Lounge Wellington, 1st Floor, 175 Vivian Street, Wellington",
  "coordinates": null,
  "dates": [
    "2025-07-24-18:15"
  ],
  "displayDate": "Thu 24 Jul",
  "url": "https://www.eventfinda.co.nz/2025/yin-yoga-sound-healing/wellington",
  "source": "Event Finder",
  "eventType": "Health & Wellness",
  "description": "Yin Yoga & Sound Healing Slow yoga, soothing sounds, and a nourishing plant-based meal—a grounding evening from start to finish.\nTake a pause from the rush and settle into an evening of deep rest and reconnection.\nIt’s a chance to soften, breathe, and listen inward.\nSound healing works on a vibrational level—helping to release tension, restore balance, and bring a sense of inner peace.\nTo close the night, we’ll share a nourishing plant-based dinner and dessert—included in your ticket."
},
]
