[
{
  "id": "Festival of Wheels-10 Uxbridge Street, Renwick 7204, New Zealand-Humanitix",
  "name": "Festival of Wheels",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/qxA1TivUTlqi71jzUW3S",
  "venue": "10 Uxbridge Street, Renwick 7204, New Zealand",
  "coordinates": {
    "lat": -41.5066837,
    "long": 173.8267931
  },
  "dates": [
    "2025-10-19-11:00"
  ],
  "displayDate": "Sun 19 Oct",
  "url": "https://events.humanitix.com/festival-of-wheels?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Other",
  "description": "The Festival of Wheels is a free entry community event for exhibitors to display their wheels. From diggers and tractors through to sports cars and bikes; there will be something for everyone to come and see. Held on the 19th of October 2025 for the first time in over 10 years, we are offering you a chance to become an integral part of our big day out.\nWe are hoping for a fantastic turn out of all things wheels, so enter your wheels for a great family day out!"
},
{
  "id": "Kiwibank business insights: The commercial advantage of sustainability-level 8/20 Customhouse Quay, Te Aro, Wellington 6011, New Zealand-Humanitix",
  "name": "Kiwibank business insights: The commercial advantage of sustainability",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/szOzbTeT4103psVWPQVF",
  "venue": "level 8/20 Customhouse Quay, Te Aro, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.5000831,
    "long": 172.8344077
  },
  "dates": [
    "2025-08-19-17:30"
  ],
  "displayDate": "Tue 19 Aug",
  "url": "https://events.humanitix.com/kiwibank-business-insights-the-commercial-advantage-of-sustainability?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Business & Networking",
  "description": "“ 60% of consumers are now actively investing time and money in brands that do good, while nearly half have dropped products over environmental impact” (Kantar Better Futures 2025) \nDiscover how sustainability can drive profits, reduce costs, and open new markets.\nIn today’s economic climate, businesses are under more pressure than ever to cut costs, stay competitive, and grow revenue. The good news? Embracing sustainability can help you do just that.\nCo-hosted by Kiwibank, WellingtonNZ and the Sustainable Business Network (SBN). At this practical and business-focused event you’ll learn how smart sustainability strategies can help your business thrive. From reducing energy bills by electrifying your operations, to winning new customers by reporting on your emissions, sustainability is no longer just the right thing to do; it’s a commercial advantage.\nWhat to expect:\nInsights from the Sustainable Business Network on the real, bottom-line benefits of sustainability\nA keynote from Mike Casey, Founder of Rewiring Aotearoa, on how electrification is helping Kiwi businesses cut costs and future-proof against rising energy prices\nReal-world examples and tips you can apply now\nThe opportunity to connect with other business leaders tackling the same challenges\nAbout the hosts\nAt Kiwibank, we're proud to be B-Corp certified, joining a global movement of businesses committed to balancing purpose and profit. Sustainability is core to how we operate—from reducing our own carbon footprint to helping Kiwi businesses fund their low-emissions future. We’re investing $2 billion in sustainable finance by 2030 and offering tools to help our customers track and cut their emissions. As a purpose-led bank, we’re here to back businesses that are building a better Aotearoa.\nWellingtonNZ is the Economic Development Agency for the Wellington region, supporting businesses to grow, innovate and thrive. WellingtonNZ is committed to building a sustainable region - supporting initiatives that protect the wellbeing of the people and environment, both now and in the future. \nSBN supports a network of more than 400 organisations working towards a future where people and nature thrive.\n "
},
{
  "id": "Network & Connect: Wellington August-level 16/113 The Terrace, Wellington Central, Wellington 6011, New Zealand-Humanitix",
  "name": "Network & Connect: Wellington August",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/Ito7NFN9SXWU5IVuhHMq",
  "venue": "level 16/113 The Terrace, Wellington Central, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.5000831,
    "long": 172.8344077
  },
  "dates": [
    "2025-08-04-08:30"
  ],
  "displayDate": "Mon 04 Aug",
  "url": "https://events.humanitix.com/network-and-connect-wellington-august?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Business & Networking",
  "description": "It’s time for the Sustainable Business Network Wellington community to get together for our bi-monthly coffee catch-up! \nThis is an SBN investor-only event \nYou’ll have the chance to shout-out about what’s been happening in your organisation and we’ll provide an update on the latest at SBN. As always, this will be a great opportunity to meet other organisations in the network and form new connections in a welcoming and informal setting.\nOur August event will be hosted by Wellington City Council's Climate Change Response Team. \nYou will hear a brief update from the team, including their  biggest carbon emission reduction wins  through supplier engagement. They will also share the results of the Bloomberg-funded Our Changing City project.\nNot an SBN impact investor and want to know about joining the whānau? Please email us at investor@sustainable.org.nz."
},
{
  "id": "Wellington Leadership Group: Leading from Within: Servant Leadership Through the Lens of PTSD Recovery-40 Mercer Street, City, Wellington 6011, New Zealand-Humanitix",
  "name": "Wellington Leadership Group: Leading from Within: Servant Leadership Through the Lens of PTSD Recovery",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/ac4owv4cTaiL3eFXhbCj",
  "venue": "40 Mercer Street, City, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2881783,
    "long": 174.7757454
  },
  "dates": [
    "2025-07-21-17:15"
  ],
  "displayDate": "Mon 21 Jul",
  "url": "https://events.humanitix.com/wellington-leadership-group-leading-from-within-servant-leadership-through-the-lens-of-ptsd-recovery?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Business & Networking",
  "description": "Nick Tomlin’s talk, Leading from Within: Servant Leadership Through the Lens of PTSD Recovery, shares a powerful account of how living with PTSD has deepened his understanding and practice of Servant Leadership. By weaving personal experience with leadership insight, he illustrates how vulnerability, empathy, and resilience are not signs of weakness, but powerful tools for healing and leading authentically.\nThe session encourages leaders to embrace authenticity, support mental well-being, and foster cultures rooted in trust and service. Key points include:\nUnderstanding Servant Leadership and how it differs from traditional authority-driven models\nHarnessing vulnerability to build trust and psychological safety within teams\nSustaining resilience while navigating personal and professional adversity\nCreating supportive cultures where mental health is valued and people can thrive as their full selves\nIt’s a compelling reminder that leadership is not about having all the answers—it’s about leading with heart, especially through the hard chapters.\nAbout Nick Tomlin\nBorn in Kent, England in 1968, [Name] served 25 years across the British Army and Royal Air Force, rising from Combat Medical Technician to Special Forces Commander of the Light Surgical Group. His deployments took him from Northern Ireland to Afghanistan, and he also proudly represented his service in rugby, cricket, and Ironman events.\nFollowing retirement, he became Medical Manager for the London 2012 Olympics before emigrating with his family to New Zealand. Today, he channels his energy into resilience coaching and mental health advocacy, drawing on personal experience after a post-service diagnosis of PTSD.\nWith gratitude for the support of his wife Fay, their two sons, and the SPARTA Project, he now speaks openly about invisible wounds, the power of vulnerability, and his mission to help others find hope and healing—proving that true strength lies not in silence, but in connection.\nAbout Results Coaching\nFounded in 2011, Results Coaching (formerly Setanta Consulting), is one of New Zealand’s fastest growing coaching practices. Our promise is to expand the horizons of our clients measured by observable growth through coaching and training events. As one participant put it, “This is the type of talk I’m looking for at my stage of my career, i.e. focuses on personal development rather than technical skills.”\nPlease Note: We may photograph or record the event for promotion purposes and may reproduce the image of any person who attends for any purpose without payment."
},
{
  "id": "CPD: Mastering Masterspec Specifications WELLINGTON | ⭐ 20 CPD Points-10 Dunlop Terrace, Te Aro, Wellington 6011, New Zealand-Humanitix",
  "name": "CPD: Mastering Masterspec Specifications WELLINGTON | ⭐ 20 CPD Points",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/4sXu6ttQleRPZZNcasbA",
  "venue": "10 Dunlop Terrace, Te Aro, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2953039,
    "long": 174.7752376
  },
  "dates": [
    "2025-08-06-12:00"
  ],
  "displayDate": "Wed 06 Aug",
  "url": "https://events.humanitix.com/cpd-mastering-masterspec-specifications-wellington-or-20-cpd-points-bfmrvtdh?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Business & Networking",
  "description": "⭐ CPD Points: 20\nDescription\nThis CPD course, titled \"Mastering Masterspec Specifications,\" is designed to provide specifiers with comprehensive training on effectively utilising the Masterspec platform for specification writing. Participants will learn the ins and outs of navigating the Masterspec platform, setting up their specifications, managing user accounts, and optimising the use of various features such as Office Masters, MasterKey, and mDocs. The course covers essential topics ranging from basic specification setup to advanced specification management techniques, ensuring participants gain practical skills to streamline their specification writing process.\nDesigned by specifiers for specifiers\nThis course is designed for specifiers, including architects, designers, engineers, and other professionals involved in the construction industry, who are responsible for creating specifications for building projects. Whether you are new to the Masterspec platform or looking to enhance your proficiency in specification writing, this course provides valuable insights and practical skills to optimise your workflow and maximise the benefits of using Masterspec for specification management.\nWhy should specifiers take this course\nSpecifiers should take this course to enhance their proficiency in specification writing and maximise the benefits offered by the Masterspec platform. By mastering the tools and functionalities covered in this course, specifiers can:\nImprove Efficiency: Learn how to navigate the Masterspec website and utilise its features effectively, saving time and effort in specification writing tasks.\nEnsure Accuracy: Gain insights into best practices for setting up specifications, assigning roles, and managing user accounts to maintain data accuracy and consistency.\nEnhance Collaboration: Understand how to collaborate with team members, assign roles, and share specifications seamlessly within the organization, promoting teamwork and productivity.\nStay Updated: Stay abreast of the latest features and updates on the Masterspec platform, ensuring specifiers are equipped with the knowledge to leverage new tools for enhanced specification writing.\nOptimise Workflow: Discover advanced techniques for managing specifications, utilising Office Masters, and integrating with drawing sets using MasterKey, leading to streamlined workflow and project efficiency.\nEnsure Compliance: Learn about NZCIC guidelines and best practices for adding, editing, and exporting guidelines to ensure compliance with industry standards and regulations.\nBoost Professional Development: Acquire valuable skills and knowledge that contribute to professional growth and advancement in the field of specification writing, enhancing career prospects and opportunities."
},
]
