[
{
  "id": "MWDI Māori Businesswomen's Awards 2025-50 Cable Street, Te Aro, Wellington 6011, New Zealand-Humanitix",
  "name": "MWDI Māori Businesswomen's Awards 2025",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/zKt8Npd9TR2LTxSHdB0Z",
  "venue": "50 Cable Street, Te Aro, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2914445,
    "long": 174.7812007
  },
  "dates": [
    "2025-10-24-17:30"
  ],
  "displayDate": "Fri 24 Oct",
  "url": "https://events.humanitix.com/mwdi-maori-businesswomen-s-awards-2025?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Business & Networking",
  "description": "MWDI Māori Businesswomen’s Awards 2025 ✨ Join us for an unforgettable evening celebrating the excellence, innovation, and leadership of kaipakihi wāhine Māori from across Aotearoa.\nThis prestigious event honours the outstanding achievements of wāhine Māori in business who are driving economic growth, uplifting communities, and inspiring the next generation of entrepreneurs.\nBe part of a powerful night filled with celebration, connection, and inspiration as we shine a spotlight on wāhine Māori business excellence on a national and global stage.\nEvent Details Date: Friday, 24 October 2025 Time: 5:30 pm - 11:30 pm Venue: Tākina Wellington Convention & Exhibition Centre Dress Code: Formal / Black Tie / Unapologetically Māori Tickets include a full awards evening experience with event photography, entertainment, three-course dinner 🎟️ & the chance to connect with indigenous business leaders, sponsors, and supporters from around the motu.\n⚠️ Important: R18+ Event Please note: This event is strictly R18+ due to venue health and safety regulations."
},
{
  "id": "VURC Spring Ball 2025-Taranaki Street, Te Aro, Wellington 6011, New Zealand-Humanitix",
  "name": "VURC Spring Ball 2025",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/yE6QcSDRSVKSDIGsMOHt",
  "venue": "Taranaki Street, Te Aro, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2928499,
    "long": 174.778641
  },
  "dates": [
    "2025-09-13-19:00"
  ],
  "displayDate": "Sat 13 Sep",
  "url": "https://events.humanitix.com/vurc-ball-2025?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Food & Drink",
  "description": "This event is 18+ Dust off your dancing shoes — the Victoria University Rowing Club Spring Fundraiser Ball is back!\nJoin us for an unforgettable evening of elegance and celebration on Saturday, 13 September, at the Wellington Rowing Club Function Room.\nEnjoy live music from the incredible Beja Flor, a professional photographer to capture the magic, and a few surprise moments throughout the night (you’ll have to be there to find out!).\nWe’ll have a range of drinks available - both alcoholic and non-alcoholic - alongside a delicious grazing table to keep you fuelled for the dance floor.\nAll proceeds from the night go directly toward supporting the Victoria University Rowing Club - helping fund training, equipment, and competition expenses for the upcoming season."
},
{
  "id": "5 And Still Live ! - The Fifth Anniversary of Mouthfull Radio-level 2/57 Willis Street, Wellington Central, Wellington 6011, New Zealand-Humanitix",
  "name": "5 And Still Live ! - The Fifth Anniversary of Mouthfull Radio",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/wpVyHYnbQOWSb7176kly",
  "venue": "level 2/57 Willis Street, Wellington Central, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2878533,
    "long": 174.775679
  },
  "dates": [
    "2025-08-23-17:30",
    "2025-08-24-01:00"
  ],
  "displayDate": "Sat 23 Aug + more",
  "url": "https://events.humanitix.com/5-and-still-live-the-fifth-anniversary-of-mouthfull-radio?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Music & Concerts",
  "description": "We were also making experimental attempts into the world of radio, with the birth of Mouthfull’s first international streaming server, playing music 24/7 (and live events a few times per week).\nIf we travel even further back in time, 2017 was the debut of the “Mouthfull Radio” episodic series (~20eps) - but we consider the ongoingness the real thing to celebrate.\nIt is a joy to make community contemporary radio !\nThis is a fundraiser to support the sustainability of Mouthfull.\nTHANKS FOR YOUR SUPPORT - you can support us by purchasing a ticket (extra donation if you are balling), a tshirt, a raffle ticket, or a zine - it all goes to the same goal of enabling each other."
},
{
  "id": "The Warratahs-11 Logan Street, Ebdentown, Upper Hutt 5018, New Zealand-Humanitix",
  "name": "The Warratahs",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/mClDzbmIQKmeNmXcwhjP",
  "venue": "11 Logan Street, Ebdentown, Upper Hutt 5018, New Zealand",
  "coordinates": {
    "lat": -41.1223195,
    "long": 175.072091
  },
  "dates": [
    "2025-08-02-19:30"
  ],
  "displayDate": "Sat 02 Aug",
  "url": "https://events.humanitix.com/the-warratahs?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Music & Concerts",
  "description": "The Warratahs Live at the Upper Hutt Cossie Club – Saturday 2nd August After nearly four decades on the road, The Warratahs remain one of New Zealand’s most beloved bands — and now they’re returning to the Upper Hutt Cossie Club for a very special show.\nWith 37 years of touring behind them, The Warratahs have left a deep mark on Kiwi music.\nTheir legacy includes seven studio albums that made the charts, a Tui Music Award for Country Album of the Year in 2017, and performances alongside legends like Johnny Cash & The Highwaymen, Lucinda Williams, and Jackson Browne.\nBarry Saunders’ iconic songwriting is woven into the fabric of the New Zealand songbook, and this is your chance to witness the band at their best.\nBorn out of a simple love for playing music with mates down at the pub, The Warratahs first hit the stage at The Cricketers’ Arms in Wellington in 1986 — never imagining they’d become a national treasure."
},
{
  "id": "The Wedding of Liesl and Duncan-75 Taranaki Street, Te Aro, Wellington 6011, New Zealand-Humanitix",
  "name": "The Wedding of Liesl and Duncan",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/jazGuOcTtSkFMdft2OEC",
  "venue": "75 Taranaki Street, Te Aro, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2937001,
    "long": 174.7787215
  },
  "dates": [
    "2025-08-16-19:30"
  ],
  "displayDate": "Sat 16 Aug",
  "url": "https://events.humanitix.com/the-wedding-of-liesl-and-duncan?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Arts & Theatre",
  "description": "You are cordially invited to the most dramatic, musical, and slightly chaotic wedding of the season!\nA rom-com featuring Brahms' Liebeslieder Walzer, and other wonderful German music by Brahms, Schubert and Haydn.\nSaturday 16th August, 2025, 7.30pm Wesley Methodist, 75 Taranaki St, Wellington Duncan - Robert Tucker (Baritone) Liesl- Barbara Paterson (Soprano) Musical director - Maaike Christie-Beekman Written and directed by Jacqueline Coats Piano Heather Easting and Emma Sayers Nota Bene Chamber Choir Keep an eye on our social media, website and email for more details and RSVP's (ticket sales).\nWe'll keep you updated as well.\nwww.notabene.org.nz notabenenz@gmail.com https://www.facebook.com/notabenenz/#"
},
{
  "id": "5 days Figure Sculpting workshop with model-41 Percy Cameron Street, Avalon, Lower Hutt 5011, New Zealand-Humanitix",
  "name": "5 days Figure Sculpting workshop with model",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/lSZH0OtTkIdaw55U1UTg",
  "venue": "41 Percy Cameron Street, Avalon, Lower Hutt 5011, New Zealand",
  "coordinates": {
    "lat": -41.1871052,
    "long": 174.946687
  },
  "dates": [
    "2025-12-03-00:00",
    "2025-12-07-17:00"
  ],
  "displayDate": "Wed 03 Dec + more",
  "url": "https://events.humanitix.com/5-days-figure-sculpting-workshop-with-model?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Arts & Theatre",
  "description": "The immediacy of the model’s presence encourages close observation and instinctive decision-making, leading to work that is expressive and real.\nThis hands-on interaction brings a sense of movement and authenticity that’s hard to achieve otherwise.\nFrom there, the artist refines the shapes focusing on anatomical accuracy and expressive detail that give the sculpture its final character.\nPlease visit this LINK to know more about the event.\nArmature is supplied during the workshop."
},
{
  "id": "After Austen: Em-2/57 Willis Street, Wellington Central, Wellington 6011, New Zealand-Humanitix",
  "name": "After Austen: Em",
  "imageUrl": "https://cdn.filestackcontent.com/cache=expiry:max/resize=width:1600/output=format:webp,quality:40/compress/EzKqPyiGTpG6jQg7bEaP",
  "venue": "2/57 Willis Street, Wellington Central, Wellington 6011, New Zealand",
  "coordinates": {
    "lat": -41.2865637,
    "long": 174.7761865
  },
  "dates": [
    "2025-07-26-14:30"
  ],
  "displayDate": "Sat 26 Jul",
  "url": "https://events.humanitix.com/after-austen-em?hxchl=mkt-sch",
  "source": "Humanitix",
  "eventType": "Other",
  "description": "Emmett Woodhouse, handsome, clever and rich, with a comfortable home and a gay disposition has lived nearly [redacted] years in the world with very little to distress or vex him.\nAttendees get an exclusive 10% discount at Unity Books Bring a friend: purchase 2 or more tickets and get a 10% discount Sam Brooks is an award-winning and prolific playwright and journalist, who is largely noted for his critically acclaimed LGBTQ+ work, including Riding in Cars with (Mostly Straight) Boys, Queen, and most recently This is My Story of Us, which was co-winner of the 2024 Adam New Zealand Play Award.\nHe has been shortlisted multiple years for the Adam New Zealand Play Award, and won the Dean Parker award in 2023.\nWho this event is for: People who love Austen People who love the theatre Fans of Sam's work Writers Actors Directors Afternoon tea provided (If you have issues paying via credit card you can pay via invoice or contact us - this should be fixed now) FAQs Do I need to know about Jane Austen?\nWe want you to be there and we want you to be comfortable."
},
]
