{
  "events": [
    {
      "id": "IFF - Comandante-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Comandante",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_57564ce9-2244-4b2f-8ef1-5bcd7fa1944c.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-13-20:30"
      ],
      "displayDate": "Sat 13 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-commandante",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- The true story of Comandante Salvatore Todaro, Captain of an Italian Royal Navy submarine. When Todaro sinks an enemy ship, he reaches a decision that is destined to make history: putting his crew at huge risk he decides to rescue the 26 survivors. ---\n\nItalian, English subtitles",
      "description": "Details --- The true story of Comandante Salvatore Todaro, Captain of an Italian Royal Navy submarine.\nWhen Todaro sinks an enemy ship, he reaches a decision that is destined to make history: putting his crew at huge risk he decides to rescue the 26 survivors.\n--- Italian, English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Gloria!-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Gloria!",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_b2620b5c-1226-4f74-aa89-834069f0801f.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-12-10:30",
        "2025-12-14-10:30"
      ],
      "displayDate": "Fri 12 Dec + more",
      "url": "https://www.roxycinema.co.nz/movie/iff-gloria",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- Gloria! tells the story of Teresa, a young woman with a visionary talent who, together with a small group of extraordinary musicians, crosses centuries and challenges the dusty old world of classical music by inventing rebellious, modern music. ---\n\nItalian with English subtitles",
      "description": "Details --- Gloria!\ntells the story of Teresa, a young woman with a visionary talent who, together with a small group of extraordinary musicians, crosses centuries and challenges the dusty old world of classical music by inventing rebellious, modern music.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Il Boemo-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Il Boemo",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_497135cd-4558-44cd-9efe-80ed90e8d42f.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-14-12:45"
      ],
      "displayDate": "Sun 14 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-il-boemo",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- The extraordinary and unknown story of Josef Myslivecek -\"Il Boemo\"-one of the most prolific opera composers in 18th century Italy, who was a friend and inspiration to Mozart. He was sought after by the courts of Naples and Venice, while his love life was inextricably entwined with his Musical brilliance. ---\n\nItalian, Czech, French, German",
      "description": "Details --- The extraordinary and unknown story of Josef Myslivecek -\"Il Boemo\"-one of the most prolific opera composers in 18th century Italy, who was a friend and inspiration to Mozart.\nHe was sought after by the courts of Naples and Venice, while his love life was inextricably entwined with his Musical brilliance.\n--- Italian, Czech, French, German",
      "labels": []
    },
    {
      "id": "IFF - Il Postino-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Il Postino",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_a1baea50-19aa-42b8-8a81-019bed4401aa.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-14-10:30"
      ],
      "displayDate": "Sun 14 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-il-postino",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- When Nobel Prize-winning Chilean poet Pablo Neruda is exiled to the island of Procida, he captures the attention of the local postman, Mario. The power of language and poetry opens Mario’s mind and expands his horizons, and soon, he wishes to use the newly discovered power of words to woo the beautiful Beatrice. ---\n\nItalian, Spanish",
      "description": "Details --- When Nobel Prize-winning Chilean poet Pablo Neruda is exiled to the island of Procida, he captures the attention of the local postman, Mario.\nThe power of language and poetry opens Mario’s mind and expands his horizons, and soon, he wishes to use the newly discovered power of words to woo the beautiful Beatrice.\n--- Italian, Spanish",
      "labels": []
    },
    {
      "id": "IFF - In the Mirror-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - In the Mirror",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_a107f61f-922a-4e2d-9d70-1431cb0b29a7.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-14-18:00"
      ],
      "displayDate": "Sun 14 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-in-the-mirror",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- When Monica loses her memory, she creates meaning in her life by identifying with the characters from films of the Golden Age of Italian cinema. In an act of love, Edoardo indulges her imagination, allowing it to become their new life. ---\n\nItalian with English subtitles",
      "description": "Details --- When Monica loses her memory, she creates meaning in her life by identifying with the characters from films of the Golden Age of Italian cinema.\nIn an act of love, Edoardo indulges her imagination, allowing it to become their new life.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - L'immensità-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - L'immensità",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_fb50e7b2-1eb2-41b3-9cd6-172a146da49c.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-12-13:00"
      ],
      "displayDate": "Fri 12 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-limmensit",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- In one volatile summer in the 1970’s, Andrea and her family move into a stylish new apartment on the outskirts of Rome. As her marriage breaks down, she is formidable in keeping things buoyant, but Andrea begins to reject her identity and gender, deciding to live like a boy. ---\n\nItalian with English subtitles",
      "description": "Details --- In one volatile summer in the 1970’s, Andrea and her family move into a stylish new apartment on the outskirts of Rome.\nAs her marriage breaks down, she is formidable in keeping things buoyant, but Andrea begins to reject her identity and gender, deciding to live like a boy.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Maria Montessori-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Maria Montessori",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_ba42363f-fbcf-4ab3-a763-24366fd88c87.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-13-10:30"
      ],
      "displayDate": "Sat 13 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-maria-montessori",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- A glamorous Parisian actress flees to Rome to protect her reputation and hide her daughter's learning disability. There, she meets Maria Montessori, a brilliant doctor who is developing a methodology for non-conventional children, but Maria has a secret of her own. ---\n\nItalian and French",
      "description": "Details --- A glamorous Parisian actress flees to Rome to protect her reputation and hide her daughter's learning disability.\nThere, she meets Maria Montessori, a brilliant doctor who is developing a methodology for non-conventional children, but Maria has a secret of her own.\n--- Italian and French",
      "labels": []
    },
    {
      "id": "IFF - Parthenope-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Parthenope",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_eafe542a-1846-44a4-ba44-95b7e3d9d0a9.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-12-18:00"
      ],
      "displayDate": "Fri 12 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-parthenope",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- Parthenope was the mythical Siren who founded Naples. We follow the beautiful woman who bears the name of her city on a decades-long journey searching for happiness during the long summers of her youth, falling in love and meeting the many memorable characters as she becomes a formidable woman. ---\n\nItalian with English subtitles",
      "description": "Details --- Parthenope was the mythical Siren who founded Naples.\nWe follow the beautiful woman who bears the name of her city on a decades-long journey searching for happiness during the long summers of her youth, falling in love and meeting the many memorable characters as she becomes a formidable woman.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Trust-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Trust",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_1b018d12-ea4b-4cc8-8289-cec2a3de9734.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-12-15:15"
      ],
      "displayDate": "Fri 12 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-trust",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- Pietro, a revered teacher, and Teresa, his brilliant student, embark on an illicit and tempestuous affair. One night, while playing a game of trust and sharing, Pietro reveals a secret so shocking that it could destroy his life. ---\n\nItalian with English subtitles",
      "description": "Details --- Pietro, a revered teacher, and Teresa, his brilliant student, embark on an illicit and tempestuous affair.\nOne night, while playing a game of trust and sharing, Pietro reveals a secret so shocking that it could destroy his life.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Vermiglio-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Vermiglio",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_59cbe1e5-3610-4ec8-bbfa-ea9d7a8df952.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-13-18:00"
      ],
      "displayDate": "Sat 13 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-vermiglio",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- When a handsome Sicilian deserter arrives at the remote village of Vermiglio high in the snowy Alps of Alto Adige in the last year of WWII, he disrupts the ancient balance of village life. Lucia, the eldest daughter of the Graziadeis family, falls for him, with consequences that will affect everyone in unexpected ways. ---",
      "description": "Details --- When a handsome Sicilian deserter arrives at the remote village of Vermiglio high in the snowy Alps of Alto Adige in the last year of WWII, he disrupts the ancient balance of village life.\nLucia, the eldest daughter of the Graziadeis family, falls for him, with consequences that will affect everyone in unexpected ways.\n---",
      "labels": []
    },
    {
      "id": "IFF - Welcome to the South-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Welcome to the South",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_1d43fad2-5893-45e9-9f51-27381f151a4e.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-13-12:25"
      ],
      "displayDate": "Sat 13 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-welcome-to-the-south",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- A postal employee from northern Italy feigns a disability to get a transfer, but when he is caught, he is sent to a tiny village near Naples as punishment. Bringing all his prejudices, stereotypes, and fears about the South, he finds something different from what he was expecting. ---\n\nItalian with English subtitles",
      "description": "Details --- A postal employee from northern Italy feigns a disability to get a transfer, but when he is caught, he is sent to a tiny village near Naples as punishment.\nBringing all his prejudices, stereotypes, and fears about the South, he finds something different from what he was expecting.\n--- Italian with English subtitles",
      "labels": []
    },
    {
      "id": "IFF - Youth-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "IFF - Youth",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_2f5e40b3-24d1-4377-87e5-ae251955a567.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-12-14-15:30"
      ],
      "displayDate": "Sun 14 Dec",
      "url": "https://www.roxycinema.co.nz/movie/iff-youth",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\n--- Retired orchestra conductor Fred Ballinger is on vacation with his daughter Lena and his film director best friend Mick Boyle in a glamorous Swiss Alpine resort. When he receives an invitation from Queen Elizabeth II to perform for Prince Philip's birthday, much to everyone’s surprise, he refuses. ---\n\nIn English",
      "description": "Details --- Retired orchestra conductor Fred Ballinger is on vacation with his daughter Lena and his film director best friend Mick Boyle in a glamorous Swiss Alpine resort.\nWhen he receives an invitation from Queen Elizabeth II to perform for Prince Philip's birthday, much to everyone’s surprise, he refuses.\n--- In English",
      "labels": []
    }
  ]
}