{
  "events": [
    {
      "id": "JFF - Love At Least-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "JFF - Love At Least",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_6350c4fb-4f1e-4b4e-9aa2-b252ac2f7f5d.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-09-28-13:00"
      ],
      "displayDate": "Sun 28 Sep",
      "url": "https://www.roxycinema.co.nz/movie/jff-love-at-least",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Kosai Sekine\nA romance film based on a novel by Akutagawa Prizewinner Motoya Yukiko and the feature debut of director Sekine Kosai, exploring the complexities of love when one partner lives with a severe illness.\n\n--- Yasuko (Shuri), suffering from depression and isolation, lives with her indifferent boyfriend Tsunaki (Suda Masaki). When his ex-girlfriend Ando (Naka Riisa) reappears, tensions rise as she pushes Yasuko to rejoin society—and tries to break them up. ---\n\nIn Japanese with English Subtitles",
      "description": "Details Directed by Kosai Sekine A romance film based on a novel by Akutagawa Prizewinner Motoya Yukiko and the feature debut of director Sekine Kosai, exploring the complexities of love when one partner lives with a severe illness.\n--- Yasuko (Shuri), suffering from depression and isolation, lives with her indifferent boyfriend Tsunaki (Suda Masaki).\nWhen his ex-girlfriend Ando (Naka Riisa) reappears, tensions rise as she pushes Yasuko to rejoin society—and tries to break them up.\n--- In Japanese with English Subtitles"
    },
    {
      "id": "JFF - On-Gaku: Our Sound-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "JFF - On-Gaku: Our Sound",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_e65b6d27-ed20-4b50-a453-8644ea3dfd85.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-09-28-11:00"
      ],
      "displayDate": "Sun 28 Sep",
      "url": "https://www.roxycinema.co.nz/movie/jff-on-gaku-our-sound",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Kenji Iwaisawa\nA deadpan, offbeat animated comedy about three high school delinquents who pick up instruments on a whim, discovering an unexpected and unpolished passion for making music.\n\n--- High school delinquent Kenji convinces his friends Ota and Asakura to start a band — despite none of them having any musical experience. With two basses and drums, they form a unique trio and are unexpectedly moved by the sound they create. Naming themselves Kobujutsu, they soon discover a school folk group called Kobijutsu. Despite their contrasting styles, the two bands bond over music and set their sights on an upcoming rock festival in August. ---\n\nIn Japanese with English subtitles",
      "description": "Details Directed by Kenji Iwaisawa A deadpan, offbeat animated comedy about three high school delinquents who pick up instruments on a whim, discovering an unexpected and unpolished passion for making music.\n--- High school delinquent Kenji convinces his friends Ota and Asakura to start a band — despite none of them having any musical experience.\nWith two basses and drums, they form a unique trio and are unexpectedly moved by the sound they create.\nNaming themselves Kobujutsu, they soon discover a school folk group called Kobijutsu.\nDespite their contrasting styles, the two bands bond over music and set their sights on an upcoming rock festival in August."
    }
  ]
}