[
  {
    "id": "JFF - Love At Least-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - Love At Least",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-28-00:00"
    ],
    "displayDate": "Sun 28 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-love-at-least",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Kosai Sekine\nA romance film based on a novel by Akutagawa Prizewinner Motoya Yukiko and the feature debut of director Sekine Kosai, exploring the complexities of love when one partner lives with a severe illness.\n\n--- Yasuko (Shuri), suffering from depression and isolation, lives with her indifferent boyfriend Tsunaki (Suda Masaki). When his ex-girlfriend Ando (Naka Riisa) reappears, tensions rise as she pushes Yasuko to rejoin society—and tries to break them up. ---\n\nIn Japanese with English Subtitles",
    "description": "Details Directed by Kosai Sekine A romance film based on a novel by Akutagawa Prizewinner Motoya Yukiko and the feature debut of director Sekine Kosai, exploring the complexities of love when one partner lives with a severe illness.\n--- Yasuko (Shuri), suffering from depression and isolation, lives with her indifferent boyfriend Tsunaki (Suda Masaki).\nWhen his ex-girlfriend Ando (Naka Riisa) reappears, tensions rise as she pushes Yasuko to rejoin society—and tries to break them up.\n--- In Japanese with English Subtitles"
  },
  {
    "id": "JFF - I Am What I Am-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - I Am What I Am",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-i-am-what-i-am",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Shinya Tamada\nA heartfelt story about self-identity and acceptance, following a young adult discovering their voice and individuality through dance.\n\n--- Kasumi, who has never felt romantic or sexual attraction, faces pressure to marry at 30. After a failed relationship with a man who develops feelings, she reconnects with Maho, a former classmate. Their bond grows, but Maho decides to marry. As their paths diverge, Kasumi must decide what it means to live authentically — on her own terms. ---\n\nIn Japanese with English Subtitles",
    "description": "Details Directed by Shinya Tamada A heartfelt story about self-identity and acceptance, following a young adult discovering their voice and individuality through dance.\n--- Kasumi, who has never felt romantic or sexual attraction, faces pressure to marry at 30.\nAfter a failed relationship with a man who develops feelings, she reconnects with Maho, a former classmate.\nTheir bond grows, but Maho decides to marry.\nAs their paths diverge, Kasumi must decide what it means to live authentically — on her own terms."
  },
  {
    "id": "JFF - Hit Me Anyone One More Time-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - Hit Me Anyone One More Time",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-hit-me-anyone-one-more-time",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Kôki Mitani\nA sharp political comedy that follows a bumbling prime minister's journey of self-discovery after a sudden bout of amnesia, delivering both laughs and light social commentary.\n\n--- A man wakes up with amnesia and discovers he is the Prime Minister of Japan — widely hated and dubbed the worst in history. As he hides his memory loss with help from his secretaries, he navigates scandals, blackmail, a crumbling family, and an impending U.S. presidential visit. With nothing to lose, he rediscovers his ideals and shakes up the nation. ---\n\nIn Japanese with English subtitles",
    "description": "Details Directed by Kôki Mitani A sharp political comedy that follows a bumbling prime minister's journey of self-discovery after a sudden bout of amnesia, delivering both laughs and light social commentary.\n--- A man wakes up with amnesia and discovers he is the Prime Minister of Japan — widely hated and dubbed the worst in history.\nAs he hides his memory loss with help from his secretaries, he navigates scandals, blackmail, a crumbling family, and an impending U.S. presidential visit.\nWith nothing to lose, he rediscovers his ideals and shakes up the nation.\n--- In Japanese with English subtitles"
  },
  {
    "id": "JFF - The Nighthawk's First Love-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - The Nighthawk's First Love",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-the-nighthawks-first-love",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Yûka Yasukawa\nA poetic adaptation of Kenji Miyazawa's classic story, capturing the quiet yearning and bittersweet emotions of a solitary nighthawk who dares to dream of love beyond his reach.\n\n---Aiko Maeda (Rena Matsui), a science student with a birthmark on her face, has avoided love and fun since childhood due to teasing. Focused only on research, her life changes when she's interviewed for a book about people with facial marks. The book becomes a film, and through her friend Marie (Risa Oda), Aiko meets director Tobisaka (Ayumu Nakajima). As her feelings for him grow, Aiko is forced to confront her long-held insecurities. ---\n\nIn Japanese with English subtitles",
    "description": "Details Directed by Yûka Yasukawa A poetic adaptation of Kenji Miyazawa's classic story, capturing the quiet yearning and bittersweet emotions of a solitary nighthawk who dares to dream of love beyond his reach.\n---Aiko Maeda (Rena Matsui), a science student with a birthmark on her face, has avoided love and fun since childhood due to teasing.\nFocused only on research, her life changes when she's interviewed for a book about people with facial marks.\nThe book becomes a film, and through her friend Marie (Risa Oda), Aiko meets director Tobisaka (Ayumu Nakajima).\nAs her feelings for him grow, Aiko is forced to confront her long-held insecurities."
  },
  {
    "id": "JFF - On-Gaku: Our Sound-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - On-Gaku: Our Sound",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-28-00:00"
    ],
    "displayDate": "Sun 28 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-on-gaku-our-sound",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Kenji Iwaisawa\nA deadpan, offbeat animated comedy about three high school delinquents who pick up instruments on a whim, discovering an unexpected and unpolished passion for making music.\n\n--- High school delinquent Kenji convinces his friends Ota and Asakura to start a band — despite none of them having any musical experience. With two basses and drums, they form a unique trio and are unexpectedly moved by the sound they create. Naming themselves Kobujutsu, they soon discover a school folk group called Kobijutsu. Despite their contrasting styles, the two bands bond over music and set their sights on an upcoming rock festival in August. ---\n\nIn Japanese with English subtitles",
    "description": "Details Directed by Kenji Iwaisawa A deadpan, offbeat animated comedy about three high school delinquents who pick up instruments on a whim, discovering an unexpected and unpolished passion for making music.\n--- High school delinquent Kenji convinces his friends Ota and Asakura to start a band — despite none of them having any musical experience.\nWith two basses and drums, they form a unique trio and are unexpectedly moved by the sound they create.\nNaming themselves Kobujutsu, they soon discover a school folk group called Kobijutsu.\nDespite their contrasting styles, the two bands bond over music and set their sights on an upcoming rock festival in August."
  },
  {
    "id": "JFF - What Did You Eat Yesterday?-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
    "name": "JFF - What Did You Eat Yesterday?",
    "imageUrl": null,
    "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
    "coordinates": {
      "lat": -41.3158511,
      "long": 174.816259
    },
    "dates": [
      "2025-09-26-00:00"
    ],
    "displayDate": "Fri 26 Sep",
    "url": "https://www.roxycinema.co.nz/movie/jff-what-did-you-eat-yesterday",
    "source": "Roxy Cinema",
    "eventType": "Film & Media",
    "long_description": "Details\nDirected by Kazuhito Nakae\nA gentle, heartwarming Japanese drama that blends food, love, and everyday life, exploring the quiet rhythms of a middle-aged couple's relationship with warmth and humor.\n\n--- Shiro, a lawyer, and Kenji, a hairdresser, are a couple who cherish their quiet daily life together. A trip to Kyoto for Kenji's birthday stirs emotional distance, especially after Shiro sees Kenji with a mysterious young man. As tensions rise, they face the fragility of their once peaceful life—and question whether they can return to it. ---\n\nIn Japanese with English subtitles",
    "description": "Details Directed by Kazuhito Nakae A gentle, heartwarming Japanese drama that blends food, love, and everyday life, exploring the quiet rhythms of a middle-aged couple's relationship with warmth and humor.\n--- Shiro, a lawyer, and Kenji, a hairdresser, are a couple who cherish their quiet daily life together.\nA trip to Kyoto for Kenji's birthday stirs emotional distance, especially after Shiro sees Kenji with a mysterious young man.\nAs tensions rise, they face the fragility of their once peaceful life—and question whether they can return to it.\n--- In Japanese with English subtitles"
  }
]