{
  "events": [
    {
      "id": "TFi - Blind Panic-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Blind Panic",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_3c337a76-51c0-4d3a-a642-36543bbb12b8.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-31-18:15"
      ],
      "displayDate": "Fri 31 Oct",
      "url": "https://www.roxycinema.co.nz/movie/tfi-blind-panic",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Mark Willis\nStarring Ralph Johnson, Erroll Shand, Jodie Hillock, Simon Phillips\nWorld Premiere + Q&A\n\nThis homegrown gem is a love letter to crime thrillers, keeping you on the edge of your seat all the way.\n\nBe the first in the world to see this Terror-Fi exclusive! This screening will be followed by a special Q&A.\n\n-- It is 1992. Louis is released on home detention after serving six years for his involvement in a botched heist. Trapped in suburbia, he fears he is now a sitting duck with his psychotic ex-boss, Prescott, on the hunt for some missing money, and the person responsible. A few doors away lives Madeleine, a blind woman, once vibrant and outgoing, but now fearful even to step out the front door. As Madeleine takes her first steps to re-connect with the outside world, she meets her new neighbour. Though nervous around new people, and oblivious to Louis’ circumstances, a friendship develops. A heat wave engulfs the neighbourhood, and things heat up between the two. But Madeleine soon finds herself caught up in Louis’ past, and in an impossible predicament: Bound, gagged and alone, while Prescott draws closer and closer... --",
      "description": "Be the first in the world to see this Terror-Fi exclusive!\nThis screening will be followed by a special Q&A.\n-- It is 1992.\nLouis is released on home detention after serving six years for his involvement in a botched heist.\nTrapped in suburbia, he fears he is now a sitting duck with his psychotic ex-boss, Prescott, on the hunt for some missing money, and the person responsible."
    },
    {
      "id": "TFi - Bugonia-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Bugonia",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_183740f2-0607-4056-b84f-bafc2c174301.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-29-18:30"
      ],
      "displayDate": "Wed 29 Oct",
      "url": "https://www.roxycinema.co.nz/movie/tfi-bugonia",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Yorgos Lanthimos\nStarring Emma Stone, Jesse Plemons, Aidan Delbis\nFirst Public Screening – Opening Night\n\nThe new masterpiece from Yorgos Lanthimos opens Terror-Fi 2025. 90% on Rotten Tomatoes and best enjoyed in a cinema full of people!\n\n\"...you’ll find much to enjoy in the heightened performances, pitch-black humor, bursts of gory violence, and bizarre twists, including a mind-melting final sequence.\" - Radhika Seth, Vogue\n\n-- Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.--\n\nFestivals: Venice 25, Beyond Fest 25",
      "description": "Details Directed by Yorgos Lanthimos Starring Emma Stone, Jesse Plemons, Aidan Delbis First Public Screening – Opening Night The new masterpiece from Yorgos Lanthimos opens Terror-Fi 2025.\n90% on Rotten Tomatoes and best enjoyed in a cinema full of people!\n\"...you’ll find much to enjoy in the heightened performances, pitch-black humor, bursts of gory violence, and bizarre twists, including a mind-melting final sequence.\"\n- Radhika Seth, Vogue -- Two conspiracy obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.-- Festivals: Venice 25, Beyond Fest 25"
    },
    {
      "id": "TFi - Deathgasm II: Goremageddon-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Deathgasm II: Goremageddon",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_8faf88cc-c7c7-4b94-874a-816a2c56d230.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-31-20:30"
      ],
      "displayDate": "Fri 31 Oct",
      "url": "https://www.roxycinema.co.nz/movie/tfi-deathgasm-ii-goremageddon",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Jason Lei Howden\nStarring Milo Cawthorne, Kimberley Crossman, Joshua Blake\nNZ Premiere + Q&A\n\nThe sequel to the cult Kiwi splatter-metal classic is finally here! Let's enjoy the blood-soaked carnage together. We'll crank this one up to 11 for ya!\n\n\"...brings the metal, drowns viewers in spectacularly sloppy violence, and does so with a mischievous smile.\" - Matt Donato, Daily Dread\n\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- Brodie is washed-up, broke, and stuck in small-town purgatory. But when he learns that 'NoizeQuest', a battle-of-the-bands competition is coming to his town, he sees a shot at redemption - and maybe even a second chance with Medina. One problem: his drummer is missing an arm, and the rest of his band is, well... dead. Luckily, Brodie still has the pages of The Black Hymn, so raising his bandmates from the great beyond is just a riff away. But with every chord comes blood, guts, and the kind of apocalyptic chaos only DEATHGASM can unleash. --\n\nFestivals: Fantastic Fest 25, Monster Fest 25",
      "description": "Details Directed by Jason Lei Howden Starring Milo Cawthorne, Kimberley Crossman, Joshua Blake NZ Premiere + Q&A The sequel to the cult Kiwi splatter-metal classic is finally here!\nLet's enjoy the blood-soaked carnage together.\nWe'll crank this one up to 11 for ya!\n\"...brings the metal, drowns viewers in spectacularly sloppy violence, and does so with a mischievous smile.\"\n- Matt Donato, Daily Dread This Terror-Fi exclusive will be your only chance to see the film in a cinema!"
    },
    {
      "id": "TFi - Flush-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Flush",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_e7ae5e64-386d-4ed2-be53-5b2b4a541919.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-02-17:00"
      ],
      "displayDate": "Sun 02 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-flush",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Grégory Morin\nStarring Jonathan Lambert, Élodie Navarre, Elliot Jenicot, Rémy Adriaens\nNZ Premiere\n\nWild, hilarious, unexpected, and truly original ... FLUSH is that festival gem you tell all your friends you found.\n\n\"A breath of fresh air ... subverting convention in plenty of ways to ensure maximum audience enjoyment.\" - Kat Hughes, THN\n\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- Middle-aged coke fiend Luc is having a pretty terrible night. Having gone to confront his ex at the club where she works, determined to somehow win back her love, one thing leads to another and he soon finds himself wedged firmly in a toilet, effectively trapping him in a bathroom stall. Trapped, we should mention, with a heap of coke that he stole from the bar's resident dealer. He's soon found, setting off an increasingly crazy series of circumstances that veer from the hilarious to the intensely grotesque as Luc's world is assailed from every conceivable direction in a bizarre race against time that will have you gasping. --\n\nFestivals: Fantasia 25 (Audience Award Winner)",
      "description": "Details Directed by Grégory Morin Starring Jonathan Lambert, Élodie Navarre, Elliot Jenicot, Rémy Adriaens NZ Premiere Wild, hilarious, unexpected, and truly original ...\n\"A breath of fresh air ... subverting convention in plenty of ways to ensure maximum audience enjoyment.\"\n- Kat Hughes, THN This Terror-Fi exclusive will be your only chance to see the film in a cinema!\n-- Middle-aged coke fiend Luc is having a pretty terrible night.\nHe's soon found, setting off an increasingly crazy series of circumstances that veer from the hilarious to the intensely grotesque as Luc's world is assailed from every conceivable direction in a bizarre race against time that will have you gasping."
    },
    {
      "id": "TFi - Her Will Be Done-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Her Will Be Done",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_1bc70990-fd2b-40f8-9ad0-f034fffb735b.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-01-16:00"
      ],
      "displayDate": "Sat 01 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-her-will-be-done",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Julia Kowalski\nStarring Maria Wróbel, Roxane Mesquida, Wojciech Skibinski\nNZ Premiere\n\nA gritty and powerful European folk horror, with stunning performances and 'Carrie' vibes.\n\n\"...a tale of transgressive women in unwelcoming places, and what it takes to survive.\" - Alan Hunter, Screen International\n\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- Nawojka, 20, dreams of escaping her harsh life working at the family farm. Under the influence of the free-spirited Sandra, Naw experiences trance-like episodes and strange powers, just like her dead mother before her. --\n\nFestivals: Cannes Directors' Fortnight 25",
      "description": "Details Directed by Julia Kowalski Starring Maria Wróbel, Roxane Mesquida, Wojciech Skibinski NZ Premiere A gritty and powerful European folk horror, with stunning performances and 'Carrie' vibes.\n\"...a tale of transgressive women in unwelcoming places, and what it takes to survive.\"\n- Alan Hunter, Screen International This Terror-Fi exclusive will be your only chance to see the film in a cinema!\n-- Nawojka, 20, dreams of escaping her harsh life working at the family farm.\nUnder the influence of the free-spirited Sandra, Naw experiences trance-like episodes and strange powers, just like her dead mother before her."
    },
    {
      "id": "TFi - Keeper-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Keeper",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_eb4eb75c-c29a-497a-bc1c-364e7c098038.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-12-20:30"
      ],
      "displayDate": "Wed 12 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-keeper",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Osgood Perkins\nStarring Tatiana Maslany, Rossif Sutherland, Christin Park\nAdvance Screening\n\nBe one of the first in the world to see the most anticipated horror of 2025 ... from the twisted mind of Osgood Perkins. You do not want to miss watching this in a packed cinema!\n\nThere's so much under wraps with this film ... it's gonna be epic going in knowing nothing about the wild ride we're about to take!\n\n-- During an anniversary getaway at a remote cabin, a wife is left alone after her husband departs, only to confront a sinister presence that exposes the cabin's chilling past. --",
      "description": "Details Directed by Osgood Perkins Starring Tatiana Maslany, Rossif Sutherland, Christin Park Advance Screening Be one of the first in the world to see the most anticipated horror of 2025 ... from the twisted mind of Osgood Perkins.\nYou do not want to miss watching this in a packed cinema!\nThere's so much under wraps with this film ... it's gonna be epic going in knowing nothing about the wild ride we're about to take!\n-- During an anniversary getaway at a remote cabin, a wife is left alone after her husband departs, only to confront a sinister presence that exposes the cabin's chilling past.\n--"
    },
    {
      "id": "TFi - Nirvanna: The Band - The Show - The Movie-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Nirvanna: The Band - The Show - The Movie",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_802aa179-79d1-4077-988b-a630d7299a19.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-01-18:30"
      ],
      "displayDate": "Sat 01 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-nirvanna-the-band-the-show-the-movie",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Matt Johnson\nStarring Matt Johnson, Jay McCarrol\nNZ Premiere\n\nIf you love the unique comedies Terror-Fi brings you, like 'Hundreds of Beavers'' and 'Greener Grass', this gem is for you! 100% on Rotten Tomatoes and not to be missed in a crowded cinema!\n\n\"Consistently hilarious and mesmerizing in its sheer audacity and execution. There has never been a movie like this before, and I have a hard time imagining there ever will be again.\" - Nathan McVay, HeyUGuys\n\n-- In a harebrained attempt to get their band booked at a local dive bar, two lovable losers convert an old RV into a time machine taking a temporal road trip leaving behind a trail of destruction, alternate timelines and a broken friendship. --\n\nFestivals: SXSW 25, Melbourne 25",
      "description": "Details Directed by Matt Johnson Starring Matt Johnson, Jay McCarrol NZ Premiere If you love the unique comedies Terror-Fi brings you, like 'Hundreds of Beavers'' and 'Greener Grass', this gem is for you!\n100% on Rotten Tomatoes and not to be missed in a crowded cinema!\n\"Consistently hilarious and mesmerizing in its sheer audacity and execution.\nThere has never been a movie like this before, and I have a hard time imagining there ever will be again.\"\n- Nathan McVay, HeyUGuys -- In a harebrained attempt to get their band booked at a local dive bar, two lovable losers convert an old RV into a time machine taking a temporal road trip leaving behind a trail of destruction, alternate timelines and a broken friendship."
    },
    {
      "id": "TFi - Pop-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Pop",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_6381db33-ce86-4170-b2b7-2c8cb857b553.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-30-20:15"
      ],
      "displayDate": "Thu 30 Oct",
      "url": "https://www.roxycinema.co.nz/movie/tfi-pop",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Tim Hamilton\nStarring Sarah Munn, Tim Hamilton, Trenton Colbert, Peter Sugden, Raymond Hamilton\nWorld Premiere + Q&A\n\nBe the first in the world to see New Zealand filmmaker Tim Hamilton's meta love-letter to independent filmmaking, and the emotional impact of losing a best friend.\n\nA truly unique story and vision from one of the most talented upcoming filmmakers we have in Aotearoa.\n\nThis screening will be followed by a special Q&A.\n\n-- This wasn’t supposed to be a true story, but it became one. American actor Gene came to Aotearoa to be in a movie. His role? A wannabe influencer on a quest to restart the internet. Simple concept. Easy to execute. Yeah, nah. The no-budget indie flick quickly spirals out of control when his Kiwi director's unprocessed grief wreaks havoc on the production. Tensions boil over. The cast refuses to stay in character. The fourth wall is smashed to pieces. --",
      "description": "A truly unique story and vision from one of the most talented upcoming filmmakers we have in Aotearoa.\nThis screening will be followed by a special Q&A.\nHis role?\nA wannabe influencer on a quest to restart the internet.\nSimple concept."
    },
    {
      "id": "TFi - Primate-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Primate",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_ea0cf39d-b53b-4687-ba07-a24904bc48bb.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-02-20:30"
      ],
      "displayDate": "Sun 02 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-primate",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Johannes Roberts\nStarring Jessica Alexander, Troy Kotsur, Johnny Sequoyah\nNZ Premiere – Closing Night\n\nSee the film that sent the Fantastic Fest crowd wild at its World Premiere … and won’t be in cinemas until 2026. What a way to finish Terror-Fi 2025!\n\n\"If you wish that Nope had just doubled-down on the chimp violence, Primate is absolutely the blood-flavored popcorn flick you've been waiting for.\" - Richard Whittaker, Austin Chronicle\n\n-- After returning home to Hawaii for summer break, Lucy is reunited with her father Adam, sister Erin and their pet chimpanzee Ben. Lucy and her friends Kate, Hannah and Kate's older brother Nick decide to throw a pool party to take advantage of an empty house after Lucy's father is called away for work. Unbeknownst to them, Ben is bitten by a rabid animal and the gentle chimpanzee they once knew is no more. The group is forced to barricade themselves in the pool, but with no means of calling for help, they must work together to figure out how to outsmart the now ferocious Ben and survive their ordeal. --\n\nFestivals: Fantastic Fest 25 (Secret Screening), Fright Fest UK 25",
      "description": "Details Directed by Johannes Roberts Starring Jessica Alexander, Troy Kotsur, Johnny Sequoyah NZ Premiere – Closing Night See the film that sent the Fantastic Fest crowd wild at its World Premiere … and won’t be in cinemas until 2026.\nWhat a way to finish Terror-Fi 2025!\n\"If you wish that Nope had just doubled-down on the chimp violence, Primate is absolutely the blood-flavored popcorn flick you've been waiting for.\"\n- Richard Whittaker, Austin Chronicle -- After returning home to Hawaii for summer break, Lucy is reunited with her father Adam, sister Erin and their pet chimpanzee Ben.\nLucy and her friends Kate, Hannah and Kate's older brother Nick decide to throw a pool party to take advantage of an empty house after Lucy's father is called away for work."
    },
    {
      "id": "TFi - Psycho Therapy: The Shallow Tale of a Writer-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Psycho Therapy: The Shallow Tale of a Writer",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_be809836-49b1-4a77-b32a-e43f912f5bbf.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-02-15:00"
      ],
      "displayDate": "Sun 02 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-psycho-therapy-the-shallow-tale-of-a-writer",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Tolga Karaçelik\nStarring Steve Buscemi, John Magaro, Britt Lower\nNZ Premiere\n\nA delightfully twisted tale that has you hooked from the first scene and leaves you with a smile on your face. One of those indie gems you love to discover at a festival.\n\n\"...a compelling, darkly comedic thriller...\" - Douglas Davidson, Elements of Madness\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- A struggling writer in the midst of a divorce befriends a retired serial killer who incidentally becomes his marriage counselor by day, and killing counselor for his next book by night. --\n\nFestivals: Tribeca 25, Monster Fest 25",
      "description": "Details Directed by Tolga Karaçelik Starring Steve Buscemi, John Magaro, Britt Lower NZ Premiere A delightfully twisted tale that has you hooked from the first scene and leaves you with a smile on your face.\nOne of those indie gems you love to discover at a festival.\n\"...a compelling, darkly comedic thriller...\" - Douglas Davidson, Elements of Madness This Terror-Fi exclusive will be your only chance to see the film in a cinema!\n-- A struggling writer in the midst of a divorce befriends a retired serial killer who incidentally becomes his marriage counselor by day, and killing counselor for his next book by night.\n-- Festivals: Tribeca 25, Monster Fest 25"
    },
    {
      "id": "TFi - Secret Screening 2025-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Secret Screening 2025",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_fd1b8270-8d9e-494a-b1c8-4392104adb92.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-01-20:30"
      ],
      "displayDate": "Sat 01 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-secret-screening-2025",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nNZ Premiere\n\nEnjoy a special secret screening with us!\n\nWe can't say much ... other than it's a horror, a New Zealand premiere, and one of the first screenings in the world!\n\nShhhhhhhhhhhhh!!!",
      "description": "Details NZ Premiere Enjoy a special secret screening with us!\nWe can't say much ... other than it's a horror, a New Zealand premiere, and one of the first screenings in the world!\nShhhhhhhhhhhhh!!\n!"
    },
    {
      "id": "TFi - Shorts 2025-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Shorts 2025",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_61510037-bea5-492e-b281-ae53ccd7afbc.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-01-14:00"
      ],
      "displayDate": "Sat 01 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-shorts-2025",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nNZ & World Premieres\n\nCome see an incredible range of genre shorts from New Zealand and around the World... for free!\n\nThis signature Terror-Fi event is carefully curated to showcase a range of new talent across a wide mix of genres.... filmmakers and films to look out for in the future!\n\nPlease note: the session is free but a booking fee applies both for online and in-person ticket sales.",
      "description": "Details NZ & World Premieres Come see an incredible range of genre shorts from New Zealand and around the World... for free!\nThis signature Terror-Fi event is carefully curated to showcase a range of new talent across a wide mix of genres.... filmmakers and films to look out for in the future!\nPlease note: the session is free but a booking fee applies both for online and in-person ticket sales."
    },
    {
      "id": "TFi - Sisu: Road to Revenge-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - Sisu: Road to Revenge",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_32ae1f4a-fc56-48f8-b3bd-5cee31fb6271.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-29-21:00"
      ],
      "displayDate": "Wed 29 Oct",
      "url": "https://www.roxycinema.co.nz/movie/tfi-sisu-road-to-revenge",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Jalmari Helander\nStarring Stephen Lang, Richard Brake, Jorma Tommila\nNZ Premiere – Opening Night\n\nDo not miss the wildest action film of 2025 on the big screen. 100% on Rotten Tomatoes and the perfect way to open Terror-Fi 2025!\n\n\"...builds off the gleeful, comic-level brutality of the original with an inventive, more direct sequel.\" - Jeff Ewing, Collider\n\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- Returning to the house where his family was brutally murdered during the war, 'the man who refuses to die' dismantles it, loads it on a truck, and is determined to rebuild it somewhere safe in their honor. When the Red Army commander who killed his family comes back hellbent on finishing the job, a relentless, eye-popping cross-country chase ensues - a fight to the death, full of clever, unbelievable action set pieces. --\n\nFestivals: Fantastic Fest 25, Beyond Fest 25, Toronto After Dark 25",
      "description": "Details Directed by Jalmari Helander Starring Stephen Lang, Richard Brake, Jorma Tommila NZ Premiere – Opening Night Do not miss the wildest action film of 2025 on the big screen.\n100% on Rotten Tomatoes and the perfect way to open Terror-Fi 2025!\n\"...builds off the gleeful, comic-level brutality of the original with an inventive, more direct sequel.\"\n- Jeff Ewing, Collider This Terror-Fi exclusive will be your only chance to see the film in a cinema!\n-- Returning to the house where his family was brutally murdered during the war, 'the man who refuses to die' dismantles it, loads it on a truck, and is determined to rebuild it somewhere safe in their honor."
    },
    {
      "id": "TFi - The Legend of Ochi-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - The Legend of Ochi",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_e2b9a1d5-b9c8-4021-8922-e36e422b16f2.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-02-13:00"
      ],
      "displayDate": "Sun 02 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-the-legend-of-ochi",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Isaiah Saxon\nStarring Emily Watson, Willem Dafoe, Finn Wolfhard, Helena Zengel\nNZ Premiere\n\nThis stunning fantasy adventure from A24 is a beautiful piece of magical escapism. Not to be missed on the big screen.\n\n\"...a rare triumph of analogue effects and spellbinding spectacle.\" - Linda Marric, HeyUGuys\nThis Terror-Fi exclusive will be your only chance to see the film in a cinema!\n\n-- In a remote village on the island of Carpathia, a shy farm girl named Yuri is raised to fear an elusive animal species known as Ochi. But when Yuri discovers a wounded baby Ochi has been left behind, she escapes on a quest to bring him home. --\n\nFestivals: Sundance 25, Melbourne International Film Festival 25",
      "description": "Details Directed by Isaiah Saxon Starring Emily Watson, Willem Dafoe, Finn Wolfhard, Helena Zengel NZ Premiere This stunning fantasy adventure from A24 is a beautiful piece of magical escapism.\nNot to be missed on the big screen.\n\"...a rare triumph of analogue effects and spellbinding spectacle.\"\n- Linda Marric, HeyUGuys This Terror-Fi exclusive will be your only chance to see the film in a cinema!\n-- In a remote village on the island of Carpathia, a shy farm girl named Yuri is raised to fear an elusive animal species known as Ochi."
    },
    {
      "id": "TFi - The Running Man-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - The Running Man",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_1f63ae52-377f-4717-98ba-175fa8389637.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-13-20:30"
      ],
      "displayDate": "Thu 13 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-the-running-man",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Edgar Wright\nStarring Josh Brolin, Colman Domingo, Michael Cera, Lee Pace, Katy O'Brian, Glen Powell\nOpening Night of release\n\nI don't think we could be more excited to be one of the first in the world to see master filmmaker Edgar Wright bring us his take on THE RUNNING MAN.\n\nIf his previous work is anything to go by, we are in for a wildly entertaining ride. A must see in the cinema!\n\n-- In a near-future society, The Running Man is the top-rated show on television—a deadly competition where contestants, known as Runners, must survive 30 days while being hunted by professional assassins, with every move broadcast to a bloodthirsty public and each day bringing a greater cash reward. Desperate to save his sick daughter, working-class Ben Richards is convinced by the show’s charming but ruthless producer, Dan Killian, to enter the game as a last resort. But Ben’s defiance, instincts, and grit turn him into an unexpected fan favorite—and a threat to the entire system. As ratings skyrocket, so does the danger, and Ben must outwit not just the Hunters, but a nation addicted to watching him fall. --",
      "description": "Details Directed by Edgar Wright Starring Josh Brolin, Colman Domingo, Michael Cera, Lee Pace, Katy O'Brian, Glen Powell Opening Night of release I don't think we could be more excited to be one of the first in the world to see master filmmaker Edgar Wright bring us his take on THE RUNNING MAN.\nIf his previous work is anything to go by, we are in for a wildly entertaining ride.\nA must see in the cinema!\n-- In a near-future society, The Running Man is the top-rated show on television—a deadly competition where contestants, known as Runners, must survive 30 days while being hunted by professional assassins, with every move broadcast to a bloodthirsty public and each day bringing a greater cash reward.\nDesperate to save his sick daughter, working-class Ben Richards is convinced by the show’s charming but ruthless producer, Dan Killian, to enter the game as a last resort."
    },
    {
      "id": "TFi - We Bury The Dead-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "TFi - We Bury The Dead",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_1350e197-dd30-4bd9-b73b-a7160b7da735.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-11-02-18:30"
      ],
      "displayDate": "Sun 02 Nov",
      "url": "https://www.roxycinema.co.nz/movie/tfi-we-bury-the-dead",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Zac Hilditch\nStarring Daisy Ridley, Matt Whelan, Brenton Thwaites, Mark Coles Smith\nNZ Premiere\n\nBe the first in New Zealand to see this truly fresh and emotional take on the zombie genre ... and it's not coming to cinemas until February 2026!\n\n\"Just when you thought nothing original could come to the zombie genre director Zak Hilditch proves that wrong with the brilliant We Bury The Dead.\" - David Griffiths, Subculture Entertainment\n\n-- Ava, a desperate woman whose husband is missing in the aftermath of a catastrophic military experiment, joins a \"body retrieval unit,\" but her search takes a chilling turn when the corpses she's burying start showing signs of life. --\n\nFestivals: SXSW 25, Melbourne 25",
      "description": "Details Directed by Zac Hilditch Starring Daisy Ridley, Matt Whelan, Brenton Thwaites, Mark Coles Smith NZ Premiere Be the first in New Zealand to see this truly fresh and emotional take on the zombie genre ... and it's not coming to cinemas until February 2026!\n\"Just when you thought nothing original could come to the zombie genre director Zak Hilditch proves that wrong with the brilliant We Bury The Dead.\"\n- David Griffiths, Subculture Entertainment -- Ava, a desperate woman whose husband is missing in the aftermath of a catastrophic military experiment, joins a \"body retrieval unit,\" but her search takes a chilling turn when the corpses she's burying start showing signs of life.\n-- Festivals: SXSW 25, Melbourne 25"
    },
    {
      "id": "Terror-Fi Fan Badge 2025-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "Terror-Fi Fan Badge 2025",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_20a27069-a229-4959-9687-8502bb555262.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2025-10-29-18:00"
      ],
      "displayDate": "Wed 29 Oct",
      "url": "https://www.roxycinema.co.nz/movie/terror-fi-fan-badge-2025",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nEnjoy all 17 screenings at Terror-Fi 2025 for just $199 ... that's under $12 each!\n\nEvery Fan Badge holder receives a special Swag Bag full of goodies! You’ll also get priority reservation on seats at our free Short Films Showcase.\n\nThis year's line-up has a stunning range of blockbuster hits and indie gems ... World and New Zealand Premieres ... across a wide range of genres!\n\n16 Feature Films and our first ever Limited Series!\n\nFan Badges are limited so get in quick!",
      "description": "Details Enjoy all 17 screenings at Terror-Fi 2025 for just $199 ... that's under $12 each!\nEvery Fan Badge holder receives a special Swag Bag full of goodies!\nYou’ll also get priority reservation on seats at our free Short Films Showcase.\nThis year's line-up has a stunning range of blockbuster hits and indie gems ... World and New Zealand Premieres ... across a wide range of genres!\n16 Feature Films and our first ever Limited Series!"
    }
  ]
}