[
  {
    "id": "Wrexham Down Under - Sky Stadium Car Parking-Sky Stadium Car Park, Wellington, New Zealand-Ticketek",
    "name": "Wrexham Down Under - Sky Stadium Car Parking",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx92851.jpg",
    "venue": "Sky Stadium Car Park, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.5000831,
      "long": 172.8344077
    },
    "dates": [
      "2025-07-19-00:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=WREXPARK25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Get your event day car park sorted in advance for the Wrexham Down Under match at Sky Stadium. Secure your spot and avoid any queues on the day.\nIf you require a mobility car park space, please complete the online form here.\nOnline parking sales close one hour prior to the car park open time.\nCar parking EZY tickets will need to be printed and be ready to show on your arrival to the car park. Once parked, please display clearly on your dashboard."
  },
  {
    "id": "Wrexham Down Under tickets-Sky Stadium, Wellington, New Zealand-Ticketek",
    "name": "Wrexham Down Under tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97602.jpg",
    "venue": "Sky Stadium, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2730528,
      "long": 174.7858728
    },
    "dates": [
      "2025-07-19-00:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=WREXHAM25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Presented by: TEG Sport\nThe tour finale takes place in Wellington as Wrexham roll in to face the Phoenix in their hometown fortress. With Kiwi pride on the line, this battle promises fireworks to close out the tour.\nKick Off Time is subject to change.\nHospitality Package Inclusions\n\nAll Hospitality enquiries can be sent to info@vipnow.com.au\nView the VIP Brochure.\nWhat Are Ultimate Tickets?"
  },
  {
    "id": "PDC ANZ Premier League - Round 6 - Wellington tickets-TSB Arena, Wellington Central, Wellington-Ticketek",
    "name": "PDC ANZ Premier League - Round 6 - Wellington tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx96737.jpg",
    "venue": "TSB Arena, Wellington Central, Wellington",
    "coordinates": {
      "lat": -41.2856676,
      "long": 174.778804
    },
    "dates": [
      "2025-11-08-00:00"
    ],
    "displayDate": "Sat 08 Nov",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=PDCANZW25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Presented by: PDC & TEG Sport\nIntroducing the PDC ANZ Premier League 2025!\nGet ready for the biggest darts tournament Australia and New Zealand have ever seen! This October and November, the PDC ANZ Premier League will take over eight iconic arenas, bringing the ultimate darts showdown to fans across the region.\nEight elite players from the Australian and New Zealand circuits will battle it out over eight electrifying Saturdays, competing not just for glory, but for a coveted spot in the 2025/26 World Darts Championship, London.\nKicking off in Cairns to arenas in Newcastle, Adelaide, Canberra, Hobart, Wellington and Brisbane, this tour will bring sport’s biggest party to cities across the Tasman.\nThis is your chance to dress up, grab your mates and witness world-class darts action LIVE, as the sport’s top talents in Australia and New Zealand light up the oche in a pulsating atmosphere like no other.\nIt’s darts, its drama, it’s PDC ANZ Premier League 2025 – Are you ready to play?\n180 Club VIP Package - Floor Tables\nPackage Includes:\n1 x Front Block Table Seat\n4 hour food & beverage package (beer, cider, wine and soft drinks)"
  },
  {
    "id": "Glow-N-Fire Hot Wheels Monster Trucks Live tickets-Sky Stadium, Wellington, New Zealand-Ticketek",
    "name": "Glow-N-Fire Hot Wheels Monster Trucks Live tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx96680.jpg",
    "venue": "Sky Stadium, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2730528,
      "long": 174.7858728
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://premier.ticketek.co.nz/shows/Show.aspx?sh=HOTWSS25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Presented by: The Warehouse & TEG\nHot Wheels Monster Trucks Live™: Glow-N-Fire presented by The Warehouse is coming to New Zealand for the first time and brings fans’ favorite Hot Wheels Monster Trucks to life including Mega Wrex™, Tiger Shark™, HW 5-Alarm™, Bone Shaker™, Bigfoot®, Gunkster™, and introducing the brand new Skelesaurus™, the fossil fury villain of Hot Wheels Monster Trucks.\nGet ready for more heat and action as we continue to bring the ultimate monster truck show to fans! Special kids pricing is available for all shows providing a great value for the whole family!"
  },
  {
    "id": "Sky Stadium Car Parking-Sky Stadium Car Park, Wellington, New Zealand-Ticketek",
    "name": "Sky Stadium Car Parking",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx92851.jpg",
    "venue": "Sky Stadium Car Park, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.5000831,
      "long": 172.8344077
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=HOTWPARK25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Get your event day car park sorted in advance for the Hot Wheels Monster Trucks Live at Sky Stadium. Secure your spot and avoid any queues on the day.\nIf you require a mobility car park space, please complete the online form here.\nOnline parking sales close one hour prior to the car park open time.\n\nCar parking EZY tickets will need to be printed and be ready to show on your arrival to the car park. Once parked, please display clearly on your dashboard.\nStandard size vehicles only up to 2m wide x 5.4m long x 2.2m high. Larger vehicles may be turned away at the owners’ risk.  Please contact Sky Stadium in advance should you wish to bring a large vehicle."
  },
  {
    "id": "ALL BLACKS v SOUTH AFRICA-Sky Stadium, Wellington, New Zealand-Ticketek",
    "name": "ALL BLACKS v SOUTH AFRICA",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx96988.jpg",
    "venue": "Sky Stadium, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2730528,
      "long": 174.7858728
    },
    "dates": [
      "2025-09-13-00:00"
    ],
    "displayDate": "Sat 13 Sep",
    "url": "https://tickets.allblacks.com/shows/show.aspx?sh=ABSVSAFW25",
    "source": "Ticketek",
    "eventType": "Sports & Fitness",
    "description": "Unfinished business in the capital.\nThe All Blacks face off against their greatest rivals, the Springboks, at Sky Stadium in the second home test of the Lipovitan-D Rugby Championship – and this is no ordinary match.\nThe last time South Africa came to Wellington, it ended in a dramatic draw. Now, it’s time to settle the score, with the Freedom Cup up for grabs. After losing it in 2024, the All Blacks are determined to bring it home.\nKick-off is 7:05pm, and the stakes couldn’t be higher. This is a clash you don’t want to miss.\nWear the black jersey. Bring the noise. Make Sky Stadium a fortress.\nBLACK JERSEY PASS - EXPERIENCE THE ALL BLACKS LIKE NEVER BEFORE\nThe Black Jersey Pass is the ultimate game-day experience for passionate All Blacks fans. This premium package takes you beyond the stands and into the heart of the action, offering exclusive access and unforgettable moments.\nWith the Black Jersey Pass, you’ll enjoy:\nThe best seats in the house – Get closer to the action with prime stadium seating.\nYour very own merch pack – Take home exclusive All Blacks gear.\nQ&A session with a former All Black – Hear insights and stories from a rugby legend on the Friday before the match at Captains Run.\nAccess to the Captain’s Run – Step inside the inner sanctum on the Friday before the match and experience the All Blacks’ final training up close.\nPlayer signing session – A rare chance to meet some of the game’s biggest stars.\nThis is more than just a ticket—it’s your pass to the ultimate All Blacks experience.\nSecure your Black Jersey Pass now."
  },
  {
    "id": "Hothouse Flowers tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Hothouse Flowers tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97638.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2026-02-22-00:00"
    ],
    "displayDate": "Sun 22 Feb",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=HOTHOUSE26",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Destroy All Lines\nWellington, get ready! Irish legends Hothouse Flowers return February 2026 for the first time in over twenty years.\nCelebrated for their explosive fusion of rock, Irish folk, and gospel, the Dublin-born band has captivated audiences around the world for decades.\nFrom their street-performing roots to major global stages, they’ve earned a reputation for unforgettable live shows filled with raw emotion, spontaneity, and soul.\nKnown for their boundless energy and musical improvisation, every Hothouse Flowers concert is a unique experience.\nTheir performances blend powerful anthems, tender ballads, and traditional songs that reflect the depth of Irish storytelling, creating an emotional and uplifting journey.\nWith a deep connection to their audiences and a talent for turning every gig into a one-of-a-kind event, their long-awaited return promises to be one of the most talked-about live music moments of the year.\nDon’t miss one of the most celebrated returns of the year."
  },
  {
    "id": "Fill The Void tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Fill The Void tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97643.png",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-08-02-00:00"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=THEVOID25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Lacuna\nPrepare to descend into the depths of sound as Lacuna returns with Fill The Void — a night built on immersive energy, driving rhythm, and raw underground atmosphere.\nThis is not just a party — it’s a release. Expect a curated lineup of DJs pushing late-night, house, garage and electronic through Meow Nui’s bespoke system, surrounded by hypnotic visuals and a dance floor moving in unison.\nStep into the void — where the beat pulls you deeper.\nLimited $12.50 early entry tickets available – arrive before 9:30PM to redeem."
  },
  {
    "id": "Jonathan Crayford - Bikes in Space tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Jonathan Crayford - Bikes in Space tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97317.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-25-00:00"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=JCBIKES25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Jonathan Crayford\nJonathan Crayford introduces his latest project 'Bikes In Space' an electronic vintage keys and drums driven fully improvised groove space junk ensemble that sounds like what it might be like to be in the brain of Philip K Dick, Ursula Le Guin or Margaret St Clair - except more. After a 2 month tour of Auckland, they hit Nui with added punch to the drums featuring Riki Pirihi and Julien Dyne.\nJonathan Crayford keys, Joe Kaptein keys, Riki Pirihi drums, Julien Dyne drums."
  },
  {
    "id": "No Cigar tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "No Cigar tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97391.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-11-07-00:00"
    ],
    "displayDate": "Fri 07 Nov",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=NOCIGAR25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Eccles Entertainment\nBreakout Aotearoa five-piece NO CIGAR have announced a three-date tour across New Zealand this November, in celebration of their highly anticipated third studio album Under the Surface, due for release July 30th.\nSince forming in 2019, NO CIGAR have built a fiercely loyal fanbase across Aotearoa and beyond, carving out a unique niche that blends elements of indie, surf, and alternative rock. Their upcoming album is crafted for the stage — shaped by the band’s dynamic chemistry and a deep connection with their audience.\nNO CIGAR’s 2023 sophomore album The Great Escape spent more than 74 consecutive weeks on the NZ Top 20 Albums Chart and featured the breakout hit “Concubine,” voted the 10th best rock song of 2024 by listeners of The Rock FM.\nTheir past tours across NZ, Australia and the UK have consistently sold out, driven by a word-of-mouth buzz and a reputation for electric, unforgettable performances. This tour will host their biggest headline shows on home soil to date and are not to be missed!"
  },
  {
    "id": "Nadia Reid tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Nadia Reid tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx96919.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-12-12-00:00"
    ],
    "displayDate": "Fri 12 Dec",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=NADIAENB25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Banished Music\n\"[Nadia] embraces a full-bodied sound halfway between Haim’s sophisticated pop sparkle and Sharon Van Etten’s full-throated songcraft\" — The Guardian\nThis December acclaimed songwriter Nadia Reid journeys back to New Zealand and Australia in celebration of Enter Now Brightness; her critically lauded fourth album which was released on Chrysalis in February 2025.\nThe Manchester-based expatriate New Zealander is known for her ruminative and well-crafted folk-inflected songwriting, and with Enter Now Brightness she presents a record of poise and great beauty, the sound of a cellular shift, of pain giving way to tenderness and joy.\n“There’s a questing robustness to these songs, a sense of somebody finally having the perspective to seek out answers to long-hanging questions.” ★★★★ — MOJO\nEnter Now feels different. It is an album, she says, of departure and questioning, that has reminded her how songwriting can be “the most useful thing to do with pain and joy and thoughts and feelings and anger.” That through music we can find great change. “I’m so much better off now that it exists,” she says. “Now feels like a new time.”"
  },
  {
    "id": "Ash Grunwald tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Ash Grunwald tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97370.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-08-24-00:00"
    ],
    "displayDate": "Sun 24 Aug",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=ASHGRUN25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Australia’s premier bluesman, Ash Grunwald embarks on his first ever full length tour of New Zealand!\nRenowned for his electrifying live shows, Ash Grunwald has inspired a generation to hit the road in an old van to ‘surf by day jam by night’.\nThe festival favourite brings a high energy, vibrant live show with stacks of guitars and foot stomping blues. Part troubadour, part storyteller - Ash has been selling out shows all over the world!\nDon’t miss this chance to see live blues music at it’s finest!\nEnshrined by Australian folklore, live on stage, Grunwald rocks the house yet touches the soul, serving a tsunami of dance, beats, roots, bass ‘n’ blues. He has supported legends James Brown, The Black Keys, Jack Johnson, Xavier Rudd, and Keith Urban, among numerous others, and played sold out festivals across Europe, Japan, and North America.\nWith six Australian Top-50 albums to his credit, alongside five ARIA and four AIR Award Nominations, two APRA Awards, and gong for Best International Act at the LA Music Critic Awards in 2014, Grunwald is cast in bronze among Australia’s most successful blues musicians."
  },
  {
    "id": "Princess Chelsea’s Midwinter Ball tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Princess Chelsea’s Midwinter Ball tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97190.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-26-00:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=PCMWB25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "Presented by: Banished Music\nSWORDS AND SORCERY - Fantasy on The Big Screen\nwith special guests Grecco Romank & Luke Buda\nwith your host TOM SAINSBURY\n'The Wintergarden will host many, many more incredible events, but it will never host something like the mesmerising Princess Chelsea and Twin Peaks crossover again' - Rolling Stone\nRead more"
  },
  {
    "id": "Yoko–Zuna: A Live Tribute to KAYTRANADA tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "Yoko–Zuna: A Live Tribute to KAYTRANADA tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97592.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-10-17-00:00"
    ],
    "displayDate": "Fri 17 Oct",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=YOKOZUNA25",
    "source": "Ticketek",
    "eventType": "Music & Concerts",
    "description": "This October, Aotearoa electronic/progressive hip-hop powerhouse Yoko-Zuna will make their long anticipated return to Pōneke, presenting the music of KAYTRANADA in the city's magnificent Meow NUI. Over the past decade Yoko-Zuna have firmly established themselves as one of the country’s most exciting live acts and a favourite on the festival circuit. Just back from a world tour with hip-hop multihyphenate CHAII, the four piece made up of Swap Gomez, J.Y Lee, Kenji Iwamitsu-Holdaway, & Frank Eliesa once again join forces to perform their live tribute to a genre-defying beat wizard.\nLouis Kevin Celestin aka KAYTRANADA is a Haitian-Canadian record producer and DJ. He first made waves in 2010 with a steady stream of mixtapes, remixes, and original tracks released under the name Kaytradamus. By 2013, reintroducing himself as KAYTRANADA, he was turning heads across the global music scene. The momentum only grew—by 2014, he landed a deal with the influential label XL Recordings. In 2016, he dropped his debut studio album, 99.9%, which was met with widespread critical acclaim. 2019’s Bubba—a genre-blurring triumph earned him two Grammy Awards, including Best Dance/Electronic Album, solidifying his place as one of the most innovative voices in contemporary music."
  },
  {
    "id": "Sky Stadium Member for a Day-Sky Stadium, Wellington, New Zealand-Ticketek",
    "name": "Sky Stadium Member for a Day",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97052.jpg",
    "venue": "Sky Stadium, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2730528,
      "long": 174.7858728
    },
    "dates": [
      "2025-09-27-00:00"
    ],
    "displayDate": "Sat 27 Sep",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=HOTWMEM25",
    "source": "Ticketek",
    "eventType": "Other",
    "description": "Presented by: Sky Stadium\nGather your family, colleagues or friends and enjoy watching Hot Wheels Monster Trucks Live Glow-N-Fire in comfort from the Sky Stadium Members Club. You’ll have access to our Members Gallery on level 4, and the ability to purchase from a large range of food and beverage options. It will also include:\nCorporate VIP gate entry\nAn unreserved seat in our Level 4 Members Gallery\nFull use of the Members Club facilities from gates open time until 45 minutes after the scheduled end of play\nThere’s no minimum number required to book this package. You will need to present your ticket to the Members Helpdesk on match day to receive your Members Club guest pass\nTerms and Conditions apply"
  },
  {
    "id": "John Butler tickets-Meow Nui, Wellington, New Zealand-Ticketek",
    "name": "John Butler tickets",
    "imageUrl": "https://https://d19py84rdi4j91.cloudfront.net/dbimages/sfx97381.jpg",
    "venue": "Meow Nui, Wellington, New Zealand",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-09-24-00:00"
    ],
    "displayDate": "Wed 24 Sep",
    "url": "https://premier.ticketek.co.nz/shows/show.aspx?sh=JOHNBPT25",
    "source": "Ticketek",
    "eventType": "Other",
    "description": "Presented by: Jarrah Records\nJohn Butler returns to Wellington for an intimate show at Meow Nui and will be introducing his brand-new album, Prism live. He will be accompanied by his 3-piece band, featuring Michael Barker, his original touring drummer; percussionist Michael Boase; and Ian Peres on keys and bass.\nPrism is back to the full sound of John Butler, reclaiming his classic groove-laden force, brimming with fierce guitars, robust percussion and meteoric choruses. The concert will feature new songs such as honky tonk country infused hit Trippin’ on You and the anthemic So Sorry, alongside classic JBT tunes, Zebra and Better Than as well as opus guitar instrumental, Ocean."
  }
]
