[
{
  "id": "Where’s Jai Album Release Tour - Wellington-San Fran, Wellington-Ticket Master",
  "name": "Where’s Jai Album Release Tour - Wellington",
  "imageUrl": "https://www.moshtix.co.nz/uploads/b586317a-2aca-40f6-bbb8-49aba0471caex600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-08-23-19:00"
  ],
  "displayDate": "Sat 23 Aug",
  "url": "https://www.moshtix.co.nz/v2/event/where-s-jai-album-release-tour-wellington/181315",
  "source": "Ticket Master",
  "eventType": "Other",
  "description": "Come dance with Where’s Jai for an unforgettable night on tour to celebrate the release of their debut album, Fresh Out Of Air!\nExpect to dance, scream, and maybe even cry.\nWhere’s Jai is a fast-emerging, high-energy pop rock band from Tāmaki Makaurau, known for chaotic fun and emotionally charged shows.\nFronted by dynamic powerhouse vocalists Grace Allis and Leigh Edmeades, and backed by Michael Walmsley (guitar), Jai Nielsen (bass), and Gene Todd (drums), the five-piece is gaining serious momentum.\nWhere’s Jai is fast becoming one of Aotearoa’s most exciting new acts."
},
{
  "id": "Borderline | Wellington-San Fran, Wellington-Ticket Master",
  "name": "Borderline | Wellington",
  "imageUrl": "https://www.moshtix.co.nz/uploads/00c9787d-f1e3-4ffe-902f-c129d7672cdfx600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-08-28-19:30"
  ],
  "displayDate": "Thu 28 Aug",
  "url": "https://www.moshtix.co.nz/v2/event/borderline-wellington/183244",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "Throughout August and September, Borderline will be heading across New Zealand - to Te Awanui Tauranga, Pōneke Wellington, Tāmaki Makaurau Auckland and Ōtahutahi Christchurch - as well as two Australian dates in Melbourne and Sydney.\nTickets for Borderline’s Chrysalis EP Release Tour will be available to purchase by the General Public on Thursday 24 July at 1:00pm local time.\nBorderline is what happens when four best friends grow up making music together and never stop.\nBlending shimmering pop, funk grooves, and soaring indie-rock anthems, Borderline is quickly becoming one of the most exciting new bands to break out of the Southern Hemisphere.\nLive Nation pre-sale: Wednesday 23 July 12:00pm - Thursday 24 July 12:00pm local For complete tour & ticket information, visit: livenation.co.nz or livenation.com.au"
},
{
  "id": "Great Sounds Great Festival 2025-Various Venues - Wellington/Poneke, Wellington-Ticket Master",
  "name": "Great Sounds Great Festival 2025",
  "imageUrl": "https://www.moshtix.co.nz/uploads/502033b2-700a-4028-85ff-6cb7557568c3x600x600",
  "venue": "Various Venues - Wellington/Poneke, Wellington",
  "coordinates": {
    "lat": -41.2887953,
    "long": 174.7772114
  },
  "dates": [
    "2025-09-06-16:00",
    "2025-09-07-03:00"
  ],
  "displayDate": "Sat 06 Sep + more",
  "url": "https://www.moshtix.co.nz/v2/event/great-sounds-great-festival-2025/181670",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "One-night multi-venue music festival across Cuba St precinct Eyegum Music Collective presents GREAT SOUNDS GREAT, a multi-venue music and arts festival taking over Pōneke's Cuba Street precinct for one night only on Saturday 6 September 2025.\nShowcasing 40 of Aotearoa's best artists across 10 neighbouring venues, this is one big party you shouldn't miss.\nEyegum has worked hard to curate a programme that is sure to offer something for everyone, from first time gig-goers to seasoned live music obsessives.\nThere will also be plenty more to be announced soon.\nWhen: from 4pm Saturday 6 September 2025 Where: San Fran, Meow, Valhalla, Rogue & Vagabond, Bedlam & Squalor, Hotel Bristol (2 stages), St Peter's on Willis, Flying Nun Records, 13 Garrett St Who: The lineup will include Anthonie Tonnon, Baby Zionov, Bad Taste, BADTAB, Baeoli, Bathysphere, The Bats, By A Damn Sight, Cindy, Eveline Breaker, Goya, Half/Angel, Hans Pucket, Iris Little, Jazmine Mary, Jen Cloher, JessB, JHL, Jim Nothing, Jordan Hamel, Leah Dodd, LEAO, Louisa Nicklin, The Phoenix Foundation, Reb Fountain, Rebecca Hawkes, Shayne P Carter (solo), Sig Wilder & Friends, Sofia Machray, Space Bats, Attack!, The Spectre Collective: live-scored cinema, Star Time, plus more artists to be announced soon."
},
]
