[
{
  "id": "Corrella | Skeletons Winter Tour-San Fran, Wellington-Ticket Master",
  "name": "Corrella | Skeletons Winter Tour",
  "imageUrl": "https://www.moshtix.co.nz/uploads/471568b2-acc8-4d5e-9b3b-287c6a21c9c6x600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-08-15-20:00"
  ],
  "displayDate": "Fri 15 Aug",
  "url": "https://www.moshtix.co.nz/v2/event/corrella-skeletons-winter-tour/181165",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "Loop, The Edge and Mai FM are stoked to present Corrella and their upcoming Skeletons Winter Tour!\nAfter a massive summer of festivals and touring alongside L.A.B across Aotearoa and Australia, Corrella are hitting the road this August for their biggest headline tour yet — bringing their new album Skeletons to the stage for the very first time.\nThe album follows their breakout debut Road From 26, which featured the sleeper hit Blue Eyed Māori—a track that now holds the record for the most weeks ever spent at Number One on the NZ Singles Chart.\nSince their debut, Corrella have sold out shows nationwide, become festival favourites, and picked up multiple Aotearoa Music Awards and Waiata Māori Music Awards.\nThis run of shows will be their biggest headline tour to date."
},
{
  "id": "Greta O’Leary and Goodnight My Darling - River Dark Tour-San Fran, Wellington-Ticket Master",
  "name": "Greta O’Leary and Goodnight My Darling - River Dark Tour",
  "imageUrl": "https://www.moshtix.co.nz/uploads/1e00a38c-3983-4af9-8dce-10e3b8be0afdx600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-08-24-17:30"
  ],
  "displayDate": "Sun 24 Aug",
  "url": "https://www.moshtix.co.nz/v2/event/greta-o-leary-and-goodnight-my-darling-river-dark-tour/182907",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "This August 24th join alt-folk songwriter Greta O'Leary & Te Whanganui a Tara artist Goodnight My Darling for one intimate and special show at San Fran, performing new and recently released works in celebration of emergence and O’Learys debut record 'River Dark'.\n‘A folk-rooted aesthetic that feels almost gothic’ (RNZ).\nRiver Dark' is O'Leary's debut.\nI was in the field below the house, I was at the pond with the dog, I played make believe longer than most.\nI was taught to be quiet.” ***************************************** Goodnight My Darling is the vision and project of up and coming Te Whanganui a Tara based singer-songwriter Maxine Macaulay."
},
{
  "id": "Messie-San Fran, Wellington-Ticket Master",
  "name": "Messie",
  "imageUrl": "https://www.moshtix.co.nz/uploads/3cd15fa2-6d3a-4607-b6a6-ca6536d192a8x600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-09-20-19:30"
  ],
  "displayDate": "Sat 20 Sep",
  "url": "https://www.moshtix.co.nz/v2/event/messie/182588",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "Gaining international attention after opening for one of the United Kingdom’s most coveted DJs Fred again.. and remixing his song ‘places to be’ which now has over 2.6M listens on Spotify alone, MESSIE is quickly becoming one of the most exciting new names to watch in New Zealand.\nTickets for MESSIE’s All Night Long tour in Auckland and Wellington will be available to purchase by the General Public on Friday 4th July at 12:00pm.\nMy Live Nation members will also be able to secure tickets during the presale which commences Wednesday 2nd July from 11:00am until Friday 4th July at 11:00am.\nMESSIE’s sets are guaranteed to be bootleg heavy with something for everyone as she draws from her own music taste of rap and grime, to early 2000’s singalongs, girl-boss anthems and queer music culture in the form of edits you’d never expect.\nALL NIGHT LONG TOUR Presented by Live Nation"
},
{
  "id": "Folk Bitch Trio-San Fran, Wellington-Ticket Master",
  "name": "Folk Bitch Trio",
  "imageUrl": "https://www.moshtix.co.nz/uploads/73ff4abb-553c-49b7-be82-888e10245ccfx600x600",
  "venue": "San Fran, Wellington",
  "coordinates": {
    "lat": -41.2941512,
    "long": 174.7755614
  },
  "dates": [
    "2025-09-27-19:00"
  ],
  "displayDate": "Sat 27 Sep",
  "url": "https://www.moshtix.co.nz/v2/event/folk-bitch-trio/180631",
  "source": "Ticket Master",
  "eventType": "Music & Concerts",
  "description": "Folk Bitch Trio Debut headline show in Te Whanganui-a-Tara/Wellington Melbourne’s alluring Folk Bitch Trio have announced their debut album release tour of New Zealand, playing headline shows in Auckland, Wellington & Christchurch.\nNow Would Be A Good Time, the debut album by Folk Bitch Trio, tells vivid, visceral stories.\nIt wasn’t long before she messaged Peverelle and Sinclair, asking if they’d be interested in starting a “folk bitch trio.”  As soon as they started singing together, their connection deepened, and “the chemistry of being inspired by each other was evident from the get-go,” says Sinclair.\nListening to Folk Bitch Trio, it’s clear that this is a band of three distinct points of view, with contrasting and complementary backgrounds and visions.\nSinclair is the self-proclaimed jester of the group, but her taste skews dark, gothic, baroque and dramatic, expressed as a love of opera and ballet as well as musicians as wide-ranging as Patti Smith, Nirvana and Tchaikovsky."
},
]
