[
  {
    "labels": [
      "Hobbies & Interests",
      "Sports & Fitness"
    ],
    "description": "Rack ‘em up!\nJoin us every week at the Residence Bar for our Weekly Pool Competition, where skill meets excitement! Whether you’re a seasoned pro or just looking for some friendly competition, this is your chance to show off your moves and compete for bragging rights and great prizes\n. Grab a drink, bring your A-game, and enjoy the ultimate pool night vibes\n. Don’t miss out—cue up and let’s play!\n"
  },
  {
    "labels": [
      "Music & Concerts",
      "Arts & Theatre"
    ],
    "description": ""
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "Interislander is docking onshore to bring burger lovers something truly special — The Love Ferry a spicy beef and pork patty with melted Kāpiti brie, caramelised onions, roasted red peppers, rocket, truffle aioli, crispy Harringtons bacon and pickled jalapeños in a Poneke Bakery red brioche bun, with smoked paprika and sea salt sprinkled fries.\r\nThis gourmet tribute to the love of food is served straight from the iconic Interislander ship box. Back by popular demand, the Interislander pop-up burger truck is making waves once again, offering a taste of the Interislander experience without even setting sail."
  },
  {
    "labels": [
      "Food & Drink",
      "Music & Concerts"
    ],
    "description": "This August, Beach Babylon becomes Club Tropicana, a retro, romantic escape inspired by 1960s tropical honeymoons, classic tiki bars and vintage beach glamour. Picture golden sunsets, flamingos, thatched umbrellas and the carefree buzz of a sun-soaked getaway, right in the heart of Wellington. No passport required.\r\n\r\nThe menu is vibrant and full of escapist flair. Start with coconut prawns and banana blossom kokoda, then dive into mains like mango glazed  pork rib rack or the tropical tofu paneer curry. Save room for dessert: pineapple upside-down pudding or a coconut rum fondue to bring the tropical fantasy to a sweet finale. Behind the bar, the tiki and kava-spiked cocktails flow freely, from Blue Hawaiian’s to retro rum punches, all dressed to impress with flamingo stirrers, umbrellas and tropical garnishes.\r\n\r\nA golden-age soundtrack sets the mood, featuring the smooth calypso of Harry Belafonte, beachy vibes from The Beach Boys, and sun-drenched classics by Astrud Gilberto.\r\n\r\nClub Tropicana is a winter getaway, fun and fabulously over the top."
  },
  {
    "labels": [
      "Arts & Theatre",
      "Photography & Visual Arts"
    ],
    "description": "A huge exhibition of national artists will be on display at Tākina in August.\nArtists from every corner of New Zealand will be vying for a $25,000 grand prize.\nThe Wellington Sculpture Trust will mount a display celebrating 42 years creating and promoting public art in the city.\nFinally, nine South Island artists sharing Netherlands heritage exhibit an irreverent show through a multicultural creative lens.\nNZAFA President Wayne Newman says “Tākina is Wellington’s new heart of creativity, and we’re delighted to fill it with the vision, energy, and diversity of New Zealand art."
  },
  {
    "labels": [
      "Education & Learning"
    ],
    "description": "Are you the maths lead in your school?\nRegister to join our Mathematics Leadership Community (MLC) and build your mathematics and statistics knowledge and leadership skills.\nThese MLC’s have been supporting mathematics leaders and teachers for over 18 years and we are excited to offer you the opportunity to be part of this network in 2025, which is shaping up to be a pivotal year in mathematics education.\nThrough engaging with current research and best practice, these meetings will enable leaders and teachers to: stay up to date with changes and implement Te Mātaiaho, Mathematics and Statistics Curriculum build capability in leading mathematics and statistics within and across their school investigate effective pedagogy and strategies for teaching and assessing mathematics and statistics connect and network with other leaders and teachers.\n$350 for a 2025 Membership (+gst and booking fees) $100 for 1 meeting (+gst and booking fees) *Each ticket purchased gives entry for two attendees from 1 school* For any Kāhui Ako interested in this series, please contact us at info@cognitioneducation.com."
  },
  {
    "labels": [
      "Arts & Theatre",
      "Music & Concerts"
    ],
    "description": "Gimme, gimme, gimme a night of song and dance.\nMamma Mia is the ultimate feel-good show.\nThe stage musical has been wowing audiences since 1999.\nIt’s due to wow Wellington audiences in 2025.\nGet ready to tap your toe to some of ABBA’s most famous songs."
  },
  {
    "labels": [
      "Food & Drink",
      "Festivals"
    ],
    "description": "New Zealand’s favourite foodie fest is back.\nFor the whole month of August, Visa Wellington On a Plate (VWOAP) brings culinary delights to hospitality venues across the city and region.\nExpect everything from creative events, delicious pop-up restaurants, and the beloved Burger Wellington.\nThis year, the festival theme is ‘Food is love’.\nIt's a tribute to the joy of connecting over kai and the capital’s vibrant, resilient hospitality scene."
  },
  {
    "labels": [
      "Festivals",
      "Film & Media"
    ],
    "description": "Lights, camera, action — the largest film festival in the country is back.\nCelebrating 57 years, the Whānau Mārama New Zealand International Film Festival is gearing up for 10 action-packed days in August.\nThe annual festival presents over 150 feature films, short films, and documentaries.\nThere’s always a huge and diverse selection of films to choose from.\n“These films speak powerfully to the moment we are living in."
  },
  {
    "labels": [
      "Music & Concerts",
      "Arts & Theatre"
    ],
    "description": "Orchestra Wellington is New Zealand’s oldest professional regional orchestra.\nIts busy concert series includes music from classical, romantic, and contemporary periods.\nYou’ll also see it regularly performing with the Orpheus Choir, Royal New Zealand Ballet, and New Zealand Opera.\nThe programme includes masterpieces that symbolise the artist’s struggle and resilience under repression and political control.\nCoupled with works from other composers, the concerts feature local and international soloists."
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Inside Circa Theatre’s waterfront venue, you’ll find two performance spaces.\nBoth offer a smorgasbord of professional theatre throughout the year.\nPlaywrights from international heavy hitters to brilliant Kiwi voices are represented.\nIt also includes programming from comedies and cabarets to contemporary dance and pantomime.\nCalled ‘Velarium’, it undulates in the wind mirroring the water in the harbour."
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "The Royal New Zealand Ballet (RNZB) pushes boundaries with its 2025 programme.\nDiverse and captivating works reflect the vision and influence of artistic director Ty King-Wall."
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "Celebrate old friends and new flavours as Lola Rouge and Taste of Home unite to celebrate the art of hand-pulled noodles and innovative Asian fusion cuisine. This unique collaboration brings together longtime friends and culinary innovators, whose journey began in the warmth of shared kitchens. Lola Rouge Executive Chef Jason Ng and Taste of Home Chef Tina Hu worked together years ago. Now they find themselves managing and owning restaurants within 100m of each other and were inspired to work together again to create dishes from their childhood and meals they love.\r\nPrepare for a bold and flavourful four-course journey through Asia that celebrates taste, tradition, and technique. The curated menu promises to pack a punch, blending the best of both restaurants with a mix of reimagined classics and soulful, homely flavours, and finishing with a shared dessert tasting platter. From start to finish, Stretch & Slurp promises a feast that is bold, comforting, and best enjoyed in the company of great friends and loved ones!"
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "Enter the magical realm of The Enchanted Ale Quarter, a fairytale-inspired pop-up tavern where whimsy, wonder and craft beer collide.\r\n\r\nStep into a storybook setting, with twinkling lights, woodland decor, and forest-fantasy touches around every corner. Feast on gnome and fairy-themed comfort food like the solstice salad, loaded forest fries, sirens & ships fish & chips, and a decadent dark forest brownie, all paired with enchanted brews and mythical tipples.\r\n\r\nCosy, curious, and otherworldly, The Enchanted Ale Quarter brings a little magic to Wellington’s winter nights. Dust off your wings and join us for a pint, some sustenance or a potion, no quest required."
  },
  {
    "labels": [
      "Food & Drink",
      "Hobbies & Interests"
    ],
    "description": "Challenge your taste buds — and your senses — as you experience Dragonfly's expertly crafted mini cocktails and treat size desserts while blindfolded. As your sense of sight fades, your taste, smell, and imagination take centre stage. Can you guess the hidden ingredients behind each delicious bite and sip? Whether you're a food and beverage connoisseur or just curious about new tastes, this immersive experience promises to be full of surprises and delicious discoveries. Will you uncover the secrets behind each sweet treat? The person who guesses the most correct ingredients will receive an $80 Dragonfly voucher and bragging rights as the ultimate flavour detective."
  },
  {
    "labels": [
      "Community & Culture"
    ],
    "description": "Love Wainuiomata is proud to bring you another energising Wainui Connections Breakfast.\nStart your morning right by connecting with like-minded local professionals, business owners, and community leaders. Be inspired by our special guest speakers (to be announced soon!) and enjoy a hearty breakfast\nThis is your opportunity to:\nShare your experience and knowledge\nSpark new connections\nStrengthen the professional and business fabric of Wainuiomata\nRegister here: https://forms.gle/F2BoYfkokoD3C9f38\nWe’re incredibly grateful to all our generous Wainui Connections Breakfast sponsors for making the free kai possible. This session is proudly supported by Hills Wainuiomata and Chubb Life.\nMonday, 18th August\n7.00AM – 8:00 AM (Doors open 6.30am)\nWainuiomata Community Hub, 1A Queen Street "
  },
  {
    "labels": [
      "Food & Drink",
      "Community & Culture"
    ],
    "description": "The Next Gen Cook Off returns for its fifth year, and things are heating up at Everybody Eats.\r\nEvery Monday in August, four of Wellington’s freshest young chefs will go head-to-head in a high-energy kitchen takeover, serving up epic three-course dinners using rescued food.\r\n\r\nEach chef will be given the same protein, generously provided by Meat Direct, but everything else is a surprise—ingredients are revealed that morning, based on what’s come in. Menus are created on the spot, and dishes are served to a buzzing, hungry crowd. It’s fast-paced, creative chaos with serious culinary skills on display. Guests get a front-row seat to the action, while supporting a truly game-changing enterprise.\r\n\r\n4 August — Jessie Gibberd, Loretta\r\nOriginally from rural Waikato, Jessie Gibberd made the move to Wellington to study, but it was the buzz of hospitality that captured her heart. Swapping textbooks for tongs, she left her degree behind to dive headfirst into the kitchen. Now a chef de partie at Loretta, Jessie brings a grounded, fresh perspective to one of the city’s most beloved eateries.\r\n\r\n11 August — Felipe Molina, El Matador\r\nHailing from Chile, Felipe Molina is a professional chef with over 15 years of experience in kitchens around the world. Having worked in several countries and world-class restaurants, Felipe brings a global sensibility to his craft. With a passion for seafood, meats, and bold, expressive flavours, his cooking is shaped by travel and tradition, blending international influence with creativity on every plate.\r\n\r\n18 August — Zane Gupwell, Graze\r\nZane Gupwell began his hospitality journey at just 15, washing dishes at a local café in Mount Eden. From there, he headed to Queenstown, learning from a wide range of chefs and kitchen styles before challenging himself with a move to Wellington. Since then, he’s worked at some of the city’s top restaurants and now brings his thoughtful, evolving style to Graze Wine Bar.\r\n\r\n25 August — Lulu Temmuyin, Mr Go’s\r\nLulu Temmuyin is a chef who loves pushing boundaries, even when they’re unexpected. Lactose intolerant but obsessed with cheese, and not a fan of lamb but winner of a lamb cooking competition, Lulu is all about surprises. At Mr Go’s, she brings bold, sustainable flavour to the forefront, blending personality with punch in every dish.\r\n\r\nEverybody Eats runs on a pay-what-you-can model, transforming food waste into gourmet meals and bringing the community together over good kai. The Next Gen Cook Off celebrates and champions this mission, proving that rescued food can be next-level delicious.\r\n\r\nThe Next Gen Cook Off is proudly supported by The Gas Hub."
  },
  {
    "labels": [
      "Community & Culture"
    ],
    "description": "Uike Kātoanga’i ‘o e lea faka-Tonga – Tonga Language Week\nCelebrate: 17 - 23 August 2025\nYou are invited to join the formal flag raising ceremony, at the Performing Arts Centre inside Pātaka Art + Museum.\nThere will be morning tea and refreshments following the ceremony."
  },
  {
    "labels": [
      "Community & Culture"
    ],
    "description": "Uike Kātoanga’i ‘o e lea faka-Tonga – Tonga Language Week Celebrate: 17 - 23 August 2025 You are invited to join the formal flag raising ceremony, at the Peace Memorial in Te Rauparaha Park.\nThis event is weather dependant and will be moved to the performing arts space at Pātaka if raining.\nThe flag raising ceremony will also be morning tea and refreshments at Pātaka after the ceremony.\nFind out more about the Pacific Language Weeks here: https://poriruacity.govt.nz/your-council/pacific-culture-in-porirua-city/pacific-language-weeks/"
  },
  {
    "labels": [
      "Education & Learning"
    ],
    "description": "This registration is for the two-day in-person workshop on 18th August and 19th August 2025 in Wellington at the James Cook Hotel Grand Chancellor.\nThe in-person workshop will run from 9.00am - 3.30pm both days.\nYou must also attend a 3rd day online on 4 September OR 5 September (select one date for 3rd day session) as part of this PLD.\nCatering for the in-person workshops will be provided, but this PLD does not include transport costs or accommodation.\nWhen registering, you will need to select from one of our tailored learning options, so we can best cater our content to your role."
  },
  {
    "labels": [
      "Family Friendly",
      "Education & Learning"
    ],
    "description": "If you have tamariki aged 0-6, you’re invited to your local centre during Playcentre Open Week to experience early childhood education with a difference.\n\nCome along for a free visit and support your tamariki to learn through play, while you meet other whānau in your community. From sand and water play, arts and music, to outdoor and messy play, there will be a range of resources and experiences on offer.\n\nWith over 400 centres across Aotearoa there is one near you. You get three free visits before enrolling, so why not try a few centres in your community to see what suits you best?\n\nMake a booking at johnsonville@Playcentre.org.nz or 04 478 3904 / 027 880 2425 (phone attended during session hours)"
  },
  {
    "labels": [
      "Family Friendly"
    ],
    "description": "Come along to our weekly play space for Under 5's!\nWe have an indoor play space equipped with toys and activities and our outdoor facility includes a playground, picnic area, water play area, sandpit and space to run around freely and play!\n- Messy play and sensory play activities.\n- Music and movement.\nMore details and enrolments available on our website."
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "The boil-up is a dish of love, traditionally made in big pots for whānau and friends. It brings people together. Te Papa wanted to capture the essence of this traditional Māori kai and give it a gourmet twist.\n\nTraditional boil-up pork roulade, with Pagro lettuce and tomato, puha mousseline, and horopito aioli in a toasted Brezelmania watercress milk bun, with hand-cut kūmara fries, mānuka honey aioli, a shot of bone broth, and a heart-shaped raspberry framboise dessert.\n\nJoin us at the Te Papa Cafe on Level 1, walk-ins welcome. Reserve your spot by booking now.\n\nPlease note we aren’t able to accommodate dietary requirements."
  },
  {
    "labels": [
      "Community & Culture",
      "Government & Politics"
    ],
    "description": "Contestants of 'It's in the Bag' become political candidates in 'It's in the Ballot' Meet the Candidates.\nCandidates choose a numbered box which has a question that has been submitted online by voters before the show.\nIt’s in the Ballot” is a community-led awareness and participation initiative.\nWe aim to increase voter interest in the general and council elections nationally.\nBy using broadcasting and web-based technologies to deliver in-studio; online on Facebook, YouTube and Twitch; and edited as YouTube videos we aim to enable voters to make informed voting decisions."
  },
  {
    "labels": [
      "Arts & Theatre",
      "Government & Politics",
      "Film & Media"
    ],
    "description": "Contestants of 'It's in the Bag' become political candidates in 'It's in the Ballot' Meet the Candidates.\nCandidates choose a numbered box which has a question that has been submitted online by voters before the show.\nIt’s in the Ballot” is a community-led awareness and participation initiative.\nWe aim to increase voter interest in the general and council elections nationally.\nBy using broadcasting and web-based technologies to deliver in-studio; online on Facebook, YouTube and Twitch; and edited as YouTube videos we aim to enable voters to make informed voting decisions."
  },
  {
    "labels": [
      "Health & Wellness",
      "Community & Culture"
    ],
    "description": "Neuroendocrine Cancer NZ is pleased to announce our special annual event will be held in Wellington this year. It's a day designed specifically for people living with Neuroendocrine Cancer (NETs), as well as their whānau, friends, and support networks.\nThis free, full-day event brings together leading medical experts, wellbeing professionals, and the wider NET community for a meaningful day of learning, connection, and support.\nFor more information and to register, visit our website: https://www.neuroendocrinecancer.org.nz/net-education-day "
  },
  {
    "labels": [
      "Family Friendly"
    ],
    "description": "Sniff, scratch and burrow at Ngā Turua Kiwi, Kiwi Burrows.\n- Climb the towering tree to the top of the forest canopy, then slide all the way down to the forest floor.\nPlayHQ is Nōku te Ao Capital E’s public indoor play space for tamariki aged 0-5.\nNgā Tūrua Kiwi will be our final PlayHQ activation at Queens Wharf, before we move to Te Matapihi ki te Ao Nui, the new Central Library.\nNōku te Ao Capital E is located at 4 Queens Wharf, Wellington."
  },
  {
    "labels": [
      "Family Friendly"
    ],
    "description": "Playcentres across the Wellington region invite whānau with tamariki from birth to school age to come along for a free visit during Playcentre Open Week, which runs from 18-22 August.\nPlaycentre is a place for you and your tamariki to play, learn and grow together – to strengthen your bond and to make connections with other whānau in your community.\nFrom sand and water play, arts and music, to outdoor and messy play, there will be a range of resources and learning experiences on offer for your tamariki.\nPlaycentres will be open from 9.30am-11.30am for whānau to visit.\nBook your free visit today at www.playcentre.org.nz."
  },
  {
    "labels": [
      "Hobbies & Interests"
    ],
    "description": "Ready to take a creative break just for YOU?\nJoin artist Emy from Eclo Art for a beautiful 10-week journey where self-love, mindfulness, and clay art come together in a deeply nourishing experience."
  },
  {
    "labels": [
      "Community & Culture",
      "Family Friendly"
    ],
    "description": "The root of our humanity lies with The Mother's. To support thriving life we are offering A Mother's Space as care and resourcing for ALL Mother's to gather.\nKate Williams and Lily Tanner are Innate Traditions Postpartum Care providers.\nWe are so honoured to share our offering!\nThis coming Monday 18th Aug we are in Featherston at the Kiwi Hall.\nA Mother’s circle happens every fortnight on a Monday (2nd & 4th of every week). It is for ALL postpartum mothers, no matter the age of your children. You could be freshly postpartum or have older children and felt you are still needing repair, perhaps your postpartum time was not how you wanted or expected? OR you are feeling the disconnect of what it feels like to Mother in these times we are living in.\nWhatever it is for you.....This is a S.P.A.C.E where you can show up just as you are. To be SEEN, HEARD, NOURISHED & SUPPORTED. Join in with the village wisdom of the Mothers.\nThese regular sessions are where we tend to:\nNervous system regulation / breath\nSelf care\nSharing & community building\nPostpartum wisdom & support\nRepair\nSpecial guest speakers\nBabies, of course, are welcome!\nThis yummy ‘retreat’ like session tours the Wairarapa- Featherston, Carterton, Masterton and back around again.\nThis week we are in Masterton at the Hōkai Tahi building 21 Worksop Road. 10 am start.\nAll welcome! Bookings are recommended but not essential, you can just drop in. $20 cash at the door.\nBook here: https://classes.as.me/?appointmentType=77697735"
  },
  {
    "labels": [
      "Photography & Visual Arts",
      "Arts & Theatre"
    ],
    "description": "‘Animals first entered the imagination as messengers and promises,’ John Berger.\nMessengers explores the enduring gaze shared between humans and other animals. The exhibition title is inspired by a line from John Berger’s seminal 1977 essay ‘Why Look at Animals?’ Berger argued that the relationship between humans and animals – ‘our unspeaking companionship’ – has been transformed by capitalism.\nMessengers brings together historical and contemporary ways of looking at animals in photography and art. It features archival photographs from the National Library and Alexander Turnbull Collections, first taken by newspaper photographers in the mid twentieth century. The images capture everything from the polar bears once housed in Wellington Zoo, to an elderly gentleman standing amongst the life size concrete animal sculptures in his garden. These images are at once tender and loving, sentimental and silly, kind and indifferent.\nMessengers places these archival photographs in proximity and conversation with contemporary sculpture and moving image works by four Aotearoa-based artists: Denise Batchelor, Brit Bunkley, Jane Dodd and John Ward Knox. From eerie AI and computer-generated animals to the hypnotic stare of a real live Ruru; from carved wooden godwits you can hold in your hand to ‘hominoid’ brooches, each artist’s work speaks to the ‘unspeaking companionship’ between humanity and other animals.\nIMAGE Brit Bunkley, still from Transit, single channel video, 2025"
  },
  {
    "labels": [
      "Food & Drink",
      "Arts & Theatre"
    ],
    "description": "Eat Your Art Out brings a creative twist to high tea, inspired by the bold and brilliant works of Toi Art.\nEnjoy a menu of classic treats with an artistic edge: from the Sweet William’s Dish, Golden Ratio Scone, Madeleine Moment, and the Mint to Be mousse.\nAlcoholic beverages are available for purchase, and dietary options are available on request.\nEvery purchase helps to support Aotearoa New Zealand’s national museum.\n------ Set Menu (Includes one of each item per person) Cheery Cherry Curator A silky milk chocolate crémeux layered with vibrant cherry glaze and topped with a dark chocolate disc creates a perfectly balanced blend of tart and sweet Mint to Be Cool mint and sweet strawberry mousse gently resting on a white chocolate base, combining vibrant flavours that are meant to be together Madeleine Moment A citrus-infused madeleine paired with silky sambuca namelaka, vibrant green apple gel, and an elegant chocolate garnish delivers golden flavours with a playful twist Sweet William’s Dish Mānuka honey ganache nestled in a crisp vanilla tart shell, topped with a chocolate ‘The Dish’ by William De Morgan."
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "Interislander has been a long-time supporter of Visa Wellington on a Plate, the famous hospitality event that lights up the Wellington region each August.\n\nThe Love Ferry\nFeaturing a Poneke Red brioche bun, with a beef & pork patty seasoned with a mix of smoked paprika, garlic, and a touch of cayenne pepper. Melted Kapiti brie cheese with caramelised onions, roasted red peppers, rocket and truffle aioli. Topped with crispy Harrington’s bacon and pickled jalepenos for those who like a little heat. Served with a side of crispy fries sprinkled with smoked paprika and sea salt at $20. For the perfect pairing, we offer a Garage Project Beer match for $12.\n\nPop-up Burger at Wellington Railway Station\nWe've set up a pop-up burger truck outside the Wellington Railway Station. This will allow the public to indulge in our burger and fries without needing to sail on the Interislander. Its also available to passengers when travelling the Cook Strait on the Ferry."
  },
  {
    "labels": [
      "Health & Wellness",
      "Hobbies & Interests"
    ],
    "description": "This 60 minute session is an energising and refreshing experience to carry you through the day and reduce the build up of work-related stress and fatigue.\nSuitable for everyone.\nThe Monday's Lunchtime class focuses more on the problem with the back and neck care.\nWednesdays: 12.15 - 1.15pm Fridays: 12.15 - 1.15pm Drop in :$18 or 10 class concession card for $140"
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Join editor and poet Nick Ascroft as he introduces a crackling selection of New Zealand poets from his edition of the annual online anthology Ōrongohau | Best New Zealand Poems.\nJames Brown, Robin Peace, Simon Sweetman, Stacey Teague, Philomena Johnson, Kiri Piahana-Wong, Zephyr Zhang, and others will read their work, and poems by the late Fleur Adcock, Vincent O’Sullivan, and Paula Harris will also be celebrated in this warm-up to Phantom Billstickers National Poetry Day.\nWriters on Mondays is presented with the Museum of New Zealand Te Papa Tongarewa, Circa Theatre, Meow and Phantom Billstickers National Poetry Day and supported by the Letteri Family."
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Join editor and poet Nick Ascroft as he introduces a crackling selection of New Zealand poets from his edition of the annual online anthology Ōrongohau | Best New Zealand Poems.\nJames Brown, Robin Peace, Simon Sweetman, Stacey Teague, Philomena Johnson, Kiri Piahana-Wong, Zephyr Zang, and others will read their work, and poems by the late Fleur Adcock, Vincent O'Sullivan, and Paula Harris will also be celebrated in this warm-up to Phantom Billstickers National Poetry Day.\nWriters on Mondays is presented by the International Institute of Modern Letters and Te Papa Tongarewa.\nThe 2025 series will run from 12.15—1.15 pm each Monday from 7 July to 29 September at Te Papa Tongarewa and Circa Theatre, with two special evening sessions at Meow.\nAdmission is free and all are welcome."
  },
  {
    "labels": [
      "Family Friendly",
      "Education & Learning"
    ],
    "description": "Join us and our doggy guests from Canine Friends Pet Therapy for Read to Kurī at the library. You can book a 15-minute session to sit with one of our friendly dogs and read your favourite book, or one you've found at the library.\nRead to Kurī aims to help children improve their literacy, self-confidence, and self-esteem in a relaxed, non-judgemental environment. This programme is perfect for tamariki aged 5+ who would like to practice their reading skills while making a new canine friend at the library.\nTo book your session, please call the library on 04 477 6151, or email johnsonville.library@wcc.govt.nz with your preferred date and time.\nBookings are for 15 minutes only. After you have booked, library staff will be in contact informing you what time to arrive for your session. "
  },
  {
    "labels": [
      "Film & Media"
    ],
    "description": "A fun night full of vibes and nostalgia!\n\nCome watch Ratatouille (2007) to support our 3rd year Major Project \"Bad Egg\", you would be helping towards costs for transporting our gear and crew, amazing cast, beautiful locations and feeding our talents and creatives!\n\nMovie starts at 5.30pm so come anytime before, the earlier the better seats!"
  },
  {
    "labels": [
      "Education & Learning"
    ],
    "description": "Our language classes are delivered by experienced Chinese language teachers with an emphasis on practical and enjoyable learning.\nWe offer five classes for Novice, Beginners, Elementary, Pre-intermediate, and Intermediate levels. All classes run for 10 weeks small class sizes ranging from approximately 3 to 10 people. These classes are suitable for learners 14 years older and are held at the VUW Pipitea Campus.\nTerm 3 classes begin on 18 August 2025 and registration closes on 20 July 2025.\nFor more information on our classes go to our language courses page. https://www.wgtn.ac.nz/ci/courses-and-tests/courses "
  },
  {
    "labels": [
      "Music & Concerts",
      "Community & Culture"
    ],
    "description": "Pro Tools Update + Audio Community Networking Night\nIn Partnership with Atomise, Join Dan Lovell and Drew Parsons from Avid for an evening filled with exciting updates on the latest Pro Tools software. Connect with fellow audio experts, share tips and tricks, and expand your network in the industry. Whether you're a seasoned pro or just starting out, this event is perfect for anyone passionate about audio production. Don't miss this opportunity to learn, collaborate, and have a great time with like-minded individuals. See you there!"
  },
  {
    "labels": [
      "Food & Drink",
      "Community & Culture"
    ],
    "description": "Pro Tools Update + Audio Community Networking Night\nIn Partnership with Atomise, Join Dan Lovell and Drew Parsons from Avid for an evening filled with exciting updates on the latest Pro Tools software. Connect with fellow audio experts, share tips and tricks, and expand your network in the industry. Whether you're a seasoned pro or just starting out, this event is perfect for anyone passionate about audio production. Don't miss this opportunity to learn, collaborate, and have a great time with like-minded individuals. See you there!"
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Connect with other like minded people that have a love of dance.\nBrazilian Zouk was developed in Rio de Janeiro in the mid 90s, and is now becoming more and more popular\nhttps://www.youtube.com/watch?v=DfhRHnEAbak\n..............\nThis is stunning to watch and even more fun to dance! It is based on the original Lambada dance but adapted to more modern music with a slow-quick-quick beat. It can be danced to a wide variety of music including R&B, Rock and Pop.\nIn this block of 5 classes you will discover the fundamental techniques, movements and sequences of Brazilian Zouk to get you up and running on the dance floor.\nThis includes:\nWeek 1: Passo basico\nWeek 2: Viradinha\nWeek 3: Io-Io\nWeek 4: Bonus\nWeek 5: Combination\nThey are designed so you can start this block as a complete newbie, or you can continue on as an existing student from the last block.\nThere are 4 blocks of classes (A, B, C, D) in the complete Fundamentals course. Once these are done, you can progress to the Improvers classes.\nPrices and payment:\n- Prepaid 5 week term cost is $90 waged or $75 for unwaged/students.\n- Ad hoc cost is $20 waged or $18 unwaged/students\nOnline payments can be made to Adam Polaczuk\nAcct: 03-0531-0559348-25\nDetails: Your name and ZoukFunB"
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "This Salsa class continue from Term 3\nLet's master the foundation steps and basic turn patters of Cuban Salsa.\nIf you are complete beginner, please email us before you join. '\n\nChoose the package that suits you best:\nDame Una – 1 lesson per week: $157\nDame Dos – 2 lessons per week: $252 (e.g Salsa + Bachata)\nStudent discounts and more pricing options available on our website.\nPay via online banking or in cash on the day.\nBank details:\nAccount Number: 01-1823-0012007-00\nName: Liliya De Castro\nReference: Your Name + ST4\nIf you're unable to commit to a full term, we also offer a 5-class concession card for greater flexibility.\nLet’s keep dancing and growing together – we can’t wait to see you in class\nIf you are not sure if this level is for you drop us an email and come and try: lily@salsatherapy.co.nz "
  },
  {
    "labels": [
      "Health & Wellness",
      "Hobbies & Interests"
    ],
    "description": "The yoga exercises from Yoga in Daily Life Level 1 and 2 are designed for beginners and those who want to build a firm foundation to their existing practice.\nIncludes: yoga exercises to increase flexibility and strength of muscles and improve the function of internal organs; yogic breathing to reduce stress and anxiety; traditional pranayama, relaxation and meditation techniques."
  },
  {
    "labels": [
      "Health & Wellness",
      "Education & Learning",
      "Food & Drink"
    ],
    "description": "Doctors For Nutrition and MTM Charity invite you to an evening of inspiration, education, and connection at our next ‘Dine with a Doc’ dinner.\nJoin us for a presentation on ‘The Power of Plant-Based Nutrition and Lifestyle Interventions for Preventing Chronic Disease’—an event designed to empower everyone from healthcare professionals to health-conscious community members.\nYou will also be the first to hear about the new MTM charity, and about their mission.\nThrough easy-to-understand explanations of key concepts - such as endothelial dysfunction, intramyocellular lipid accumulation, and calorie density - you’ll discover how WFPB eating can dramatically improve health outcomes and transform lives.\nAfter the presentation, join us for a panel discussion and a Q&A session with Dr Haitjema and Dr Luke Wilson."
  },
  {
    "labels": [
      "Community & Culture",
      "Government & Politics"
    ],
    "description": "Contestants of 'It's in the Bag' become political candidates in 'It's in the Ballot' Meet the Candidates.\nCandidates choose a numbered box which has a question that has been submitted online by voters before the show.\nIt’s in the Ballot” is a community-led awareness and participation initiative.\nWe aim to increase voter interest in the general and council elections nationally.\nBy using broadcasting and web-based technologies to deliver in-studio; online on Facebook, YouTube and Twitch; and edited as YouTube videos we aim to enable voters to make informed voting decisions."
  },
  {
    "labels": [
      "Sports & Fitness",
      "Community & Culture"
    ],
    "description": "Poneke Kilbirnie Softball - 80th AGM\nWe are pleased to be notifying you of the 80th AGM\nWhen: Monday 18th August 2025\nTime: 6:30pm\nWhere: Toitu Poneke Community & Sports Centre – thehub\nWe are calling for nominations and submissions for the following:\n• Constitution Remits\n• Committee Member Nomination\nPlease submit any remits, nominations or matters of business to:\nponekekilbirniesoftball@gmail.com by Friday 15th of August 2025 "
  },
  {
    "labels": [
      "Sports & Fitness"
    ],
    "description": "College Sport Wellington RSSL Netball Division 2 Final: Scots College vs Hutt Valley High School. At the Ākau Tangi Sports Centre.\nIf you are unable to make it in person, you can live-stream it here: https://www.youtube.com/watch?v=bNr0Hj9oDHk\n"
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "DOOR TIME: 6:30pm\nSHOW START TIME 7:30pm\n\nLebanese-Palestinian American, born in Oakland California, Sammy Obeid double majored in Business and Mathematics at UC Berkeley and then turned down a job at Google to be a comedian. Now the host of 100 Humans on Netflix, he’s also appeared on NBC's Last Comic Standing and America's Got Talent, as well as TBS’s Conan, and is best known for his world record of performing comedy 1,001 nights in a row, a story featured in both Time Magazine and The New York Times."
  },
  {
    "labels": [
      "Hobbies & Interests",
      "Community & Culture"
    ],
    "description": "Holy Knit Batman!\nIt’s the Southern Cross Yarning Circle!\nNow you can wile away the evening hours, knitting and nattering or flip the script and give Grandma a cardie next Christmas.\nJust bring down some wool and needles, or your preferred stitchcraft.\nCrocheters and other stitchers all welcome."
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Welcome to TERM 4\nThis term we will focus on social dancing and strengthen your foundations with cool combos and partner connection drills. Perfect for steady progress.\nChoose the package that suits you best:\nDame Una – 1 lesson per week: $157\nDame Dos – 2 lessons per week: $252 (e.g Salsa + Bachata)\nStudent discounts and more pricing options available on our website.\nPay via online banking or in cash on the day.\nBank details:\nAccount Number: 01-1823-0012007-00\nName: Liliya De Castro\nReference: Your Name + ST4\nIf you're unable to commit to a full term, we also offer a 5-class concession card for greater flexibility.\nLet’s keep dancing and growing together – we can’t wait to see you in class\nIf you are not sure if this level is for you drop us an email and come and try: lily@salsatherapy.co.nz "
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Across six immersive sessions (the first being a practica), we'll Continue to learn the fundamentals of Traditional Samba de Gafieira.\nWe will continue to deepen your knowledge, continuing on learning the concepts started in the first block of Samba de Gafieira classes.\nWeek 1: Practice/party/catch up\nWeek 2: Sacada + Sacada Invertido\nWeek 3: Romario\nWeek 4: Pica Pau\nWeek 5: Esse + Esse saida\nWeek 6: Facao + Facinha\nSamba de gafieira is the partnered version of Brazil’s world-renowned, samba no pe. Samba de Gafieira is danced to the Brazilian samba musical rhythms and must be distinguished from the ballroom Samba, danced in International Latin and American Rhythm ballroom dance styles.\nCheck out this demo : https://www.youtube.com/watch?v=JMGlfr3zA5w\nIt appeared in the 1940s and it gets its name from the Gafieira – popular urban nightclubs of Rio de Janeiro at that time. The dance derived from the Maxixe and followed the arrival of the Choro (another samba musical style). It left most of the Maxixe’s Polka elements behind but maintained the entwined leg movements of the Argentine Tango, although adopting a more relaxed posture than the latter. Many see this form of Samba as a combination of Waltz and Tango."
  },
  {
    "labels": [
      "Film & Media",
      "Music & Concerts",
      "Hobbies & Interests"
    ],
    "description": "Every Monday, come down to Moon to test your knowledge on pop culture, movies, science, history, general knowledge & music history, hosted by Young Gho$t!!\nPrizes for 1st, 2d, 3rd & last place and a weekly raffle, including bar tabs, rounds of drinks, and tickets to some of the epic shows happening at Moon!\nEntry is $2 per person with proceeds going to a different charity every week\nBook a table for your team via our website - https://www.newtownmoon.co.nz/book-a-table/ "
  },
  {
    "labels": [
      "Film & Media",
      "Music & Concerts",
      "Hobbies & Interests"
    ],
    "description": "Every Monday, come down to Moon to test your knowledge on pop culture, movies, science, history, general knowledge & music history, hosted by Young Gho$t!\nPrizes for 1st, 2d, 3rd & last place and a weekly raffle, including bar tabs, rounds of drinks, and tickets to some of the epic shows happening at Moon!\nEntry is $2 per person with proceeds going to a different charity every week Book a table for your team via our website - https://www.newtownmoon.co.nz/book-a-table/"
  },
  {
    "labels": [
      "Music & Concerts"
    ],
    "description": "Pōneke Shanty Club is a community of people who enjoy sea shanties and folk songs and love to sing them with friends and strangers - come along and join in! Opening support from Divine Pitch - Stephen on guitar, and Megan on fiddle,\nmandolin, etc, performing songs & tunes, original\n& traditional, at the “divine pitch” of A=432Hz, and Tamara, another wonderful Wellington folkie. Doors open from 7pm. $20, or $15 for AR members. More details in the website or Balladeer. Hope to see you there\n"
  },
  {
    "labels": [
      "Education & Learning",
      "Hobbies & Interests"
    ],
    "description": "Speakers: Ilse Breitwieser, Research Associate – Botanist; Rob Smissen, Senior Researcher – Botanist. Allan Herbarium, Manaaki Whenua – Landcare Research, Lincoln.\nCall them billy-buttons, drumstick flowers, billy balls, sun balls (in Australia) or woollyheads and puatea in New Zealand, or with their scientific name Craspedia (Gnaphalieae, Compositae/Asteraceae), these everlasting daisies are conspicuous members of many plant communities in New Zealand and Australia but remain an outstanding taxonomic challenge.\nIn 1961, based on a small number of available herbarium specimens, HH Allan’s Flora of New Zealand volume 1 recorded just 6 species in New Zealand. However, the 1992 and 1993 checklists of Tony Druce, who made extensive field observations and collected numerous herbarium specimens, distinguished more than 45 undescribed entities that might warrant taxonomic recognition.\nMorphological variation in New Zealand Craspedia is complex, making the definition and circumscription of species problematic. At least in part, this difficulty is the legacy of an extremely rapid and recent diversification of the genus in New Zealand—a scenario that produces challenges for genetic as well as morphological approaches to delimiting species."
  },
  {
    "labels": [
      "Sports & Fitness"
    ],
    "description": "College Sport Wellington RSSL Netball Division 1 Final: St Mary's College vs Queen Margaret College. At the Ākau Tangi Sports Centre.\nIf you are unable to make it in person, you can live-stream it here: https://www.youtube.com/watch?v=5IahEDPkl9Q\n\n"
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Welcome to TERM 4\nThis term we will focus on some social dancing, Rueda de Casino and help you build confidence, timing, and partner work!\nSuitable for students who already know the basic steps.\nChoose the package that suits you best:\nDame Una – 1 lesson per week: $157\nDame Dos – 2 lessons per week: $252 (e.g. Salsa + Bachata)\nStudent discounts and more pricing options available on our website.\nPay via online banking or in cash on the day.\nBank details:\nAccount Number: 01-1823-0012007-00\nName: Liliya De Castro\nReference: Your Name + ST4\nIf you're unable to commit to a full term, we also offer a 5-class concession card for greater flexibility.\nLet’s keep dancing and growing together – we can’t wait to see you in class\nIf you are not sure if this level is for you drop us an email and come and try: lily@salsatherapy.co.nz "
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Come and join us for Improvers Zouk Block D (5 weeks).\nWe have some great new content for you this year and will be building on foundational movements.\nThe complete Improvers course consists of 6 different Blocks (A-F).\nEach block focuses on a different aspect and technique of Brazilian Zouk and so they can be completed independently of each other.\nOur recommendation is to complete all 6 Blocks before progressing onto the Brazilian Zouk Deep Dive classes.\nIn Improvers Block D you will get an Introduction to Tilted turns as well as some exercises on Floor craft and the Social Dance experience.\n===Prices and payment:\n- Prepaid 5 week Block cost is $90 waged or $75 for unwaged/students\n- Ad hoc cost per class is $20 waged or $18 unwaged/students\nOnline payments can be made to Adam Polaczuk\nAcct: 03-0531-0559348-25\nDetails: Your name and ZoukImpD\n===Location:\nClasses are in Studio 6, Level 5, Te Auaha, 65 Dixon Street\n===Housekeeping:\n- You should have completed the 4 beginner Class blocks before joining Improvers classes\n- Drop in or new students, please get in contact before the start of class to let us know you are interested so we can assess your level and organise a private class if necessary to catch you up. If you just show up on the night, you are welcome to watch the class but will not be able to join in (this is to respect the learning of our regular students as the classes are progressive) "
  },
  {
    "labels": [
      "Food & Drink",
      "Music & Concerts"
    ],
    "description": "Dust off the denim, dig out the flip phones and get ready to rewind time. Two Grey is bringing back Arizona Bar & Grill for a limited-time pop-up.\r\n\r\nWelcome to The Arizona Flashback, a throwback to the late '90s and early 2000s that revives the flavours, energy and atmosphere of the iconic Arizona Bar & Grill. Known as a go-to spot for after-work drinks, late-night bites, birthday celebrations and casual catch-ups, Arizona was a place where people came together over great food and good times.\r\n\r\nNow, its beloved Southwestern-style dishes and all-day menu return — not just as a delicious nod to the past, but as a celebration of shared moments, laughter and connection.\r\n\r\nImmerse yourself in the full Y2K dining experience, complete with retro beats, neon lights and the return of Arizona’s famous Spin the Wheel game for a dash of playful nostalgia."
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Come and dance, socialise and have a fun evening with your local kizomba crew\n8:30pm - 11:00pm\nUpstairs at Footnote Studios (entry from 60 Dixon St)\n$10 entry\nBank account:\nWKC Kizomba\n03-0558-0134198-003\n(Grant Major)\n(Please put your first name as reference)\nCan't wait to see you there! "
  },
  {
    "labels": [
      "Arts & Theatre"
    ],
    "description": "Raw Meat Monday is back for 2025!\nWellington's longest-running open mic comedy night.\nComedy gold and comedy coal, each night is a guaranteed gamble.\nIf you’re trying comedy for the first time, Raw Meat is the safest place to start.\nFeaturing a guest MC and a changing lineup of first-time acts, seasoned pros, and everything in between."
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "Get ready to master the art of making Wellington's iconic cheese scones at Pravda Café. Widely regarded as the home of the city's best cheese scones, Pravda's creations are so beloved, they often sell out before you can blink. Now, you can learn the secrets behind their mouthwatering scones firsthand.\r\n\r\nIn this hands-on workshop, you’ll be guided through mixing and preparing your own batch of Pravda’s famous cheese scones. Once your dough is ready, you'll hand them off to be baked to crispy flaky perfection. While they cook, relax with a cup of tea or coffee, and once your scones are ready, you’ll enjoy the fruits of your labour fresh from the oven.\r\n\r\nThe best part? You’ll get to take home the coveted recipe, allowing you to recreate these legendary scones in your own kitchen whenever you want. This is a perfect opportunity to learn a piece of Wellington’s culinary history and enjoy a deliciously rewarding experience."
  },
  {
    "labels": [
      "Food & Drink"
    ],
    "description": "“Holy Onion”. For the entire month, Cicio Cacio Osteria is getting brave and bold, celebrating the magic of vegetables in all their glory, especially the santa cipolla (aka the holy onion). \r\nVegetables bring colour, life and joy. In Italy, they mark the rhythm of the seasons, stir up cherished memories and signal the excitement of fresh beginnings. Come along and experience vibrant flavours with playful snacks, fun street food, freshly baked breads, handmade pasta and a brand new range of dishes that celebrate the beauty, bounty and simplicity of Italian cuisine."
  },
  {
    "labels": [
      "Food & Drink",
      "Hobbies & Interests"
    ],
    "description": "Join fragrance aficionado Benny Castles for an immersive journey into the WORLD of love, told through the art of scent. In this exclusive olfactive experience, indulge in small bites and sip on a glass (or three!) of something delightful, setting the perfect mood for exploring the emotional power of fragrance.\r\n\r\nOver the course of the evening, you’ll sample up to twelve unique fragrances, each one tied to a captivating love story that inspired its creation. Learn the intimate tales behind these scents and discover how they evoke the passions and emotions that shape our experiences of love. Whether you're a fragrance enthusiast or a newcomer, this sensory journey is sure to arouse your olfactory senses and deepen your appreciation for the art of perfume."
  },
  {
    "labels": [
      "Education & Learning",
      "Community & Culture"
    ],
    "description": "𝗡𝗭 𝗠𝗮𝗸𝗲 𝗧𝗼𝗺𝗼𝗿𝗿𝗼𝘄 𝗖𝗵𝗮𝗽𝘁𝗲𝗿 𝗦𝘂𝗺𝗺𝗶𝘁\nThe Educate Plus NZ Chapter is thrilled to invite you to our 2025 Summit taking place on Tuesday 19 & Wednesday 20 August at Victoria University of Wellington for the 𝗠𝗮𝗸𝗲 𝗧𝗼𝗺𝗼𝗿𝗿𝗼𝘄 𝗖𝗵𝗮𝗽𝘁𝗲𝗿 𝗦𝘂𝗺𝗺𝗶𝘁. This professional development opportunity will bring together Advancement Practitioners from across New Zealand, in Tertiary Institutions and Schools, all dedicated to shaping the future together.\nThe Summit, with sessions in Admissions, Alumni & Community Relations, Fundraising, Marketing & Communications, Leadership and People & Culture, will be more than just a learning experience—it will also be an opportunity to connect, collaborate, and share insights with professionals who, like you, are passionate about building a better tomorrow.\nThrough these engaging sessions, meaningful conversations, and shared ideas, you’ll gain the tools and inspiration to create the future you envision, supported by the collective wisdom and energy of the New Zealand Chapter community.\nDon’t miss this opportunity … Let’s Make Tomorrow —together.\n𝗘𝘃𝗲𝗻𝘁 𝗗𝗲𝘁𝗮𝗶𝗹𝘀\n𝗗𝗮𝘁𝗲: 19-20 August 2025\n𝗩𝗲𝗻𝘂𝗲: Rutherford House, 33 Bunny Steet, Pipitea\n𝗙𝗼𝗿 𝗳𝘂𝗹𝗹 𝗲𝘃𝗲𝗻𝘁 𝗱𝗲𝘁𝗮𝗶𝗹𝘀 𝗮𝗻𝗱 𝘁𝗼 𝗥𝗲𝗴𝗶𝘀𝘁𝗲𝗿, 𝘃𝗶𝘀𝗶𝘁 𝗼𝗻 𝗼𝘂𝗿 𝘄𝗲𝗯𝘀𝗶𝘁\ud835\df2: https://lnkd.in/gzamhZYU\n𝗙𝘂𝗹𝗹 𝗽𝗿𝗼𝗴𝗿𝗮𝗺: chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://lnkd.in/gWSXFQa8\n𝗧𝗵𝗮𝗻𝗸𝘀 𝘁𝗼 𝘁𝗵𝗲 𝗡𝗭 𝗖𝗵𝗮𝗽𝘁𝗲𝗿 𝗳𝗼𝗿 𝗼𝗿𝗴𝗮𝗻𝗶𝘀𝗶𝗻𝗴 𝘁𝗵\ud835\df2 𝘀𝗲𝘀𝘀𝗶𝗼𝗻𝘀: Emma Zigan, Angela Coe, Robert Brooke, Nicola Parsons, Jane Ball, Penny Curran, Martine Foster, Vicki Fowler, Georgia Harvey, Shelley Keach, Carolyn Prebble, Kirstyn Sandall, Aroha Webster\n𝗧𝗵𝗮𝗻𝗸 𝘆𝗼𝘂 𝘁𝗼 𝘁𝗵\ud835\df2 𝗡𝗭 𝗦𝘂𝗺𝗺𝗶𝘁 𝗦𝗽𝗼𝗻𝘀𝗼𝗿𝘀 𝗳𝗼𝗿 𝘆𝗼𝘂𝗿 𝘀𝘂𝗽𝗽𝗼𝗿𝘁 𝗼𝗳 𝘁𝗵\ud835\df2 𝗖𝗵𝗮𝗽𝘁𝗲𝗿: Giving Architects , Blueboat, fr&c, CCS Fundraising, EnrolHQ, Chapel & York, Roberts Digital\n𝗘𝗱𝘂𝗰𝗮𝘁𝗲 𝗣𝗹𝘂𝘀 - 𝗔 𝗡𝗲𝘁𝘄𝗼𝗿𝗸 𝗼𝗳 𝗔𝗱𝘃𝗲𝗻𝗰𝗲𝗺𝗲𝗻𝘁 𝗣𝗿𝗼𝗳𝗲𝘀𝘀𝗶𝗼𝗻𝗽ee𝗹𝘀\nNot a member? Visit www.educateplus.org to find out more!\n#EducatePlus #NZMakeTomorrow #EPChapterSummit "
  }
]