[
  {
    "description": "AR monthly Singaround,, AR Monthly Singaround. Bring songs, tunes or poems to share, or just come to join in. Now at our new venue. No charge for entry. Feel free to purchase tea, coffee, drinks and snacks at the\nbar. Held the third Wednesday of every month. ",
    "label": "Other"
  },
  {
    "description": "Site Visit - Studio of Pacific Architecture - Te Aro Double-Header!, Join us on Wednesday 20 August, for an exclusive NAWIC members-only site tour of two very different but geographically close projects in Te Aro. The National War Memorial and FPC Martin Square are both undergoing major refurbishment - join us for a look behind the scenes!\nNational War Memorial: Refurbishing a Wellington Icon\nStep behind the scaffolding and witness the National War Memorial Project – a complex seismic strengthening project where heritage sensitivity is of utmost importance. With construction works being carried out by Maycroft Construction, join us for the rare opportunity to explore a significant piece of the capital’s cultural fabric.\nKnown to many as the backdrop of ANZAC Day commemorations, this national memorial is undergoing a meticulous refurbishment to ensure its legacy endures for generations to come.\n What’s Happening On Site:\nSeismic strengthening of the tower and bell frame \nStone remediation to preserve its historic façade\nAsphalt roofing works\nThe real challenge? Balancing modern engineering with heritage preservation. Every upgrade is being carried out with deep respect for the building’s historical significance.\n\nThen, just around the corner, we will move on to another refurbishment project – at a much different scale and for a very different purpose!\n FPC Martin Square: from Workshop to Office Space\nLeading industrial design-and-build specialists First Principles Constructors are celebrating seven years of innovation with a bold move - into a brand-new headquarters in central Wellington. Take a look inside the transformation of a former engineering workshop into the new HQ for FPC. With exposed services, raw materials, and an industrial aesthetic, this compact yet clever refurbishment shows how much can be achieved in a small urban footprint. Construction is well underway by Aoraki Construction, with completion coming up in September.\nWhat’s Happening On Site:\n•     Structural steel installation, new roofing, cladding, a new concrete mezzanine slab\n•     Interior fit-out works\n•     Full building services upgrades\n The Details:\n🕒 DATE and TIME: Wednesday, 20th August, meet at 2.45pm for a 3.00pm start at the National War Memorial\n📍 LOCATION: Meet at the National War Memorial (19 Buckle Street) to explore this site first. We will then walk over to 21 Martin Square as a group, for the next site visit.\n🎟️ COST: Free to NAWIC members, with a maximum of 18 people on the tour, so please book your space consciously. Get in quick! You can join NAWIC here.\n👷‍♀️PPE: Hard hat, hi-vis, steel-capped boots. (Spare hard-hats/hi-vis are available if required, please make sure you advise us of what you need on your RSVP.)\n 🎉 After the site visits, unwind with drinks and nibbles sponsored by First Principles Constructors at a nearby venue (TBC) – a chance to connect, reflect, and chat all things design and construction.\n🧡 Huge thanks to Studio of Pacific Architecture, Aoraki Construction, Maycroft Construction, and First Principles Constructors for teaming up to make this event possible.\nPlease note: NAWIC is a voluntary organisation, committed to its obligations as a PCBU under the Health and Safety at Work Act 2015.   Amongst other things, this requires NAWIC to take all practicable steps to eliminate, isolate or minimize hazards that our event attendees are exposed to. Health and safety is a shared responsibility.",
    "label": "Other"
  },
  {
    "description": "Believe it Or Not Quiz Night!, Put your knowledge to the test at our \"Believe It or Not\" Quiz Night\n, hosted by Wellington’s best quiz master! Join us every week for an evening of fun, challenge, and unbeatable energy\n. Arrive early to make the most of Happy Hour from 4 PM to 6 PM\nwith great drink deals to kick things off. Gather your team, grab a drink, and see if you’ve got what it takes to claim victory\n! ",
    "label": "Other"
  },
  {
    "description": "CUPRA 3-Day Demo Sale, Get ready for the CUPRA 3-Day Demo Sale! For three days only, explore our demonstrator and approved pre-owned CUPRA vehicles at exceptional prices.\nBrowse a selection of Formentor, Leon Sportstourer, Ateca, and more.\nSaturday only: Step into our racing simulator, feel the thrill, grab a Red Bull, and then take a CUPRA performance car for a test drive.\nMake Saturday extra special with simulator fun, Red Bull, and cake – it’s not your usual test drive!\nStock is limited and deals are only available while vehicles last – don’t miss your chance to drive away in a premium CUPRA.",
    "label": "Other"
  },
  {
    "description": "Alimentary Trail Wellington EDITION, HIT THE ALIMENTARY TRAIL! It's a big ol' weekend in the Capital City, & while we can't be there in person, we WILL be there in 'beer' as our friends at Monkfish, LBQ & The Malthouse share new brews made right here. Keep an eye on their socials for time & availability! Cheers, everybody! ",
    "label": "Other"
  },
  {
    "description": "Pōneke Shanty Club sing-along at Welsh Dragon, Join us for two hours of sea shanty sing-along at Welsh Dragon. Music provided. All skill and experience levels welcome!\nListen to a playlist of favourite shanties and check out our songbook from our site: https://linktr.ee/ponekeshantyclub\nShanty Club meets every month on the 1st and 3rd Thursday. ",
    "label": "Other"
  },
  {
    "description": "FULLY BOOKED - Family Shiny - Akatarawa Forestt, Registrations open NOW\nWhat to expect\nThis is a “Family Shiny” trip into the Akatarawa Forest.\nNon members are welcome to join us but must register to obtain details of start time and location.\nVehicles must have a low ratio gearbox and must not be a 4wd car, station wagon or van, and if a soft top must have a roll cage.\nVisitor Registration- $20.00 per driver\nThere is no trip fee for this trip however non-members pay a “Day Membership Fee” of $20. This is payable in Cash to the Trip Leader on the day.\nThe trip should be relatively easy as it needs to cater for people just starting out and all types of 4wd vehicles – but a good way to see if you want to get into 4wding and a chance to meet some of our club members (if you are unsure if your vehicle is suitable just ask).\nNo Dogs Allowed sorry\nOnce you have completed 3 Family Shinys you can join the club but can only participate in Family Shiny or Touring Class trips. Once you have also done a Training Day and had your vehicle inspected by one of our approved inspectors you can come along on our other more adventurous trips. To find out more on how to join our club go to https://ccvcwellington.wildapricot.org/page-1725861.\nLike our Facebook page to find out about more trips and club nights. ",
    "label": "Other"
  },
  {
    "description": "Lawrence Arabia Is Playing A Solo Show, It’s been six years since he last released an album and, like Richard Prebble before him, Lawrence Arabia’s been thinking.\nWhen songwriters think, often the result is songs. It’s time to bring out some of these new thought babies from the writing suite and expose them to the light; let them photosynthesise and become real and alive in the world.\nThe Silver Scroll, Taite and Tūī winning artist brings his engaging show of (new and old) songs and talk, accompanied by guitar and keys, to Meow.\nWith support from Frances Grass. ",
    "label": "Other"
  },
  {
    "description": "On Repeat: Hamilton Party - Wellington, I'M PAST PATIENTLY WAITING\n\nTICKETS ON SALE NOW!\nbit.ly/HAMwell\nHAMILTON: THE MUSICAL PARTY!\nSATURDAY AUGUST 30\nSAN FRAN\nWELLINGTON\nDOORS AT 9PM\n18+\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSinging Hamilton all night in a club? YES THANKS!!\nTake a Break and join us in The Room Where It Happens for a Hamilton tribute Party!\nYou’ll Be Back for more as DJs play songs from Hamilton + all your favourite show tunes from all the best musicals + all your Best of Both Worlds faves Non-Stop!\nWe Know you won’t be able to Say No to This so we recommend getting in quick for tickets if you want to be Satisfied!\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSOUNDS LIKE:\nHamilton • Wicked • Six • Chicago • Waitress • In The Heights • Heathers • Rent • Hairspray • Grease • Les Miserables • tick, tick… BOOM! • Newsies • Spring Awakening • Dear Evan Hansen • The Book of Mormon • Sweeney Todd • Legally Blonde • The Phantom of the Opera • Mean Girls • Funny Girl • Little Shop of Horrors • West Side Story • Beauty and the Beast • The Sound of Music • Cats • The Addams Family • Company • Hadestown • Billy Elliot • The Prom • School of Rock • Cabaret • Dreamgirls • Shrek the Musical • Company • Hadestown • Billy Elliot• Annie • Come From Away • Merrily We Roll Along • Evita • Beetlejuice • Shucked • Kimberly Akimbo • Parade • Oklahoma • Moulin Rouge • Frozen • Matilda • Mamma Mia! • The Lion King • Rocky Horror Picture Show • Into The Woods • 13 • Aladdin • The Wizard of Oz + HEAPS MORE!\nThe Best of Both Worlds would like to acknowledge the traditional custodians of the land our events take place on and honour their Elders past and present.\nPlease read our company T&Cs carefully prior to purchasing your ticket - https://bit.ly/PurchaseTCs\nPlease note: Our events may feature moving and flashing lights. If you have photosensitivity or any related concerns, feel free to reach out to us with any questions! ",
    "label": "Other"
  },
  {
    "description": "Club Night - Fireside Chat with Mark and Gavin, it's all about the punt!, Ever wondered what’s really involved in lifting your chains, checking your blocks, and keeping your boat secure inside the harbour?\nCome along and hear Gavin and Mark share their knowledge — including Gavin’s tale of installing blocks for Revenue Cutter inside the boat harbour, and how a “mooring muscle boy” became a rocket!\nYou’ll learn:\nHow to inspect chains and spot potential issues\nWhy regular servicing (every 2 years) is the best protection in heavy winds\nThe story of the Punt — over 100 years old and still servicing moorings in Clyde Quay\nThe Mooring Punt isn’t a dark art — it’s a simple winch with rollers that does an important job. This is your chance to see how it works, ask questions, and even book a slot to have your mooring serviced so you can sleep well knowing your boat is secure. ",
    "label": "Other"
  },
  {
    "description": "2025 Mid Year Prize Giving, Hi everyone!\nCan’t wait to celebrate all of the leagues that have happened so far this year with prize-giving!!!\nThis is your chance to hang out, catch up with teammates and friends. Whether you’re a prize winner or just keen to socialise, everyone is welcome!\nPrize winners will receive bar vouchers to spend on the night (terms & conditions to come). So if you’ve snagged an award, make sure you're there to enjoy it!\nSorry under 18s, you’ll need a parent or guardian with you.\nCome along, grab a drink, and let's make the most of playing social frisbee\n",
    "label": "Other"
  },
  {
    "description": "Age of Sigmar @ Call to Arms 2025, It's a two day, 2,000 point Age of Sigmar event in Kilbirnie, Wellington!",
    "label": "Other"
  },
  {
    "description": "Toi Pōneke Market Lane Tours: CANCELLED, We’re excited to announce tours of the new Toi Pōneke whare at 3-6 Market Lane, Wellington. We will be occupying a portion of the building on the corner of Cable Street and Market Lane.\n\nBefore our new premises undergo a refit, we invite you to tour the interior of the building and see where the artist studios, arts offices and workshop space will be located.\n\nTours are available on Sat 30 Aug '25 at 11am, 12noon, 1pm and 2pm and Sun 31 Aug '25 at 10am, 11am, 12noon, and 1pm.\n\nThe re-imagined Toi Pōneke Moemoeā (Vision) is:\nHe kaiwhakatere i te tupu me te whanaketanga o ngā ringatoi o Te Whanganui-a-Tara\n\nA catalyst for the growth and development of Wellington artists\n\nOur new Toi Pōneke will create a vibrant space that nurtures collaboration, creativity and cultural exchange among artists of all generations using Tuakana-Teina Kaupapa. \n\nFor more information head to the Toi Pōneke website.",
    "label": "Other"
  },
  {
    "description": "Sunday Social - August- Wave goodbye to Winter, SUNDAY SOCIAL SESSION 31 August 3-5pm\nWave goodbye to Winter. The August Sunday Social is on the last day of Winter. Come join us for another Sunday Session at - The Garden Room - 90 Ghuznee St. Behind St Peter's Church under the appartments on the corner of Victoria and Ghuznee St - from 3-5pm.\nAs usual there will be a mix of Lindy, Balboa and Blues we would love to see you. This is a child friendly, super relaxed and fun event for all – there will be music for everyone.\nSunday Social Session 31 August\n3-5pm\n$5 on the door\nLooking forward to dancing with you! ",
    "label": "Other"
  },
  {
    "description": "Lacuna Presents - Us Two tickets, Presented by: Lacuna\nUs Two is a high-energy house DJ act from the Midlands, UK, with releases on some of the world's most respected labels including Knee Deep In Sound, MicroHertz, and Eastenderz. Known for deep grooves, rolling basslines, and infectious crowd connection, Us Two has earned support from global heavyweights like Marco Carola, Jamie Jones, and Skream.\nFrom European festival stages to Ibiza's 528 for a standout set with Knee Deep In Sound, Us Two's sound blends underground credibility with dancefloor-ready energy.\nHis latest release, \"Simulation\" (featuring Franksy), drops on Pete Tong's TSZR label, and has already earned plays from tastemakers like ANOTR, SG Lewis, LF SYSTEM, and SOSA, with early reactions going wild at Music On (Pacha Ibiza) and beyond.\nFor Lacuna, hosting Us Two’s debut in Wellington is about more than a headline — it's personal. We're thrilled to finally bring a dear friend's sound to our city and invite you to feel the energy first-hand on Saturday, 20 September 2025, at Meow Nui.\nPackages",
    "label": "Other"
  },
  {
    "description": "Jonathan Crayford - Bikes in Space tickets, Presented by: Jonathan Crayford\nJonathan Crayford introduces his latest project 'Bikes In Space' an electronic vintage keys and drums driven fully improvised groove space junk ensemble that sounds like what it might be like to be in the brain of Philip K Dick, Ursula Le Guin or Margaret St Clair - except more. After a 2 month tour of Auckland, they hit Nui with added punch to the drums featuring Riki Pirihi and Julien Dyne.\nJonathan Crayford keys, Joe Kaptein keys, Riki Pirihi drums, Julien Dyne drums.",
    "label": "Other"
  },
  {
    "description": "Welcome to Welly! Twofold Wellington Tap Debut, Our friends are coming down from Auckland and bringing with them some amazing beers rarely seen in Welly!\nPouring for the FIRST TIME outside of Auckland it's Twofold straight outta Parnell!\n- Primary Lager\n- SpeedDial IPA\n- Hoogah Czech Dark Lager\n- Lawn Dog Hazy Pale Ale\n- Wickham's Best Bitter on Handpump\nReturning for another rare Welly appearance its St. Leonards!\n- Raspberry Sour",
    "label": "Other"
  },
  {
    "description": "Live 4 The Weekend-Thursday Nights, The weekend starts now!\n\nExperience the ultimate midweek drop every Thursday night from 9pm till late at The Garden Hotel where we Live 4 the weekend!\n\nThis is Wellingtons Thursday night club night, featuring Dj Kakapo on the turntables. Escape the week and let the rhythm and baseline reset your energy with the sound of house and drum&bass on the Kinky Soundsystem.\n\nFree Entry",
    "label": "Other"
  },
  {
    "description": "Burlesque Baby August 2025, A fun and entertaining evening full of a fantastic variety of performers. Burlesque Baby showcases some of the greatest new talent that Wellington has to offer.\nThis fabulous show on Saturday 23 August is not something to miss... Tickets regularly sell out, so get in quick to avoid missing out.\nDoors open at 7, show starts at 7:30pm\nGeneral Admission: $30\nFront Row Seating: $35 (limited)\nFront Row Table Seats: $40 (very limited)\n(plus eventfinder booking fee)",
    "label": "Other"
  },
  {
    "description": "Argentina v All Blacks, Big match, big breakfast.\nThe All Blacks face Los Pumas this Sunday live from Buenos Aires\n– we’re serving breakfast from 8am and kick off is 9.10am. Watch it live with us!\nTo book your table and guarantee your spot for breakfast, message us or head to our website to book there:\nhttps://www.welshdragonbar.co.nz/reservations ",
    "label": "Other"
  },
  {
    "description": "Move and Connect, Join us to connect with other mums, move your body while you enjoy a drink and kai. Koha on entry.\nRegister your spot at: Madeleine@peopleskillsconsulting.co.nz\n- suitable for beginners- intermediate\n- must be at least 8 weeks postpartum with medical clearance\n- prams welcome!\n\n",
    "label": "Other"
  },
  {
    "description": "Composer Series Jam: Duke Ellington, Step into the timeless world of Duke Ellington at the Composer Series Jam!\nJoin us as we celebrate one of jazz’s greatest composers with an evening of swinging tunes, lush harmonies, and inspired improvisation. From iconic classics to hidden gems, this jam invites musicians and listeners alike to dive into Ellington’s genius and keep his music alive.\nCome down to Undercurrent on Wednesday 27th August at 7pm – Koha entry, all welcome.\nHouse band: Oscar Lavën, James Illingworth, Dan Yeabsley, Mat Enright. ",
    "label": "Other"
  },
  {
    "description": "Back In The Day feat. Nick Collings| Wellington Show | Aug 30th, Wellington – Are You Ready to Go Back in the Day?\n\nSignature Socials proudly presents:\nBACK IN THE DAY\n\nA night of dancefloor nostalgia, epic classics & feel-good vibes.\nOTTO, 125 Featherston Street\nSaturday, 30th August\n8:00 PM till late\nHeadlining:\nNick Collings (Auckland) – Spinning the greatest dance anthems from then 'til now!\nWith support from:\nAlopex\nAshwynz\nMr. Thicket B2B O’Sea\nTompy\nWhether you lived it or missed it, this night is all about celebrating the golden days of dance music. At Signature Socials, it's always about good music and even better vibes.\nTickets available now on Flicket\nDon’t miss your chance to relive the magic – see you on the dancefloor! ",
    "label": "Other"
  },
  {
    "description": "Lazy Friday Night, Join The Young Once for a fantastic night of great music and dancing, featuring all of your favourite hits from the 1950s and 60s.\nPut on your dancing shoes and dance away the winter blues.\nBring your family and friends for an evening of great food and entertainment.\nHelp us spread the word!\nClub membership is not required. Just sign in at reception and say you're here to see The Young Once band.\nCheck out the videos on our Facebook page for a taste of our music.\n",
    "label": "Other"
  },
  {
    "description": "Quintessential Quiz for Kaibosh! Mövenpick Hotel Wellington, Gather your friends for a great night out in support of Kaibosh at the beautiful Mövenpick Hotel Wellington in partnership with SKÅL Wellington.\nIf you're a fan of our Kaibosh Quiz Night for Cheats of the past, the Quintessential Quiz is still for cheats - a glammed-up version!\nDATE: Thursday 4 September\nTIME: Doors open: 6:00 PM\nQuiz starts: 6:30 PM sharp\nVENUE: Mövenpick Hotel Wellington, 345 The Terrace (venue generously donated by Mövenpick)\nHOST: The evening's MC will be the incredible Erin Rush, VP of NZ Rugby and former Black Fern.\nGreat prizes for top teams. Awesome raffle prizes to be won\n\nCome along for quizzical fun and fundraising - with all proceeds from the quiz going direct to Kaibosh to help us provide healthy, rescued food to people in need in the Wellington region.\nHOW TO ENTER\nTeams of 4\n$120 per table\nLimited tables available – book early via Humanitix! Hit the ticket booking link above\nhttps://events.humanitix.com/quintessential-quiz-for...\nDon't worry if you don't have a team yet, we can connect you with others on the night. You can buy an individual ticket at $35.00 pp.\nWHAT TO EXPECT - QUIZ FOR CHEATS\n\nFive rounds of 10 questions\nChoose your bonus round – earn double points!\nIt’s a Quiz for Cheats – so you can buy up to 6 correct answers to boost your score!\nFOOD & DRINK\nDelicious food and drink will be available to purchase throughout the evening.\nLOCATION & PARKING\nMövenpick Hotel Wellington is at 345 The Terrace.\nThere is very limited street parking.",
    "label": "Other"
  },
  {
    "description": "DRAG BINGO with Homer Neurotic @ Dirty Little Secret, This is not your grandma’s bingo night. Wellington’s resident sad boy and pint-sized powerhouse, Homer Neurotic, is taking over the rooftop at Dirty Little Secret for a night of unhinged chaos, cocktails, and camp realness.\nGet ready for an evening dripping in glamour, glitter, and glorious nonsense as you soak up the skyline views from one of the capital’s most iconic rooftop hideaways.\nWhat to expect:\n• Free entry, all you need is a table booking and good vibes\n• Over $200 worth of prizes, including a $100 bar voucher for the grand winner\n• Spot prizes, cheeky antics, and bad decisions encouraged\n• Live drag performances that’ll leave you confused, flustered, and deeply entertained\n• Dad jokes, dance-offs, and plenty of double entendres\n• Drink and kai specials to keep you going\n• After the Bingo stick around to boogie down with one of the resident DJ’s, spinning your tracks all night long\nBookings essential:\nTables available from 7.00 pm with balls dropping no later than 7.30. Walk-ins are very limited so grab your spot now:\nhttps://dirtylittlesecret.co.nz/events/drag-bingo/\nSafe and inclusive:\nDirty Little Secret is proudly LGBTQIA+ friendly. Our staff and security are trained to make everyone feel welcome and safe. Elevator access is available, but some tables are on raised flooring, so please reach out if you have accessibility needs and we’ll make sure you’re well looked after.\nHeads up:\nThis is an R18 event. Expect colourful language, cheeky antics, and wholesome masculinity served with a side of mischief. Consider yourself warned.\nFollow me for more nonsense:\nFind me on Instagram at @homerneurotic for a peek behind the scenes and more of the drama, glitter and tears. ",
    "label": "Other"
  },
  {
    "description": "WJC presents Randel, Harris, Lockett The Intruders, The Intruders are Wellington’s very own chordless powerhouse. Mark Lockett, Jack Harris and Isaac Randel have come together to form a trio designed to intrude.\nThe Intruders will take you from beautiful subtleties to time warping, confrontational swing.\nPlaying a mix of standards and originals, you’ll hear the music of Ornette Coleman, Mark Lockett, Steve Grossman, and Isaac Randel.\nThis upcoming group is surely one of a kind that is not to be missed. ",
    "label": "Other"
  },
  {
    "description": "2025 Prize Giving, It's nearly time to celebrate another great season of rugby.\n4pm - Doors open\n4.45 sharp - Awards start\n4.45 - Teams/whānau eat at their tables\nPotluck dinner. Please bring kai and non-alcoholic drinks to share with your team.\nAfter the awards and dinner it'll be time to mix and mingle and for the kids to have a boogie on the dance floor. ",
    "label": "Other"
  },
  {
    "description": "Spring Floral Display Accessible Self-Drive Tour, Gather your friends, whānau, or neighbours who might find it tricky to access the gardens, and enjoy a relaxing, self-guided drive through a spectacular spring floral display at Wellington Botanic Garden ki Paekākā.\n\nSimply drive along the one-way route past the Display Garden and soak in the colours of tulips, forget-me-nots, dianthus, primulas, chrysanthemums, daffodils, and more.\n\nHow it works:\n- No registration needed — just turn up and enter through the Glenmore Street gates.\n- Follow the designated one-way route through the gardens, keeping within your vehicle at all times.\n- Exit through the West/White Gate to return to Glenmore Street.\n- Feel free to enjoy the route as many times as you like during opening hours.\n\nPlease note:\n- Drive slowly (maximum 10 km/h), and watch carefully for pedestrians, especially children.\n- Stay in your vehicle for the entire tour to keep everyone safe and comfortable.\n- Follow all signage and do not turn around within the garden grounds.\n\nThis event is self-guided and unstaffed. If you need assistance during your visit, please call 04 499 1400.\nFor enquiries, email treehouse@wcc.govt.nz or call 04 499 1400.",
    "label": "Other"
  },
  {
    "description": "Box of Birds, Hailed as \"the cutest little show in Aotearoa\" (Hamilton Arts Festival 2024), award-winning theatre company Birdlife Productions have created this gorgeous theatre show designed especially for ages 4 to 9 years, Including exquisite puppetry, live interactive songs, projection and the teaching of a waiata, this work reflects our transformative connection to nature. Peter is reluctant to stay with nanna in the school holidays because she lives in the country and doesn't have a TV but Nanna finds ways to engage Peter in her love of the forest, especially the precious manu, when they build a nesting box for Ruru together. Peter is excited to see if Ruru will make her home in the box, waiting patiently while many other birds arrive to check out the box first! And after all that waiting, Nanna takes Peter on an exciting night time forest walk to find Ruru - in the dark! The bird characters are all familiar New Zealand locals, such as piwakawaka, kereru, tui and ruru, and the story highlights the importance of supporting them and the different needs they may have. Teachers and Parents have been ecstatic about this show and hundreds of New Zealand children have been transfixed by it.\nAs quoted by Theatreview: “This is truly a New Zealand show for New Zealand children and all those young-at-heart”.",
    "label": "Other"
  },
  {
    "description": "MESSIE - Wellington, MESSIE is taking Aotearoa’s electronic dance music scene to filthy new levels. As a former drummer, her passion for drumming was the pipeline for her falling in love with genres like Garage, Breakbeat, and Jungle. She has since expanded her sound and it’s safe to say each set will keep you guessing what will come next as she effortlessly merges genres such as Baile Funk, Ghetto Tech, Jersey Club, Juke, Afro beat inspired drums, Techno and many more global club soundscapes that encompass her high energy DJ sets. MESSIE’s sets are guaranteed to be bootleg heavy with something for everyone as she draws from her own music taste of rap and grime, to early 2000’s singalongs, girl-boss anthems and queer music culture in the form of edits you’d never expect.\n\nAlongside her headline tour around Aotearoa in mid 2024, MESSIE has now brought her fresh, high-energy club music to Glastonbury, Reading & Leeds, R&V, Beyond The Valley, Wildlands, Love Saves The Day, Gemfest & Outro Festival. With slots at Pohoda Festival, Hidden Festival, Motion, Truck Festival, AIASOUND and All Points East locked in for the second half of 2025, there is no slowing her down.",
    "label": "Other"
  },
  {
    "description": "The Night is Always Darkest, From the makers of Don't Wake Me Up and One Night Band, The Night is Always Darkest returns after a soldout season at NZ Fringe!\n\nSpend a night with Lia as she fills the sleepless hours of the morning in real-time. Get to know her and influence her decisions in this award-nominated durational theatre experience.\n\nAttend the show live at Two/Fifty Seven Willis Street or tune into our live streams on Twitch and YouTube. Show starts at 11:59pm on Saturday 20th September and runs for 7 hours.\n\n“an incredibly audacious show.”- Theatreview\n“a vital theatrical experience.”- Theatreview\n\nFinalist- Most Innovative Work, NZ Fringe 2025\n\nCreated by\nLia Kelly\nIzzi Lao\nRosie Glover\nAustin Harrison\nCampbell Wright",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Toi Whakaari Open Day 2025, Nau mai, haere mai! We are pleased to open our doors on Friday the 22nd of August, 2025 for our annual Open Day!\nEach year Toi Whakaari takes part in the Wellington Tertiary Open Day, inviting prospective students and their whānau and support people to explore our campus, meet staff and enquire further about our study pathways.\nParticipation in our Open Day includes a campus tour, followed by a Q&A session with staff from various programmes.\nTour times are 9.30am, 12.30pm & 3pm.\nThere will also be opportunities to watch student works in development before or after each tour time, as part of our annual Festival of Work in Development.\nYou must register to attend by filling out the online form here:\nhttps://form.jotform.com/251820153827859 ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Wilton Playcentre Open Week, Nau mau, haere mai! Come along on session and meet the crew. Each day for Open Week we run a different theme. You are welcome to come for each day, or just pick one. The theme of Playcentre Open Week this year is “Whānau tupu ngātahi – families growing together.”\nWe ask that you please bring a change of clothes, and a nut-free snack for your tamariki. Come along for as much or as little as you can. We are all parents so we know what it is like to work around sleep schedules and cajoling little ones to get out of the house. Come have a cup of tea and relax knowing your child is playing safely and having fun.\nMonday - Hand prints (TBC)\nTuesday - Animal day! note no actual animals involved. Play themed around animals\nWednesday - Pāua playgroup for 2's and under will be cacao husk play\nThursday and Friday will make a decision on the week about the weather. One of the days will be Sandpit and the other day will be\nobstacle course. We will update you via this page\nMonday 9.00am - 12.15pm\nTuesday 9.00am - 12.45pm\nWednesday (younger tamariki) 9.00am - 12.15pm\nThursday 9.00am - 12.45pm\nFriday 9.00am - 12.45pm ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Beervana 2025 presented by Liquorland, Raise a glass and celebrate the best of beer at Beervana 2025!\nThis August 22 & 23, taste your way around the brews of Aotearoa and abroad. Explore epic stalls, taste uniquely brewed beers, chat to the brewers and catch up with mates, as top notch entertainment and music keeps the good vibes rolling.\nBeervana is possible thanks to our presenting partner Liquorland, and our incredible sponsors.\nEvent sessions:\nSession 1: Friday 22 Aug, 11am–4pm\nSession 2: Friday 22 Aug, 6pm–11pm\nSession 3: Saturday 23 Aug, 11am–4pm\nSession 4: Saturday 23 Aug, 6pm–11pm\nMore details at beervana.co.nz\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Island Bay art auction and art weekend, The biennual Island Bay Art auction and art weekend at Island Bay School is happening 22–24 August, and we can’t wait to showcase some incredible artists!\nLive art auction: Friday 22 August, doors open 6.30 pm, auction at 8.00 pm\nArt on display and for sale: Saturday 23 and Sunday 24 August, 10.00 am to 3.00 pm.\nGet the dates in your diary and stay tuned as we reveal some of the fabulous talent involved. This is one community event you won’t want to miss! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Orongorongo Monthly Trip - Family Shiny, Spaces still avaliable\nThis is a \"Family Shiny\" trip into the Orongorongo Station. Non members are welcome to join us but must register to obtain details of start time and location.\nThere is a land access fee of $20 for this trip. Non members also pay a $20 \"day member\" fee, this is payable to the trip leader on the day.\nVehicles must have a low ratio gearbox, not be a 4wd car, station wagon or van and must have a roll cage if a soft top.\nNo Dogs Allowed.\nNote spaces are limited\nIf you want to know more about how to join our club then go to our website. https://ccvcwellington.wildapricot.org/page-1580083.\nLike our page to find out about upcoming trips for the public ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Taste of Croatia: Fritule on Sun 24 Aug, Come along this Sunday 24 August at 2-4pm to enjoy fritule, a traditional Dalmatian festive dessert, often cooked at Christmas.\nFritule are one of the most requested recipes we’ve had for Taste of Croatia, so come down this Sunday when Danica Rudelj will be sharing her recipe!\nDanica will be making her dough beforehand, which will mean we will have more time to enjoy eating it.\nThe event picture is of Jamie Oliver’s version.\nLet Dave Guerin know if you’re coming to the 24 August session at dave@ed.co.nz or 021 404 334. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Launch celebration & open day!, This is it, we're finally launching! Cahoots Workshop will be officially open from 6th September and we're celebrating with an open day! All genders are welcome to come and look around our beautiful new space on this day! We'll have signups, kai and lots of excited folks! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Miniature of the Month - Showcase Day, Come and celebrate the joy of painting with our Miniature of the Month Showcase Day.\nBring down your painted Space wolves Blood Claw or any other painted Miniature of the Month anytime up until 12pm on Saturday the 5th and we will put them on display in our cabinet.\nInvite/Tag friends and family to visit Warhammer Wellington Saturday and vote for there favorite entry & we'll take photos of all the entries and post it up on our Facebook page so you can share with your friends and family. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "One Match Wellington, ONE MATCH CHALLENGE, Wellington dojos Poneke, Wellington, Hutt Valley and Mid City dojos are combining to put together an opportunity for students to compete against an opponent of equal calibre. Register with your instructor if interested. The deadline is July 25.\nEvent to be held at Mid City Kyokushin, Porirua on Sat, Sept 6, 1pm. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Pride in Place: creating a community walk tour, Join the team from Walk Tours NZ for a free and inspiring presentation on how to create and run your own non-profit community walk tour.\nOver the past seven years, Walk Tours NZ has delivered more than 100 community tours around central Wellington, focusing on the city’s rich LGBTQIA+ Rainbow heritage.\nThis event goes behind the scenes of creating a walk tour and is perfect for anyone passionate about bringing place-based history to light – whether it’s Rainbow histories or a topic of your own choosing.\nHosts Roger Smith and Gareth Watkins will guide you through the key ingredients of a successful non-profit walk tour – including identifying interesting stops, crafting compelling narratives, and being an engaging host – even if you’ve never done it before!\nThe presentation will cover both traditional methods of researching and writing, as well as demonstrate some off-the-shelf Artificial Intelligence applications that can help support your storytelling.\nBring your curiosity, enthusiasm and ideas, and discover why walk tours offer a unique form of living history – and how the experience can build community and connect people. No previous walk tour experience is necessary, and all are welcome.\nThe Queen Elizabeth II Pukeahu Education Centre (formerly the Home of Compassion Crèche) in Pukeahu Park has limited space, so registration is essential.\nPlease register here: https://walktours.nz/book\nThis free community event is part of the Aotearoa Festival of Architecture 2025, organised by Walk Tours NZ in collaboration with the New Zealand Institute of Architects (Wellington Branch).\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Wainui Junior Rugby Prizegiving, Join us to celebrate our 2025 season!\nMake sure you arrive early to grab a seat, formalities will kick off at 2pm followed by kai and bouncy castle fun for our tamariki.\nPlease note prizegiving is for our Year 0/1-Year 8 grades.\nPrizegiving for our nursery tamariki will take place after the last nursery session on August 30. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Great Sounds Great festival 2025, Eyegum Music Collective presents GREAT SOUNDS GREAT, a multi-venue music and arts festival taking over Pōneke's Cuba Street precinct for one night only on Saturday 6 September 2025. Showcasing 40 of Aotearoa's best artists across 10 neighbouring venues, this is one big party you shouldn't miss.\nEyegum has worked hard to curate a programme that is sure to offer something for everyone, from first time gig-goers to seasoned live music obsessives. The eclectic lineup includes perennial indie maestros The Bats, capital hometown heroes The Phoenix Foundation, hip hop superstar JessB, troubadour-turned-party starter Anthonie Tonnon, captivating genre-bender Reb Fountain, the incredible local-by-way-of-Naarm Jen Cloher, plus a selection of up-and-coming artists handpicked from Eyegum's Free Wednesday weekly showcase series, and everything in between. There will also be plenty more to be announced soon.\nExcitingly for 2025, we will be adding three new venues: St Peter's on Willis, Flying Nun Records and 13 Garrett Street (sponsored by Radio Active), as well as a travelling electronic stage curated by Tonic Collective. This means more artists and music to experience in a variety of special and unique spaces throughout the night.\nTicket holders will receive a wristband that will give them access to each of the participating venues throughout the event. Information on how to pick up wristbands will be provided to ticket holders closer to the time.\nTickets are on sale now at eyegum.co.nz/great-sounds-great\nWhen: from 4pm Saturday 6 September 2025\nWhere: San Fran, Meow, Valhalla, Rogue & Vagabond, Bedlam & Squalor, Hotel Bristol (2 stages), St Peter's on Willis, Flying Nun Records, 13 Garrett St\nWho: The lineup will include Anthonie Tonnon, Baby Zionov, Bad Taste, BADTAB, Baeoli, Bathysphere, The Bats, By A Damn Sight, Cindy, Eveline Breaker, Goya, Half/Angel, Hans Pucket, Iris Little, Jazmine Mary, Jen Cloher, JessB, JHL, Jim Nothing, Jordan Hamel, Leah Dodd, LEAO, Louisa Nicklin, The Phoenix Foundation, Reb Fountain, Rebecca Hawkes, Shayne P Carter (solo), Sig Wilder & Friends, Sofia Machray, Space Bats, Attack!, The Spectre Collective: live-scored cinema, Star Time, plus more artists to be announced soon. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "OA @ Cuba St Tavern, The awesome humans at Cuba St Tavern will be hosting us along side some of the best NZ Selectors !\nExpect the usual high standards of production and elite flavors of House and Techno\nHere's your line up :\nFortuna w Blvir\nNot My Sister\nJamie Rose\nK-otiK b2b Ryan C\nAlopex\nCyril Orson\nKicking off at 4pm\nSee you on the floor !!! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Club Open Night, This is your invitation to discover the Royal Port Nicholson Yacht Club. Wellington Ocean Sports graduates, members, ex-members and potential members are all welcome to come down, invite family, friends, colleagues and neighbours to experience what RPNYC offers on a Friday night. Caro’s Pizza will be on the menu, bar will be open from 5pm so join us for a fun night catching up. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Beginner jewellery-making in 8 weeks: Mondays - Wellington, Our popular weeknight classes are the best way for beginners to get into jewellery making in a lively, warm and friendly environment. The block starts on Mon 25 August and runs for 8 weeks until Mon 13 October, 5.30pm - 8pm.\nThe stone setting process teaches you many fundamental techniques in one project!\nWe start with basic ring making in copper or brass, students will learn measuring, texturing, shaping, cutting and soldering.\nThen we move on to making a practice ring set with a cabochon stone (cabochon means it has a flat bottom and a smooth domed top).\nOnce your first setting is completed you can move to working in silver and produce another stone set ring with more interesting design elements.\nCourse fee $440, early bird $396 till 27 July.\nIncluded in the class fee are a copper and brass pack for practising on, a sterling silver pack, 2 gemstones and all consumables such as sandpaper, solder and chemicals. Extra metals and materials are available for purchase in the studio. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Premier (Trevor Rigby Cup) Final HIBS 1st XI vs Scots 1st XI, Premier (Trevor Rigby Cup) Final.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "WECG ANNUAL GENERAL MEETING 2025, ANNUAL GENERAL MEETING\nTena Tatou Katoa, Greetings Everyone\nA WARM INVITATION TO ALL TO ATTEND THE 2025 AGM OF THE WAIKANAE ESTUARY CARE GROUP INC\nVenue: The Otaihanga Boating Club, Makora Rd,\nOtaihanga\nDate & time: Wednesday 3rd September at 7pm\nSpeaker Mike Joy - see Bio below\n\nMike is a Senior Research Fellow and Lecturer in Environmental Science at the School of Geography, Environment and Earth Sciences, Mike’s research includes ecological modelling, freshwater bioassessment, environmental policy, biophysical limits to growth and the role of energy in society. He is publicly outspoken about the decline in freshwater quality and ecosystems, especially the impact of nutrient pollution from intensive dairying on New Zealand's \"100% Pure\", clean, green image.\nMike is an outspoken advocate for environmental protection in New Zealand and for this has received several awards including an Ecology in Action award from the NZ Ecological Society, the Charles Fleming Award for environmental achievement in 2013 and in 2023 the Callaghan Medal for science communication from the Royal Society of New Zealand. In 2015 he was awarded the Morgan Foundation inaugural River Voice Award and in 2017 the inaugural NZ Universities Critic and Conscience award. His book 'The Fight for Freshwater' is a memoir that provides a rare first hand look at those whose voices question the health and future of our waterways.\nThe Meeting will conclude with supper and korero\n\n\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Heaven & Earth: Celebrating 25 Years of Bold Sounds, Heaven & Earth marks 25 years of Stroma’s fearless exploration of sound and spirit since our inaugural concert Wind, Rain & Light in August 2000. We recall the theme of that first concert by similarly evoking musical impressions of the earth below and the sky above. Featuring a world premiere by New York-based NZ composer Leila Adu-Gilmore, the programme includes Olivier Messiaen’s ecstatic Louange à l’immortalité de Jésus, Gemma Peacocke’s Sky Fields, John Rimmer’s Where Sea Meets Sky 2, Michael Norris’s new piano trio The Spaces In Between, and—to mark the recent passing of Sofia Gubaidulina—her meditative Garden of Joy and Sorrow. Come join us in celebrating a quarter century of intrepid sonic exploration from the musicians of Stroma. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Tawa hockey Club 2025 AGM and Prizegiving!, Join us to celebrate the 2025 Hockey season, and the successes of our teams and it's members.\nWe will start with the AGM, presented by the committee to update on the work taken place this year, to present the financial statements, and vote on Committee members.\nif you have any nominations for a member of the club to join the Committee, please email tawahockeyclub@gmail.com before 30 August. Please enquire with the individual before putting their name forward.\nFollowing a short break, we will then move into our prize-giving presentation.\nSubsidized drinks and some food will be provided.\nSee you there!\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Extraterrestrial Medicine Doctors / Thomas Arbor, Please join Isaac Smith and Erika Grant as they become Extraterrestrial Medicine Doctors - channeling the right sounds to heal your ailment.\nIsaac Smith is a lover of layered listening, sound presence, believer in the unseen, patient perseverer on a way that is straight. Sublime, Eternal, All Knowing, we ask for your help.\nErika Grant is a musician and astrologer with an interest in the healing properties of sound for mental and physical wellbeing, which she currently explores through her gong bathing practice.\n\n(Image credit: Unarius Academy of Science)\n--\nThomas Arbor makes sparkling, lush and layered electroacoustic soundscapes from samples, synths and voice.\n\n\nwww.sonorouscircle.com/thomasarbor\n$15 presale tickets available via UTR\nSpecial thanks to CNZ for supporting Pyramid Club's programme ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Late Night Mass for Young People, This month’s Late Night Mass for Young People will be on 5th September! So clear your calendar to celebrate the Eucharist with young people from across Wellington and let’s fill up the Cathedral!\nSacred Heart Cathedral\n5th September\n8pm\nWe’ll see you there!\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Kult presents act II : Red square, KULT – ACT II\n\n5th September 2025 |\n11pm till late�\nRed square, 26 Blair street, Wellington\n\nYour favorite techno takeover is already back for the ACT II. We hope everyone is ready for this new edition. New artists, evolving sounds and deep energy during a night of madness.\nKULT is a tribute to electronic music, a night where local techno artists meet the raw energy of Europe’s rave culture, and where we could all celebrate what matters.�KULT is more than a party – it’s a moment of sharing, an techno and mesmerizing experience built on freedom, inclusivity, and the love for music.\nThis time, we take the control of the @redsquare for a night that you will remember.\nLINE UP TBA\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Everyone Out Open Mornings - Belmont, Everyone Out Open Morning\nCurious about Nature School? Come along to one of our upcoming Open Mornings to see a session in action, meet our kaiako, and get a feel for the learning and play that happens in the bush.\nBelmont – Wed 27 August, 10.30–11.30am\nPaparangi – Tues 2 September, 10.30–11.45am\nIsland Bay – Thurs 4 September, 10.30–11.45am\nThese free sessions are perfect for whānau considering Nature School in Term 4 or 2026—or just wanting to explore what we do. Parents stay onsite with tamariki, and you’re welcome to come without tamariki if that works best.\nSpaces are limited – RSVP now to Rachel@everyoneout.co.nz or via our booking site\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Vinyasa flow yoga\non Thursdays, Join me for Vinyasa flow Thursdays Yoga\nclasses\n\nCome along to Ale's yoga classes for some fun and accessible weekend movement\nAle offers a vinyasa flow style class that caters to all levels of ability with supportive modifications and encouraging amplifications.\nOpen to everyone. All levels welcome\nBring your mat or Mats are also available if you are in need.\n$20 per class. Pack of 5 classes $95 or 10 classes $190.\nNamaste,\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "SCHOLASTIC BOOK FAIR, SCHOLASTIC BOOK FAIR\nAs part of Book Week, the Scholastic Book Fair will be held in Room 13\nWednesday 3 September: 2.45pm - 3.30pm\nThursday 4 September: 8.30 - 9.15am / 2.45pm - 3.30pm\nFriday 5 September: 8.30 - 9.15am / 2.45pm - 3.30pm\nThere will be Raffle tickets available at the Book Fair - Bring Cash!\n\nBAKE SALE\nWednesday 3rd after school outside Room 14.\nThere will be many scrumptious items available for purchase as part of the Book Week Bake Sale.\nCome and grab a treat while purchasing your books at the Scholastic Book Fair. Bring Cash !\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Sam Bambery - Live at Vogelmorn Upstairs, Sam Bambery is an artist and impresario from Ōtautahi/Christchurch, currently based in Naarm/Melbourne. Exploring his love of semi-psychedelia through a twisted folk-rock lens, Bambery writes effectual and spacious songs burrowing into emotional identity and exhaustion. His sophomore album Rubricator released in 2024 with micro-label Under Underground Records, edging at outsider-pop influence.\n\n\"...very considered, like Bambery lived with the album in his head for a while before bringing it into the world...a hint of mystery hangs over things...it's as ornate as these well-crafted tunes\" - Tony Stamp, Radio New Zealand",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Ravel’s opera 'L'enfant et les sortilèges', New Zealand School of Music Classical Performance students present four performances Ravel's engagingly magical opera 'L'enfant et les sortilèges' at the Hannah Playhouse directed by Sara Brodie, conducted by Martin Riseley with the New Zealand School of Music orchestra.\nPerformed in French with surtitles, the show is suitable for all ages. The story involves a 'child' (L'enfant) whose awful behaviour brings an unexpected response: first the furniture rebels, the grandfather clock, the broken china cup, then the mathematics tutor and the Princess in the fairy tale book come to life, and eventually all the animals in the garden - squirrels, dragonfly, birds rise up - all of whom have good reason to 'teach the child a lesson'. It's a fabulous journey that we go on with the child who is confronted by all of these and indeed learns...\nThis is a project involving the whole of the Classical Performance programme: the voice students sing all the roles, each performing several roles, the NZSM orchestra will play for the performances, and the piano students are taking part as rehearsal pianists (répétiteurs) and playing in the orchestra.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Blue Moon and Friends, 3, 2, 1... TAKEOFF!!\nOne small gig for man, one giant gig for mankind - we are landing at MOON in Newtown, Wellington.\nAnodine, Homie Gi Gi and Blue Moon. A night of Jazz, Rock and Pop on the dance floor.\nLooking forward to it people. The prophecy has been spoken and the stage has been set.\n9PM - 12AM on the 5th of September\nClear your calenders, book your tickets and tell your friends. This is it. The time is now. Let the games begin.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "2-Day Kali Seminar with Stephen Brown from Inosanto Academy in CA, Want to learn the exact martial art skills as used in the Bourne films? Wellington this is your chance...\nTactical Survival Academy is hosting Senior Instructor Stephen Brown from the renowned Inosanto Academy of Martial Arts in Marina Del Rey, Los Angeles!\nWith over 40 years of martial arts experience and 36 years training under Guro Dan Inosanto, Stephen is one of only two instructors currently teaching Kali classes at the academy alongside Guro Dan Inosanto himself.\nStephen specializes in the Filipino Martial Art of Kali, as passed down through Guro Inosanto’s lineage. His training background also includes extensive experience in Muay Thai, Silat, Western Boxing, Jeet Kune Do, Savate and Brazilian Jiu-Jitsu.\nOver the decades, Stephen has worked with:\n* Multiple branches of Law Enforcement, Military units and Special Forces.\n* Actors, stunt performers, and executives in the film and television industry.\n* As a fight choreographer for screen productions.\nKnown for his precision, adaptability, and deep respect for the cultural roots of the arts he teaches, Stephen brings a wealth of knowledge and embodied experience to every seminar.\nCurrently based in Marina Del Rey, CA, Stephen is excited to share the Kali method of Guro Inosanto with the New Zealand martial arts community.\n• Location: Mt Cook School Hall, 160 Tory Street, Te Aro\n• Dates: Sat Sept 6 + Sun Sept 7\n• Time: 1:30pm – 4:30pm (both days)\n• Cost: One Day Only (Sat or Sun) $140 / Both Days $260\n• Registration Closing Date: Wed Sept 3rd\nBookings Email: contact@tacticalsurvival.co.nz",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Newtown Market - September Edition 6th, Come join us and usher out winter with local creators and small businesses. We have a little something for everyone!\nMay 3rd 9am - 2pm\nNewtown School Hall\nCome join us as a stallholder!\nFor more info and to apply follow this link\nhttps://docs.google.com/.../1FAIpQLSeuCFcjOfi.../viewform...",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Sweat Reflect & Connect with Carolyn Patchell, Sweat – get those endorphins going!\nReflect – review our movements!\nConnect – spend time with our classmates!\nSessions:\nAll Day 10.15am to 4pm $55\nMorning 10.15am to 1pm $30\nAfternoon 1.15pm to 4pm $30\nOur day will start with a 30-minute Dance Fitness session that will include warm-ups but no cool down as we’ll head straight into a Tips and Tuition session. We’ll break down movements, go over cues and choreography, and look at how to increase or decrease intensity (or manage any injuries we might be carrying). We’ll take a break together and some healthy snacks will be provided along with hot drinks. We’ll then head into another Dance Fitness session where you can put your newfound knowledge to use (or just have some fun and party like it’s Friday night)! After a stretch and cooldown, we’ll do a bit of a wrap up over lunch (bring your own) and spend some time relaxing and chatting. Hot drinks will be available, or you can pop out if you need a barista made flat white!\nIf you’re not staying for the full day, we’ll say farewell after lunch and the rest of us will prepare to greet those coming in for the afternoon session.\nThe afternoon will start with a Strong Fit session which will contain elements of our Thursday night class. We’ll then move straight into a Tips and Tuition session which will look at all elements of our Strength Based Combo class. This will include form, technique, options, and how to maximise your weekly workouts. We’ll then take a break with some healthy (and easily digested) snacks before we power into a final Strong Fit session. Following the session, we’ll have a decent stretch and take the time to review what we’ve learned, chat amongst ourselves, and say farewell before our day concludes at 4pm. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Fairytale Adventures, Join us in PlayHQ for these Saturday sessions.\nTogether with your tamariki we tell fairytale favourites with a twist! This interactive performance guided by Fairy Cat and Friends invites the audience to use their creativity to guide the story.\nBest suits ages 3-5.\nFree, donations appreciated.\nNōku te Ao Capital E, 4 Queens Wharf. Pram parking and accessible bathrooms available.\nDATES\n- Saturday 9 August\n- Saturday 6 September\n- Saturday 11 October\n- Saturday 1 November\nLearn more: https://www.capitale.org.nz/event/fairy-tales/ ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Father's Day Lunch, Saturday 6th and Sunday 7th September 2025.\nCelebrate this Father’s Day in the heart of the Wairarapa, surrounded by the breathtaking views of Wharekauhau Country Estate and Palliser Bay. Treat the father figure in your life to a memorable afternoon with a luxurious lunch at our renowned restaurant, where rustic charm meets world-class cuisine.\nOur specially crafted Father’s Day menu highlights the finest seasonal produce, expertly prepared by our talented chefs. Enjoy a variety of mouthwatering dishes, from tender cuts of locally sourced meats to fresh, flavorful sides that will make every bite a celebration. Paired with a selection of New Zealand’s best wines, it's the perfect way to honor ‘Dad’ while taking in the stunning landscapes of rolling hills and expansive coastlines. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Just Sew - Repair Cafe, Repairing rather than buying is a great way to take climate action in your own life - and learn new skills along the way!\nBook below and bring along 1-2 clothing or lightweight items for repair to our September Just Sew!\nOur skilled volunteers will be here to assist you with repairs such as missing buttons, tears, holes and hemming. We will supply a selection of patches and buttons, but you are also welcome to bring your own if you have something specific in mind.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Bed By 10 Is Coming To Wellington!, NEW DATE ADDED DUE TO DEMAND\nBed By 10: The Ultimate 30+ Clubbing Experience!\nFancy going out for a dance but not keen on sacrificing the next day? We've got you covered!\nBed By 10 is a chance for ravers over 30 to relive the peak of the 80s, 90s & early 2000s clubbing scene! Expect crazy visuals, confetti showers, Co2 cannons and more as our resident DJ spins all the club classics\nGood vibes only! Our event is designed for those who love to dance, socialize, and enjoy great music—all while being home and in bed by 10 PM\nTickets Here\nhttps://likeit-loveit.com/pages/wellington-new-zealand ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Campaign Quiz Night for Peri Zee, Join us at a Quiz Night fundraiser for Peri Zee's campaign to be the next Mayor of Upper Hutt. \nIt will be a fun-filled evening of trivia with Quiz Master Dr Anna McMartin of 'The End Is Naenae'. \nBring some mates to form a team, or join a team on the night. Teams can be any size - there will be different sized tables. \nFood and drink can be ordered from Aro Bar during the quiz. \nBring coins if you would like to buy an answer!",
    "label": "Other"
  }
]