[
  {
    "description": "'TONES OF SILENCE' - FUTUNA CHAPEL IN B&W - PUBLIC TALKS, ‘TONES of SILENCE’ – FUTUNA CHAPEL in BLACK and WHITE\nPUBLIC TALKS START AT 2:00PM\nThe Trust looks forward to welcoming architects, designers, graduates, students and interested members of the public to attend this event and support the Trust in its work\nSunday 19th October.  Talks by Catherine Hammond and John Walsh\nSunday 2nd November. Talks by Malcolm Doidge and John Grace\nBOOKINGS ARE PREFERRED TO ATTEND THIS EVENT\nPRESENTERS\nCatherine Hammond - Director Collections and Research, Auckland Museum\nJohn Walsh – Writer – Walking Guides (Christchurch, Auckland, Wellington) \nJohn Grace – commercial lawyer and amateur B&W photographer\nDr. Malcolm Doidge - sculptor, video artist, photographer\nCATHERINE HAMMOND - SUNDAY 18TH OCTOBER\nCatherine Hammond is Director of Collections and Research at Auckland War Memorial Museum Tāmaki Paenga Hira, has worked in leadership roles in the arts and cultural sector in Aotearoa New Zealand for over two decades including Hocken Librarian at the University of Otago, and Research Library Manager at Auckland Art Gallery Toi o Tāmaki. Catherine is a trained librarian and published writer, editor, and curator, and has led the development of award-winning cultural heritage websites. Her research interests centre around the intersection of archives and Aotearoa art histories. She is Chair of the Guardians Kaitiaki of Alexander Turnbull Library and a Trustee of UNESCO Memory of the World Aotearoa New Zealand.\n Title of Catherine's talk\nA Thousand Words: Photographic Archives in Aotearoa\nCatherine will discuss the recent book and touring exhibition, A Different Light: First Photographs of Aotearoa and the role and impact of photographic archives as sites of research.\nJOHN WALSH - SUNDAY 18TH OCTOBER\nJohn Walsh is a leading New Zealand architecture writer. He edited Architecture New Zealand magazine for a decade, and has written numerous books on New Zealand architecture, among them the newly revised Auckland Architecture: A Walking Guide, which features photographs by Patrick Reynolds. (taken from AUCKLAND WRITERS FESTIVAL website)\nJOHN GRACE - SUNDAY 2ND NOVEMBER\nA selection of John's photographs make up the exhibition and he will also present a public talk about the photos, the vintage camera and equipment he uses, the history of photography and cameras used.\n\"Experiencing the chapel means interacting with it. From a photographic point of view, that means interacting optically and chemically to turn a solid, three-dimensional art form into a two-dimensional interpretation made up of tones of black, white and grey.\" John Grace - email- 18/06/25\nDR. MALCOLM DOIDGE - SUNDAY 2ND NOVEMBER\nDr. Malcolm Doidge undertook a 360 time-lapse photography in the Chapel interior during the equinoxes and solstices of 2023 - 2024.  He produced a 2 – 3minute video of the timelapse project and this will be screened in the Chapel as part of the exhibition.  Malcolm will also give a presentation of his work and explore the digital processes involved in its production. He is an interdisciplinary sculptor and spatial designer. He uses digital time lapse and photogrammetry images for film poetry.\nThe Futuna Trust is a charitable organisation and all koha received from the exhibition events will go towards the ongoing care, maintenance and operation of Futuna Chapel and also to support various initiatives undertaken by the Trust. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "2:22 A Ghost Story, Do You Believe in Ghosts?\n\nIn a rapidly gentrifying part of London, a married couple are renovating their new home. But something strange and frightening can be heard at the same time every night. What forces have they disturbed? Jenny has become convinced the house is haunted. Husband Sam isn’t having a bar of it. Tension builds throughout a housewarming dinner with friends as the clock ticks closer to 2:22… when a shocking truth will be revealed.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Airhorn! Election Special!, Airhorn is your favourite mindblowing comedy outing, but also now your civic duty?!\n\nThat's right! We've gone political in honour of the upcoming elections. There will be maps, there will be tallies, there will be on the ground reporting, there will be topical quips. My fellow countryfriends, we've got it ALL.\n\nBut mostly, we got the jokes, from the likes of:\n\nAlayne Dick\nAnna Maclean\nBooth the Clown\nLesa MacLeod-Whiting\nLily Catastrophe\nJak Darling\nZach Mandeville\n\nand maybe some surprise guests?\n\nVote with your laughter (and dollars) by buying a ticket today!!!!!",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Alien Comedy. Monthly Stand Up Comedy - September Edition, If you like watching an assortment of Stand Up Comedians, while enjoying pizza and beverages, then Alien Comedy is for you.\nSeptember Edition! Thursday 4th of September 2025 @8pm.\nJoin the cult following, its Wellington's second longest running Comedy Show. First Thursday of every month, 8pm at Moon Bar in Newtown.\nMC for the September show is Jerome Chandrahasen.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Best In Class: NZ Comedy School Show, Super funny comedians who happen to be alumni of the NZ Comedy School are here to put on a fantastic comedy show, just for you!\n\nLaugh and celebrate their work while you help us raise money for the school's Diversity Scholarship fund.\n\nFunded in part by a grant from the Wellington City Council!",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Burlesque Baby August 2025, A fun and entertaining evening full of a fantastic variety of performers. Burlesque Baby showcases some of the greatest new talent that Wellington has to offer.\nThis fabulous show on Saturday 23 August is not something to miss... Tickets regularly sell out, so get in quick to avoid missing out.\nDoors open at 7, show starts at 7:30pm\nGeneral Admission: $30\nFront Row Seating: $35 (limited)\nFront Row Table Seats: $40 (very limited)\n(plus eventfinder booking fee)",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Chloe's Revenge, Written and performed by Chloe Bettina.\nPart love letter, part exposé, Chloe’s Revenge is a musical theatre-inspired show that pulls back the curtain on the pro-am musical theatre “industry” in Aotearoa. With biting wit, Chloe lays bare the heartbreak of rejection from the world she adores, and turns that pain into power. This is a story of survival, self-discovery, and the ultimate comeback: becoming the best version of yourself when the system says you don’t belong. You don't have to be a \"musical theatre person\" to enjoy this show. In fact, it's better if you're not. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Eddie Izzard - The Remix Tour Live, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket\r\n\r\nPlease Note: All ages, all patrons must hold a valid ticket for entry. For more info click here(Opens in new tab)",
    "label": "Arts & Theatre",
    "skip": true
  },
  {
    "description": "Formation: A New Performer Show, Are you ready for the hottest new drag queens, drag kings & drag things that Wellington has to offer?\nDrag has exploded here in Aotearoa with new performers emerging every week and we're giving them the chance to show us their stuff.\nThis stunning resurgence of drag has arrived with thanks from powerhouses in the Wellington drag scene, stars of RuPaul's Drag Race, The Boulet Brothers Dragula, and many more!\nFrom kings, queens, and all the beautiful theys in-between, get ready to cheer these newbies on their debut night, scream their name and say SHANTAY, you stay! ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Grass Roots, Written and performed by Raureti Ormond.\nGrass Roots is a heartfelt and charming musical about the colossal culture of rugby. From club fields to Eden Park, a queer boy embarks on an epic odyssey through the New Zealand Rugby ages. Join him in this historical exploration of takatāpuitanga, masculinity, fatherhood, and what it means to grow up in Aotearoa. Created for rangatahi and whānau, this powerful story speaks to all generations. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "MAMIL 2: GOMIL, One of New Zealand’s most successful plays of all time, MAMIL (Middle Aged Man in Lycra) is hitting the road in a national tour of the long-awaited sequel GOMIL (Grumpy Old Man in Lycra).\n\nStarring acting legend Mark Hadlow ONZM (King Kong, The Hobbit, SNAG) and written and directed by Gregory Cooper (MAMIL, That Bloody Woman), GOMIL reunites this dream team who is directly responsible for causing laughter lines on the faces of over 70,000 people who saw MAMIL!\n\n“Fast-paced and slick” - Theatreview\n\nGOMIL follows the journey of Wayne, the founder and team leader of the men's cycling group in MAMIL. A lot has happened to Wayne over the last 10 years. He has retired, his son has moved to London with his grandchildren and Maggie, his wife of 49 years, passed away suddenly a year ago. For Wayne, his family and his work were his life. They were the source of his life's pleasure and purpose and now he is having to cope with the loss of both.\n\nThe only thing left to take his mind off the pain is cycling with his MAMIL friends, especially Bryan, the central character of MAMIL. But a panic attack mid-ride and a crash with catastrophic consequences leads to a crisis of cycling confidence and the inability to do the thing he loves the most.\n\nLike MAMIL, it takes an array of characters to help the central character rediscover what is truly important when their life seems adrift and meaningless. A relentlessly positive Scottish counsellor, a philosophical Romanian personal trainer, Wayne’s new arch-enemy in the form of an ocker Ozzie retirement village owner who grinds his gears and yes, even Pinarello -- the Italian bike of Bryan’s and Wayne’s nightmares -- all wittingly and unwittingly help Wayne get back on the bike and realise he still has something to offer, he still has a purpose and most importantly a reason to get out of bed every morning aside from going for a piss.\n\n“An engaging and earnest work of art, packed with",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "OMNIA, Two nights. One reprogrammed theatre.\nPōneke’s finest techno selectors guide us through rhythm and ruin.\nPerformers emerge, disappear. The system runs.\nThis is ‘Omnia’.\nEnter if it calls you.\n-\n19/9 - 20/9\n@hannahplayhouse ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Omnia, Two nights. One reprogrammed theatre.\n\nOmnia is a two-night techno rave held inside the Hannah Playhouse: a full venue takeover featuring live DJs, theatrical lighting and design, and unexpected performances throughout the night.\n\nEach night offers a different experience, with immersive elements, costumed characters, dancers woven into the space, and a different DJ lineup.\n\nWith two bars, a multi-level layout, and a balcony overlooking the chaos, the theatre becomes a reprogrammed nightclub built for the industrial age.\n\nThis is Omnia.\n\nEnter if it calls you.\n\nDoors open at 9PM.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Paul Kelly at Michael Fowler Centre, Wellington (Lic. All Ages), Paul Kelly announces his biggest shows in Australia and New Zealand to date, and his only live shows for 2025: nine huge arenas proudly presented by Frontier Touring, Triple M (AU) and Stuff (NZ).\nSet Times\n7:00pm | Doors open\n7:45pm | Show starts\nPlease note: set times are a guide only and are subject to change without notice.\nTICKETS FROM\nfrntr.co/PaulKelly25Wel\nEVENT INFORMATION\nfrontiertouring.com/paulkelly\nPLEASE NOTE: Post approval is turned on for this Facebook event – any posts related to reselling tickets will not be approved. We strongly recommend only purchasing through the authorised ticketing agency listed in the description of this Facebook event. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "ROADKILL: The Uber-cool Musical - TAHI Festival: CANCELLED, Hey everyone- we have a little change of plans!\nUnfortunately, ROADKILL: The Uber-Cool Musical won’t be happening this time around, but we’re already cooking up something even better for the future. All ticket holders will receive a full refund and we can’t wait to welcome you to our next big adventure.\nThank you for your excitement and your support.\n\nCANCELLED-\n\n\nROADKILL The Uber-Cool Musical takes you on a wildly immersive journey through love, life and rock ’n’ roll — all from the back seat of a van. This intimate one-man musical combines humour, heart and unforgettable tunes for an experience like no other.\nStrap in for the rollercoaster ride of your life as we take a regular mundane occurrence of driving in an Uber and blow wide open the private life, memories and miss happenings of our hero, and driver, Terry.\n\nCarpool karaoke meets intense love story meets wild murder mystery.\n\nMuch more than a musical, its an experience, its a journey and an attraction!\n\nIn the space of a usual cabaret show and with the help of the passengers in the van, you will witness and be part of, childhood dreams, births, deaths and marriages, high drama, dark comedy, all sung live with a kickass, original, meatloaf-esque rock soundtrack. Surprises and magic ensues as we push the van, and Terry, to the limits of what is possible.\n\nThis will be an intimate, sensory overload, in a van. A full grand musical with all the bells and whistles.\n\nWith only 9 seats available each ride, grab your mates and have a private experience in the fast lane!\nThe hottest ticket in town- be sure to experience the ride of your life!\n\nThe show is in the style of a musical crossed with karaoke songs you have never heard before...\n\nThe van will be stationary and parked for this initial season.\n\nWinner of BEST IN FRINGE and EMERGING ARTIST OF THE YEAR at the Dunedin Fringe and Winner of MOST INNOVATIVE at the NZ Fringe awards this year!",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Ravel’s opera 'L'enfant et les sortilèges', New Zealand School of Music Classical Performance students present four performances Ravel's engagingly magical opera 'L'enfant et les sortilèges' at the Hannah Playhouse directed by Sara Brodie, conducted by Martin Riseley with the New Zealand School of Music orchestra.\nPerformed in French with surtitles, the show is suitable for all ages. The story involves a 'child' (L'enfant) whose awful behaviour brings an unexpected response: first the furniture rebels, the grandfather clock, the broken china cup, then the mathematics tutor and the Princess in the fairy tale book come to life, and eventually all the animals in the garden - squirrels, dragonfly, birds rise up - all of whom have good reason to 'teach the child a lesson'. It's a fabulous journey that we go on with the child who is confronted by all of these and indeed learns...\nThis is a project involving the whole of the Classical Performance programme: the voice students sing all the roles, each performing several roles, the NZSM orchestra will play for the performances, and the piano students are taking part as rehearsal pianists (répétiteurs) and playing in the orchestra.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Tangihanga, Created and performed by Kristyl Neho\nTangihanga is a solo drama-comedy centred around Jess - a devoted daughter whose father, Karanipa, has passed away. As Jess’ whānau gathers at the marae to mourn, tensions rise, secrets are revealed, and long-held family dynamics begin to unravel.\nNeho masterfully embodies over 30 characters, capturing the complexity of grief, cultural identity, and the strength of whānau. This bold, emotionally charged, and often hilarious performance speaks to the heart of Aotearoa. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "The Night is Always Darkest, From the makers of Don't Wake Me Up and One Night Band, The Night is Always Darkest returns after a soldout season at NZ Fringe!\n\nSpend a night with Lia as she fills the sleepless hours of the morning in real-time. Get to know her and influence her decisions in this award-nominated durational theatre experience.\n\nAttend the show live at Two/Fifty Seven Willis Street or tune into our live streams on Twitch and YouTube. Show starts at 11:59pm on Saturday 20th September and runs for 7 hours.\n\n“an incredibly audacious show.”- Theatreview\n“a vital theatrical experience.”- Theatreview\n\nFinalist- Most Innovative Work, NZ Fringe 2025\n\nCreated by\nLia Kelly\nIzzi Lao\nRosie Glover\nAustin Harrison\nCampbell Wright",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "This Wasn't the Plan: A Musical Theatre Cabaret, Winner of Outstanding Solo Show and at the 2025 New Zealand Fringe Festival, and nominated for Best in Fringe. this show returns to The Hannah for one night only as part of the encore series during the Tahi Festival.\nPlease take your seats in this cabaret classroom as lecturer-performer Glenn Horsfall leads a hilarious, heartfelt lesson in what happens when life doesn’t go to plan. Featuring beautiful songs from a mix of beloved and lesser-known musical theatre favourites, and stories full of humour, heart, and reflection, this award-winning solo show invites you to embrace every version of yourself.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Too Cool for British Rule Open Mic, Los Angeles style open mic. That means you show up and sign up. Primarily comedy but open to music, poetry, or storytelling. If you get there by 7 and put your name on the list, you’re on.",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "World Press Photo Exhibition 2025, The New Zealand Academy of Fine Arts (NZAFA) is proud to announce the arrival of the highly anticipated World Press Photo 2025 Exhibition, set to take place at Takina, Wellington’s leading purpose-built event venue, from September 5 to October 5, 2025.\nThis globally renowned exhibition showcases the year’s best visual journalism, featuring powerful, thought-provoking images from around the world. The event brings together photographers and storytellers whose work highlights pressing social, environmental, and political issues. ",
    "label": "Arts & Theatre",
    "skip": false
  },
  {
    "description": "Intro to Wellington Timebank, September Intro to Timebanking\nWednesday 10th September\n12pm-1.30pm\nUpstairs* Harakeke Room\nNewtown Community Centre\nCnr Rintoul & Colombo St\nEntrance on Colombo Street,\nNewtown\n*Stairs and also lift accessible\nWe allow up to 90mins for these sessions to allow folk to connect, ask questions.\nThere is a limited amount of space so\n***Please email to book a place*** info@wellingtontimebank.org.nz\nThe session will cover:\n1) What is Timebanking & how we started\n2) Basics of how it works and how it can benefit you!\n3) Overview of our members' site: Time and Talents.\nIt also includes time to have a cuppa and chat to other new members\nOnce you have attended an intro session and submitted relevant forms we will send you a welcome email and BONUS we give you 2 hours of time credits for completing the process\nEmail to book your spot today! ",
    "label": "Business & Networking",
    "skip": false
  },
  {
    "description": "The New Zealand Institute of Driver Educator's Inc - 50th Annual Conference, New Zealand Institute of Driver Educators (NZIDE)\nNational Conference\nHELD: James Cook Hotel - Wellington\n\nThe NZIDE Executive Committee is proud to have some fabulous speakers attending this year's conference. See below some of the speakers we have attending. We are looking forward to a great conference, awesome networking opportunities and having a laugh.\n\nNZIDE is pleased to announce an exceptional lineup of keynote speakers for our upcoming conference. We are honoured to welcome Greg Murphy, Nathan Wallis, Julia Grace, Katrina Aubury, Sean Campbell and Sue Tyler - renowned voices who bring a wealth of experience, insight and inspiration. This promises to be a transformative event, offering thought-provoking perspectives and meaningful dialogue. We invite you to be part of a conference that is truly not to be missed.\n\n----------------------------------------------------------------------\n\nThe New Zealand Institute of Driver Educators (NZIDE) annual National Conference. Pre-registration is essential and numbers are limited. Two days of amazing speakers, government guests, professional development and networking. Lunch both days. Annual general meeting (AGM) and Evening dinner function. The evening dinner function dress theme is Shimmer, sparkle and shine - it's a night of gold and glamour! Come dressed in your fanciest or silliest golden attire.\nMember Conference price: $275.00 incl GST. Includes full conference / evening function\nNon-Member Conference price: $350.00 incl GST. Includes full conference / evening function\n----------------------------------------------------------------------\nJames Cook Hotel - Wellington\nPlease find below links for the accommodation.\nRoom Only:\nAttendee/Group Code: 523273\nOnline booking link: http://bookings.ihotelier.com/bookings.jsp...\nBreakfast Inclusive:\nAttendee/Group Code: 558339\nOnline booking link: http://bookings.ihotelier.com/bookings.jsp...\nRoom Type and Rates:\nExecutive Room - $229 Room Only\nExecutive Room - $239 per night per room (Breakfast Inclusive for 1 person), $269 per night per room (Breakfast Inclusive for 2 people)\nPrices include GST tax of 15%\nAll rooms and rates are held until 22 July 2025.\n-----------------------------------------------------------------------\nThe evening dinner function dress theme is: Shimmer, sparkle and shine - it's a night of gold and glamour!\nCome dressed in your fanciest or silliest golden attire.",
    "label": "Business & Networking",
    "skip": false
  },
  {
    "description": "Black Belt Training Series - Martial Movement Self Defence, Wellington Region Black Belt Training workshop focused on sharing martial movements ideas and concepts for practical Self Defence response strategies and tactics.\nThis session will challenge your thinking and movement and hopefully encourage you to broaden the scope of your training.\nWorkshop Cost $5.00 to cover venue. ",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Chain Maille Course, Our medieval materials expert Achille is ready to be your chain maille master. In this seven class course you will hone in on the chain weaves that incite awe and be bestowed with the agency to create a wearable piece or majestic object of your own design. On the mysterious journey towards mastery, Achille will take you through everything from the dexterity of proper ring closing, to practicing resolve through the depths of theory and mathematics that allow you to design and execute a piece of your very own creation. This is the perfect course to begin your foray into the craft of chain maille.\nThis course it taught by medieval enthusiast Achille. He is a creature of curiosity and crepes, having spent the last 14 years skulking around the capital publishing “woke leftist paper” as a founder of 5ever books. He has conquered our hearts, minds, and the specialty cheese departments of the local supermarkets. Achille is a master of chain maille, now offering to teach his craft to those willing to take up the challenge.\nSome materials and tools are supplied. Depending on the project you choose to create there may be extra material costs, as well as the option to purchase tools for personal use. You are welcome to bring your own bent nose pliers and wire cutters if you have them.\nThere are variable pricing options, unwaged/student, waged, and generous. Please choose whichever option feels right for you and your circumstances! Note that this ticket is a commitment to the entire seven week course. No chain maille experience is required, just a will to delve into the depths of metal weaves. If you're unsure about committing to this craft, perhaps keep an eye out for a one off 101 chain maille class that may come in the future.\nCourse Outline:\nWeek 01 - 18th September\n101: Basic Skills and Discovery\nAt this class we'll explore the basics of good chain maille practice.\nOpening & closing rings properly\nTrying out some simple structures\nBegin exploring material options and how to make your own rings\nHomework: keep an eye out for recycled or foraged materials that could be utilised in chain maille\nWeek 02 - 25th September\nPlay and Exploration\nGathering inspiration and looking into methods for individual projects\nPlaying with recycled & foraged materials\nHomework: Choose a weave from the library to try out at home or explore during the next class\nWeek 03 - 2nd October\nMathematics of chain maille design, theory, and history.\nMath of designing chain maille\nTheory & pre-planning\nDiscussion about ideas for individual projects\nIdentify materials needed to execute individual designs\nHomework: Choose your individual project, identify what materials you will need, and how we will source/make them.\nWeek 04 - 16th October\nBy this class you will have you project plan down. We'll be collecting/ making our materials or beginning the execution of our projects with the guidance of Achille.\nWeek 05 & 06 - 23rd & 30th October\nThese classes will be open working times to make use of tools in class, ask Achille questions or help with troubleshooting, and to share our progress, challenges, and solutions with each other.\nWeek 07 - 6th November\nAt this final class we will make finishing touches to our projects and celebrate our creations together! Perhaps including a catwalk of our chain maille wares, and sharing kai.",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Chain Maille Workshop, Chain Maille Course\nWe’re VERY excited about hosting this series. A seven week journey with master Achille through which you’ll emerge having designed and created your own wearable item or myjestic object out of chain maille.\nStarting September 18th\nThursdays 5:30 - 8pm\nlocated Toi Pōneke\nCourse info and sign ups are on micromill.org ",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Cooking Classes, Authentic Indian cooking classes in Wellington with panaromic views over Wellington Harbour.\n\nIn each class, you will learn 4-5 recipes like: potato stuff roti, roasted eggplant curry, wholemeal, roti, naan; shahi paneer; dhal, samosa; palak paneer; gourmet chickpeas; vegetable korma; gulab jamun; kheer; mango lassi; masala chai, and many more...\n\nThe classes start at 6 pm or 10:30 am on weekends and weekdays with a 2-hour session followed by a dinner or lunch afterwards. The ingredients, copies of recipes, organic karma drink will be provided with a full course meal in a banquet setting. Custom made classes available for gluten free, dairy free and any other food intolerance and dietary requirements.The ingredients, recipes, complimentary organic karma drinks will be provided with a full course meal.\n\nThere are 2 to 8 people in each class in purpose built cooking studio. Also a private cooking classes available.\n\nThe menu for the class can be:\n\n1) Spicy potato stuffed paratha and roti, rajasthani tomato relish, aalu matter or spicy peas- potato curry, roasted cumin yogurt raita and fresh mint- coriander chutney.\n\n2) Shahi Paneer (cottage cheese cubes with spices and rich tomato-cashew gravy), garlic coriander naan, cumin jeera basmati rice and sweet fragrant rice pudding with cardamom. Also I will teach how to make fresh paneer.\n\n3) Roasted eggplant curry, plain whole wheat chapatti or roti, jeera aaloo or potato curry, Tuar dahl (split yellow lentil) and Basmati rice with homemade pickle.\n\n4) Palak paneer (creamy spinach curry with cubes of paneer), jeera rice (basmati rice with fragrant spices, panjabi chhole or spicy chickpeas curry and mango lassi. Also fresh paneer making.\n\n5) Khadi (chickpeas fritters in yogurt and chickpeas flour soupy gravy), Aloo-Gobhi (cauliflower and potato curry),  savoury wraps with herbs and spices, fresh pickle and basmati rice.\n\nThe total cost is $130 per person, this includes ingredient cost. (As an alternative we also sell cooking class gift vouchers.The food options are unlimited and the class provides fresh and best ingredients)\nPlease contact for booking: indiancooking@xtra.co.nz\n\nSo just bring your taste buds! and Enjoy!!",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Fairy Potion Garden: An Enchanted Workshop, Fairy Potion Garden: An Enchanted Workshop (1.5 hours)\n\nStep into the enchanted fairy grove for a magical potion-making adventure! Led by a whimsical fairy guide, this hands-on workshop invites young potion crafters (ages 5+) to mix glittery brews, stir up flowery scents, and create their own take-home fairy potions.",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Natural Textured Rings, Make your own personalised ring - a gift for yourself or someone special! :-)\n\nLearn the basic technique first in copper or brass, and then craft your final piece in silver!\n\nOver this taster class, you’ll be guided through the process of heating and texturing metal, cutting and shaping with traditional jewellery tools. Use feathers, leaves, or fabrics to create a unique texture for a beautiful ring!\n\nLearn to measure your finger, cut metal to length and texture it without rolling mill, hammers and punches. Then use a jewellers torch, sandpaper and polishing, and your beautiful new ring will be ready to wear.\n\nThis 3-hour class is ideal for beginners, groups of friends and visitors to the city.\n\nIncluded in the class fee are copper and brass for practising on, a sterling silver ring strip and all consumables such as sandpaper, solder and chemicals. Extra metals are available for purchase in the studio.\n\nKids aged 12 (or so) are welcome to attend the class, but any person under the age of 16 must be accompanied by an enrolled parent or caregiver.",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Paint Time with Rapunzel, Paint Time with Rapunzel\n\nLet your creativity blossom in this enchanting art workshop for kids aged 5 and up!",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "Spring Container Planting Workshop, Grow Your Own Kai - In Containers From Your Own Compost\nWant to grow your own fresh kai but only have a balcony, patio, or courtyard? This hands-on workshop will show you how to grow spring vegetables and herbs in containers - a flexible, low-cost way to turn even the smallest space into a productive garden. Following on from our winter edition, this is the second workshop in our seasonal container growing series, with a focus on getting your spring garden thriving using your own compost.\nThis workshop will cover:\n- What to grow in spring, including leafy greens, herbs, and root vegetables\n- How to set up containers - choosing the right size, drainage, potting mix, and using your own compost or bokashi soil\n- Feeding your plants with DIY fertilisers, spotting nutrient gaps, and refreshing tired soil\n- Creating ideal growing conditions with sunlight, watering tips, wind protection, and natural pest control\n- Keeping your garden productive by harvesting, replanting, and rotating crops throughout the season\nPlease bring your own container(s) - buckets, storage bins, flexi tubs, or old drawers all welcome. We will show you how to safely repurpose them.",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "The Art of Mending, This class is cared for by the whimsical Aisha, a multidisciplinary artist with a passion for empowering the mending process. Each month on Wednesday evenings Aisha will introduce us to a different technique for reviving our beloved textile pieces. If you're like us and have a box of clothing in need of repairs that never seems to empty... this is the club for you. With three events a month we'll inspire each other to creatively care for those pieces we love! This club is also perfect for anyone who loves learning new skills. Techniques we'll cover are lino printing, patching, darning, felting, embroidery, beading, sashiko, fabric painting and more! All materials and tools are supplied at each class - but you are welcome to bring your own and we highly encourage bringing a textile item (or many!) to fix up.\nIn August we're lino printing!\nClass 01: 13th August\nIn this class we'll get an introduction to lino printing on fabric and best practice for using this process to cover stains. Pre cut designs and all other tools are supplied. Please bring either clothing you would like to print on or some fabric scrap to make lino printed patches!\nClass 02: 20th August\nAt this class Aisha will take us through the process of designing and cutting our own lino to print with! You're welcome to keep going with the pre cut designs as well. Lino and carving tools will be supplied.\nClass 03: 27th August\nThis class will be open to what you want to work on! Bring in larger project items, print with the lino cuts you made in the previous week, or cut some fresh ones!",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "The Art of Mending, This class is cared for by the whimsical Aisha, a multidisciplinary artist with a passion for empowering the mending process. Each month on Wednesday evenings Aisha will introduce us to a different technique for reviving our beloved textile pieces. If you're like us and have a box of clothing in need of repairs that never seems to empty... this is the club for you. With three events a month we'll inspire each other to creatively care for those pieces we love! This club is also perfect for anyone who loves learning new skills. Techniques we'll cover are lino printing, patching, darning, felting, embroidery, beading, sashiko, fabric painting and more! All materials and tools are supplied at each class - but you are welcome to bring your own and we highly encourage bringing a textile item (or many!) to fix up.\nIn August we're lino printing! You'll leave each workshop with wearable washable clothes thanks to our fancy new heat press\n\nClass 01: 13th August\nIn this class we'll get an introduction to lino printing on fabric and best practice for using this process to cover stains. Pre cut designs and all other tools are supplied. Please bring either clothing you would like to print on or some fabric scrap to make lino printed patches!\nClass 02: 20th August\nAt this class Aisha will take us through the process of designing and cutting our own lino to print with! You're welcome to keep going with the pre cut designs as well. Lino and carving tools will be supplied.\nClass 03: 27th August\nThis class will be open to what you want to work on! Bring in larger project items, print with the lino cuts you made in the previous week, or cut some fresh ones!",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "The Art of Mending, When it comes to the clothes we love, every rip, stain, and imperfection is an invitation to exercise agency, expression, and an opportunity to show the garment how much we appreciate it.\nThis class is cared for by the whimsical Aisha, a multidisciplinary artist with a passion for empowering the mending process. Each month on Wednesday evenings Aisha will introduce us to a different technique for reviving our beloved textile pieces. If you're like us and have a box of clothing in need of repairs that never seems to empty... this is the club for you. With three events a month we'll inspire each other to creatively care for those pieces we love! This club is also perfect for anyone who loves learning new skills. Techniques we'll cover are lino printing, patching, darning, felting, embroidery, beading, sashiko, fabric painting and more! All materials and tools are supplied at each class - but you are welcome to bring your own. We highly encourage bringing those clothes or other textile items that need some love and repair.\nThere is no need to attend every class. We can catch you up on the skill at which ever class you choose to join us at. There are single class tickets or monthly sign ups available. Both of these have variable pricing options, unwaged/student, waged, and generous. Please choose whichever option feels right for you and your circumstances!\nIn August we are Lino Printing!\nClass 02: 20th August\nAt this class Aisha will take us through the process of designing and cutting our own lino to print with! You're welcome to keep going with the pre cut designs as well. Lino and carving tools will be supplied.\nClass 03: 27th August\nThis class will be open to what you want to work on! Bring in larger project items, print with the lino cuts you made in the previous week, or cut some fresh ones!\nIn September we are patching!\nClass 01: 10th September\nAisha will take us through the process of sewing on patches. Patches that we printed in the August classes will be available for this. You're welcome to bring your own patches as well. Please bring something that needs a patch up or a little bit of decoration.\nClass 02: 17th September\nAt this class we will learn how to appliqué, the process of using scrap fabric to make decorative patches. This is a great way to elevate a rip or stain with some visible mending.\nClass 03: 24th September\nAt this last class of the month we'll be open for all the patching needs. Hang out and finish projects we've started or mend some extra items.\nBe sure to check our website or here for updates about techniques coming up in the following months.",
    "label": "Classes & Workshops",
    "skip": false
  },
  {
    "description": "2nd Anniversary Party, Jungle Juice: 2nd Anniversary Party\nFRIDAY 29TH AUGUST • 9PM–3AM •\nTHE GARDEN HOTEL - WELLINGTON\nWe’re turning 2 years old, and we want to celebrate with all of you! We’ve been bringing you beach parties and raves for 2 years and we’re not slowing down. It’s also DJ By Accident’s birthday, so we’re throwing a massive jungle rave filled with our multicoloured line-up from house to techno at The Garden Hotel.\nLINE-UP:\n• NOT MY SISTER - House\n• DJ BY ACCIDENT - Afro-Latin House\n• GASPAR - Bounce Singalong Techno\n• MALWARE - Hard Techno\nDress code: Party Animals (think jungle creatures, leopard, snakeskin, zebra, cheetah. Get wild!)\nSee you in the jungle!\n\n\n***Please Respect the Venue***\n*** Important Information ***\n• At Jungle Juice we will not tolerate any form of discrimination.\n• Look out for each other and please report any antisocial behaviour.\n• Remember we all come from different walks of life and we don’t know what others have/are going through. Never judge anyone by who they are.\n• We share our time with you in a loving and respectful way and we want everyone to feel this every minute they are at a Jungle Juice event.\n• Consent is key – always.\n• Have fun and please find us on the decks if you have any issues. ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "AFRICAN DRUM, DANCE, SONG & KORA WEEKEND, Drums provided -koha gratefully received.\n*Book in for your 1-1 with Sibo ASAP $100ph\nAvailable time slots below\nJoin us for a weekend of fun and uplifting African music and dance workshops with Sibo Bangoura (bio below)\nDrums provided-koha gratefully received.\n\nUpdated Schedule:\nFRIDAY 12th\nPlease join us in welcoming Sibo Bangoura to Te Whanganui A Tara / Wellington!!\nOpen KORA & SONG $50 7:00-8:30PM\nMinimum 4 people. Bring your own kora or just come, sing\nThis is a time to meet Sibo & the community & share kai.\n(Message Bridget for directions)\n~ Private session time 8:30-10:00PM $100ph~\n\nSATURDAY 13th\nAt Cook Island Society Hall\n~ Private session time 8:00-10:00 $100ph~\nOpen to all levels:\n10:00-11:30 OPEN DRUM class $40\n12:30-2:00 OPEN DANCE class $40\nOr $60 for both!\n*2:30-4:30* 2 hr Intermediate DANCE $50\n~ 4:30 Private session SOLD~\n6:00-8:00PM SHARED DINNER\n8:00-10:00PM possible jam/informal concert with dancing\n\n~Private session 7:00-11:00PM $100\nSUNDAY SPECIAL 14th:\nTWO 2 HOUR SESSIONS\n\nAt Cook Island Society Hall\n~Private session 8:00-9:00AM $100ph~\n*9:00-11:00* 2 hr Intermediate DRUM $50\n*11:30-1:30* 2 hr Advanced DRUM $50\nOr $80 for both\nGoodbye hugs & thank yous\nTidy hall, pack drums away.\nExit hall by 1:50\n~Private session time 2:30-3:30 $100ph~\n$190 for all sessions, excluding the kora session.\n$230 for everything Including the kora session\n4:00 Sibo to airport\nInfo about the teacher:\nGuinean percussionist Sibo Bangoura grew up in Matam – the heart of Conakry’s arts precinct – surrounded by a family of griots. His mother was a singer and his father abalafon player. Sibo absorbed the rhythm from his infancy and began to study percussion formally at the age of 12. At 14, he joined Boka Junior ensemble and then played with Ballet Matam for many years, until he moved to Australia.\nSibo currently resides in Sydney and travels to China, Japan, Singapore and Thailand to teach and perform. He plays with his brothers Mohamed and Epizo Bangoura and has a successful 8-piece band Keyim Ba\nIf you have ANY questions please feel free to get in touch with Bridget xo\nTo book your space:\nPlease put your NAME & which session you are doing ie: ‘OPEN DANCE’ as a reference & pay into account\nBridget Kelly ANZ 010797054191130\n*PLEASE REMEMBER TO: contact me to say you have paid*\nThank you for supporting this event\n\nXox\n",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Art and AI: Brit Bunkley in Conversation with Megan Dunn, Artist and filmmaker Brit Bunkley discusses the pragmatics and politics of making art with AI. Join us for a discussion in the Gallery, with insights into the making of his latest work Archive, commissioned for Messengers.\n--\nBrit Bunkley is a New Zealand-based artist and videographer whose practice spans sculpture, installation, and digital media. A recipient of the US National Endowment for the Arts fellowship, two NY state grants, and the Rome Prize Fellowship, his work explores the intersection of physical and virtual spaces, often blending surreal imagery with themes of history, politics, and environmental concerns. He has exhibited at the Museum of New Zealand Te Papa and internationally at Rencontres Internationales Paris/Berlin, FILE São Paulo (including 2025), and the Athens Digital Arts Festival. Recent exhibitions include Visions in the Nunnery, London (2022), Cybersculpture 2024 at Collège des Bernardins, Paris, and The Torrance Art Museum, LA (2025). In 2024, he won Best Art | Experimental Video/Film at the New York City Independent Film Festival. His work continues to evolve, embracing new technologies and alternative methodologies to challenge perceptions of reality and imagination.",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Benefit Gig: Sugar Cherry Welfare State for Wellington City Mission!, Fundraiser gig time! Sugar Cherry Welfare State is taking the stage! 💥\n\nThis teenage Riot grrrl duo writes music about resistance, love, trans solidarity, and sometimes wolves.\n\nJamie and Alice are taking over the Newtown Community Centre on Sunday the 21st playing their tunes for you and yours for an all-ages gig to raise essential funds for Wellington City Mission.\n\nTickets are pay-what-you-can (with a suggested donation of $20) and all money raised goes to WCM. Get yours online or grab them at our door sales, we can take cash or paywave.\nP2 masks are required and will be provided to all for free at the door! We take care of each other 💜\n\nGet loud for a cause, and come dance with us! We'll see you there! 🎸🎶",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Carterton AFC Centenary Dinner, Come and celebrate the end of year break up and Centenary Dinner of Carterton AFC. That's right, Carterton AFC is 100 years old, and it is time to party like it is 1925. Ticket price includes, entry, meal (Smorgasboard) automatic entry into raffles and dancing the night away with DJ Dan playing all the tunes you love.\n\nSo come on current players, players partners, ex players, old timers and all the others that have helped make Carterton AFC the greatest little club in the universe, get your glad rags on and come celebrate with us.\n\nIf you purchase multiple tickets we cannot guarantee you will all be seated together. Seating will generally be ona first come basis. If you purchase 10 tickets, or 6 tickets, where possible, we will reserve a table for your group.",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Cure Kids NZ - Quiz Night with \"Dark Destroyer\", General Admission OnlyAll Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket\r\n\r\nApproximate Running Times:\r\nDoors: 6:30pm\r\nStart: 7:00pm\r\nFinish: 10:30pm. ",
    "label": "Community & Culture",
    "skip": true
  },
  {
    "description": "Father's Day Quiz, Put your general knowledge to the test while supporting a great cause at the Father's Day Quiz!\nJoin us for a belated celebration of the fathers and father figures in our lives. We welcome everyone to join us, including students and mothers, so make sure to get everyone a ticket.\n\nDate: Monday 8 September\nTime: 6:30pm-9pm\nCost: $25 per person, which includes a pizza dinner and a drink\nPlease bring gold coins for some exciting games to be played throughout the evening.\nClick the link to get your tickets now!\n\n\nThis event is part of the 2025 Middle School Challenge fundraiser for Blind Low Vision NZ. Our Middle School Leaders have the unique opportunity to sponsor the development and training of a Guide Dog named Cooper, which costs about $25,000. Your generous donations are greatly appreciated and make a significant difference. Once Cooper is fully trained, he will be placed with a visually impaired person for the rest of his working life. We believe that as the Scots Community bands together, your support can change a life.\nTo learn more or to make a donation, visit our Givealittle page:\nhttps://givealittle.co.nz/l/scots-college-blv-2025 ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Friends of Karori Cemetery - 2025 Wellington Heritage Festival: Gallows Tour, Crime, Justice, and the Final Walk.\nDelve into the complex history of capital punishment in Wellington with this thought-provoking tour through Karori Cemetery. Gallows shines a light on the people behind the process. Discover their roles in shaping justice, the cases that defined their careers, and the human stories behind a system of ultimate consequence.\nEach tour is $10 per person (plus non-refundable booking fee). Children under 12 are free.\nOur tour has a maximum capacity of about 15 persons. If there are insufficient tickets remaining for your party, please email us at info@friendsofkaroricemetery.co.nz to check if we can accommodate you.\nPlease note:\nIf we have to cancel a tour due to inclement weather or sickness, we will notify you on the day 1 hour before the tour starts by email and on our Facebook page. The booking fee is non-refundable.\nThis tour is approximately 2 hours long.\nThis tour contains a number of adult themes and some graphic descriptions so is not suitable for everyone.\nPlease dress appropriately for the conditions.\nWhile we do our best to guide you on a safe walking route, during the winter months the ground can become slippery in places.\nSome of our walks require a moderate degree of fitness and are not suited for those with limited mobility.\nThere is only one toilet which is located by the cemetery office at the main entrance.\nIf you have purchased tickets for other people can you please pass our tour information on to them as well.\nPlease meet us at the shelter (shown as the Historic Chapel on the map at the main entrance)\nWe look forward to welcoming you to Karori Cemetery.",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Friends of Karori Cemetery - 2025 Wellington Heritage Festival: Our Fair Ladies (April 2025), Our Fair Ladies Tour\nEmbark on a captivating journey through the history buried in Karori Cemetery with our tour showcasing the remarkable lives of Wellington's women.\nThis tour offers a unique opportunity to celebrate the resilience, creativity and empowerment of women at a time when a woman couldn't have a bank account in her own name.  You'll hear the stories of women who had a range of interesting occupations. \nBe inspired by the incredible impact of these women's lives in early Wellington.\nOur tour has a maximum capacity of about 15 persons. If there are insufficient tickets remaining for your party, please email us at info@friendsofkaroricemetery.co.nz to check if we can accommodate you.\nNote:\nIf we have to cancel a tour due to inclement weather or sickness, we will notify you on the day by 9am by email and on our Facebook page.\n\nPlease dress appropriately for the conditions. While we do our best to guide you on a safe walking route, during the winter months the ground can become slippery in places.\nSome of our walks require a moderate degree of fitness and are not suited for those with limited mobility. Please read the tour descriptions carefully to check that they will be suitable for you.\nWe will meet before the tour at the Shelter (listed as Historic chapel on the map)\nWe look forward to welcoming you to Karori Cemetery.",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Friends of Karori Cemetery - 2025 Wellington Heritage Week: Tragedies Tour, Come and hear stories of those who met sad, shocking and untimely ends. This tour traverses some of the older parts of the story where historic headstones mark the stories of lives lost too soon: accidents, murder, misadventure and those who fell by their own hand.\nThis tour contains a number of adult themes and some graphic descriptions so is not suitable for everyone.\nEach tour is $10 per person (plus non-refundable booking fee). Children under 12 are free.\nOur tour has a maximum capacity of about 15 persons. If there are insufficient tickets remaining for your party, please email us at info@friendsofkaroricemetery.co.nz to check if we can accommodate you.\nPlease note:\nIf we have to cancel a tour due to inclement weather or sickness, we will notify you on the day 1 hour before the tour starts by email and on our Facebook page. The booking fee is non-refundable.\nThis tour is approximately 2 hours long.\nPlease dress appropriately for the conditions. While we do our best to guide you on a safe walking route, during the winter months the ground can become slippery in places.\nSome of our walks require a moderate degree of fitness and are not suited for those with limited mobility.\nThere is only one toilet which is located by the cemetery office at the main entrance.\nIf you have purchased tickets for other people can you please pass our tour information on to them as well.\nPlease meet us at the shelter (shown as the Historic Chapel on the map at the main entrance)\nWe look forward to welcoming you to Karori Cemetery.",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Joint Hataitai Commnity AGMs - Community House, HCRT & Bowling Club, The Hataitai Childcare Collective & Community House (HCCCH) and Hataitai Community Recreation Trust (Hataitai Bowling Club) which looks after the management of the Community House, Playroom and the Bowling Club would like to advise that this year's Annual General Meeting will occur on Tuesday, 9 September 2025\nThis meeting will incorporate AGM’s for three entities Hataitai Childcare Collective, Hataitai Bowling Club and Hataitai Community Recreation Trustee Ltd.\nThe meeting will provide an overview of the previous 12 months and our plans for the future, including an update on the redevelopment plans for the Bowling Club.\nA relaxed and friendly event, all welcome!\n18:30 Drinks and nibbles 8\n19:00 HCCCH AGM\n20:00 HCRT AGM\n20:30 Bowling Club AGM\n21:00 Finish. ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Lads Lads Lads: A Drag King Show, Are you ready for a boisterous band of bros?\nA hefty helping of handsome heirs?!\nA smorgasbord of sweaty studs?!\nThen grab the gang and head down to Fringe Bar on 6 June for Lads Lads Lads! A Drag King Show, and prepare yourselves for the most delightful, most glittery, most wholesome masculinity you ever did see (there will be no hazing here!)\nOur dazzling cast of dashing dudes and extraordinarily hairy gentlemen are bound to leave your seats moistened, your gobs a gasp, and have you cheering “Yeah the boys!”\nSo buck up, grab the whole fraternity and head to Eventfinda to grab your tickets from just $20.\nSupport your local Drag Kings!\nLads Lads Lads!\nJune 6: Boy Bands\nSeptember 12: Rock Gods\nNovember 21: Dapper Dudes\nVenue, seating & show info\nCash only door sales are available if not sold out prior ($30.00 per ticket)\nGA seating is unallocated, make sure to arrive early to nab a good vantage point.\nDoors open one hour before showtime.\nIf you are part of a large group, contact us to save seats together, or you may be split up\nLatecomers may not be admitted, you may be asked to wait before finding your seat if a performance is underway.\nThe event space is located up 6 upstairs, with narrow walkways between seating. The regular seating are black metal folding chairs, please contact us to discuss alternatives if this isn't an option for you. We will do what we can to accommodate as many bodies and abilities as possible.\nTrigger warnings will be given before every show and we have a zero tolerance policy for abusive behaviour.\nYou can contact us at willysmackntush@gmail.com ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Quiz Night, Looking for the perfect midweek hangout?\n\nJoin us for QUIZ NIGHTS every Wednesday at 6:30 PM at The Bridge! Round up your mates and take on the challenge for a night full of fun, good vibes, and friendly competition. Enjoy our special $29 Burger & Drink deal while you put your knowledge to the test. Gather your squad and head over to 28 Cambridge Terrace this Wednesday at 6:30 PM—don't miss out on the fun!\n\n28 Cambridge Terrace | 04 801 1950 | www.cambridgehotel.co.nz",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Russell Properties Open Day, If you're searching for your dream new home, visit the Russell Properties Open Day.\nStep inside their stunning new show home, meet the friendly team,and discover what makes our homes so special. You can even chat through your options with a mortgage broker.\nEven go in the draw to win prizes, kindly supported by:\nEnhance Beauty Churton Park\nChurton Park Pharmacy\nChurton Park New World\nDaisy Jake Hairdressing\nPlacemekers Wellington\nFind out why over 600 families have chosen to call a Russell Properties house home.\n",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Simple Animal at Vogelmorn Upstairs, Simple Animal at Vogelmorn Upstairs, Wellington, Wellington - Sat Sep 13th 2025\n\"Vogelmorn Upstairs is not a wheelchair accessible building. There is an accessible\nbathroom in the space. This is an all ages venue but those under the age of 16 must be\naccompanied by a designated adult after 8pm. The Vogelmorn Precinct is a community\nspace located in a residential area. With that in mind, the team ask that you be kind to\nothers' and that when you leave the gig, you do so quietly to avoid disturbing our\nneighbours.”\n“The Upstairs Bar and Smoked and Pickled Restaurant will be open from 3pm, to book a\ntable for pre-show kai email Alice at smokednpickled@gmail.com” ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Spring Flora - Guided Walk, During one this one-hour spring walk, which will be in the lower Main Garden, we will enjoy the Garden’s re-emergence from winter, marked by the burst of leaf and flower buds and possibly fully opened spring flowers. We will evoke the spirit of Flora, the Roman Goddess symbolising fertility and blossoming.\nMeet at the Founders’ Entrance, Glenmore Street.\nCost: $5 (cash only, please). or free for Friends.\nThis is part of the regular walks run by the Friends of the Wellington Botanic Garden, they run twice monthly throughout the year with a different topic every time.\nJoin the Friends for only $30 a year and all the walks will be free, as well as other great benefits. ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Te Papa Foundation Gala, Wellington’s premier fundraising event, the Te Papa Foundation Gala brings together Aotearoa New Zealand’s leading supporters of arts and culture for one spectacular night in the museum.\nEnjoy handcrafted cocktails, discover new favourites in the Toi Art galleries, savour an exquisite three-course dinner paired with premium local wines, bid in our live charity auction, and then dance to live performances from acclaimed local musicians.\nThanks to Webb’s, the Gala features a special live auction of once-in-a-lifetime experiences, including Sake & sushi with Dick Frizzell, a stunning carving by Tim Steel (Ngāi Tahu), and luxury escapes.\nTickets cost $3,000 for a table of ten, or $300 per person.\nAll proceeds from the Gala supports Te Papa’s work across art, culture, history, science, and nature, ensuring that our much-loved national museum continues to thrive for generations to come.\nCan’t make it? Our digital auction will be hosted by Webb’s from 28 August until 10 September. More information at tepapa.nz/gala.\n",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Wellington Brick Show, The Wellington Brick Show 2025 (LEGO®) is on 13-14 Sept 2025 at Walter Nash Stadium, in Lower Hutt.\nJoin us for lots of fun family activities, food trucks and LEGO building competitions.\nA sensory session will be held from 9-10am on Sunday 14 September. Please message or email us at thewellingtonbrickshow@gmail.com to find out how to book tickets.\nBuy tickets online to avoid the queues www.well-lug.nz/tickets\nLEGO Well-LUG #wbs25 ",
    "label": "Community & Culture",
    "skip": false
  },
  {
    "description": "Around the World In Fifteen Plants - Guided Walk, Join us for an easy 60-minute guided walk to enjoy the stories of 15 plants significant to the countries in which they are found.\nMeet at the Founders’ Entrance, Glenmore Street.\nCost: $5 (cash only, please). or free for Friends.\nThis is part of the regular walks run by the Friends of the Wellington Botanic Garden, they run twice monthly throughout the year with a different topic every time.\nJoin the Friends for only $30 a year and all the walks will be free, as well as other great benefits. ",
    "label": "Conservation & Environment",
    "skip": false
  },
  {
    "description": "Our Beloved Indigenous Vegetation - Guided Walk, In this approximately one-hour downhill walk we will obtain a perspective on several native plants from the ubiquitous, such as our well-known cabbage tree, kōwhai and podocarps, to lesser-knowns such as shrubby toroaro/mingimingi, Bartlett's rātā, Three Kings kaikōmako and Three Kings vine/akapukaea. We will also discuss the phenomenon of species radiation exemplified by Hebe and Kauri.\nMeet at the Cable Car Entrance Lookout, Upland Road, Kelburn.\nCost: $5 (cash only, please). or free for Friends.\nThis is part of the regular walks run by the Friends of the Wellington Botanic Garden, they run twice monthly throughout the year with a different topic every time.\nJoin the Friends for only $30 a year and all the walks will be free, as well as other great benefits. ",
    "label": "Conservation & Environment",
    "skip": false
  },
  {
    "description": "Rā Tūwhera ki Ōtari | Ōtari Open Day, Once a year, we throw open the gates and invite you behind the scenes at Ōtari-Wilton’s Bush. It’s your chance to explore the only public botanic garden in Aotearoa dedicated solely to native plants. Discover the people, plants, and projects that make it special.\n\nMeet our team, chat with partner organisations, join an activity, and find out how we’re working together to protect and restore our natural environment. Whether you’ve never been to Ōtari before or it’s been a while, come along, get curious, and reconnect with nature!\n\nOn the day:\n\n10 am-2 pm: Tū Mātau Ora – Taonga Tākaro (Traditional Māori games) on the lawn\n\n10 am-2 pm: Conservation community partner stalls\n\n10:30 am-2 pm: Plant sale – native plants grown right here in the Ōtari-Wilton’s Bush Trust Nursery\n\n10:30 am, 11:30 am, 12:30 pm, 1:30 pm: Behind-the-scenes tours with Ōtari staff (sign up on the day)\n\n10:30 am -12:30 pm: Rongoā workshop – learn about traditional Māori plant uses. Free registration opens soon\n\n10:30 am, 11:45 am, 12:30 pm, 1:30 pm: Author talks – Ruth Paul, Phil Sirvid, Leon Perrie, and Michael Szabo discuss their recent books\n\n11 am: Lions Ōtari Plant Conservation Laboratory staff show and tell – see our orchid conservation work up close\n\n11 am & 1 pm: String Bean Puppets – two shows: Once in a Full Moon (Kiwi adventures) and Tree Friends (weed-busting fun)",
    "label": "Conservation & Environment",
    "skip": false
  },
  {
    "description": "Big Christmas Spectacular, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket\r\n\r\nPlease note: There is no elevator in the Opera House and access to the Dress Circle and Gallery are via stairs. The Gallery may be unsuitable for patrons with accessibility requirements or experience vertigo. For further information, please contact us on 04 916 1205. ",
    "label": "Family Friendly",
    "skip": true
  },
  {
    "description": "Box of Birds, Hailed as \"the cutest little show in Aotearoa\" (Hamilton Arts Festival 2024), award-winning theatre company Birdlife Productions have created this gorgeous theatre show designed especially for ages 4 to 9 years, Including exquisite puppetry, live interactive songs, projection and the teaching of a waiata, this work reflects our transformative connection to nature. Peter is reluctant to stay with nanna in the school holidays because she lives in the country and doesn't have a TV but Nanna finds ways to engage Peter in her love of the forest, especially the precious manu, when they build a nesting box for Ruru together. Peter is excited to see if Ruru will make her home in the box, waiting patiently while many other birds arrive to check out the box first! And after all that waiting, Nanna takes Peter on an exciting night time forest walk to find Ruru - in the dark! The bird characters are all familiar New Zealand locals, such as piwakawaka, kereru, tui and ruru, and the story highlights the importance of supporting them and the different needs they may have. Teachers and Parents have been ecstatic about this show and hundreds of New Zealand children have been transfixed by it.\nAs quoted by Theatreview: “This is truly a New Zealand show for New Zealand children and all those young-at-heart”.",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Everyone Out Open Mornings - Belmont, Everyone Out Open Morning\nCurious about Nature School? Come along to one of our upcoming Open Mornings to see a session in action, meet our kaiako, and get a feel for the learning and play that happens in the bush.\nBelmont – Wed 27 August, 10.30–11.30am\nPaparangi – Tues 2 September, 10.30–11.45am\nIsland Bay – Thurs 4 September, 10.30–11.45am\nThese free sessions are perfect for whānau considering Nature School in Term 4 or 2026—or just wanting to explore what we do. Parents stay onsite with tamariki, and you’re welcome to come without tamariki if that works best.\nSpaces are limited – RSVP now to Rachel@everyoneout.co.nz or via our booking site\n",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Kiwis Big Hararei, Written by Catriona Tipene & Ryan Cundy\nProduced by Horse With No Name with GRIDLEY by Victoria\nDirected by Catriona Tipene\nFrom the Land of the Long White Cloud to the Land Down Under!\nKiwi is going on his first big holiday from Aotearoa across to the golden shores of Brisbane. He’s got his backpack, a pocket full of worms, and a head full of dreams. The most exciting thing of all is that he might even get to go on a rollercoaster! With his Mum, Kiwi navigates air travel, hotels and conversations with marsupials as his world stretches from the home he knows, to the world over the horizon.\nA tale that celebrates the connection between our two countries, featuring stunning costume designs by GRIDLEY by Victoria and fresh waiata by NZ singer-songwriter Benny Tipene. Brought to the stage by the multi-award winning companies Horse With No Name and GRIDLEY by Victoria, Kiwi’s Big Hararei is a story about spreading your wings and flying into the unknown.\n\nAcclaim for Trees, Bees and Me (2024):\n“I don’t even know where to start in telling you how absolutely captivating, magical and real this show is.” Tania Du Toit, Regional News\n“every costume adds such a beautiful connection between the characters while the colours each beautifully blend so well together.” Brie Keatley, Art Murmurs\nAcclaim for Land of the Long Long Drive (2023):\n“Horse With No Name have come up with one of the best children’s theatre shows that Wellington has seen in quite some time.” Deborah Rea, Theatreview\n\nTuesday 23 September 2025 to Saturday 4 October 2025\nTues – Sat 10.00am and 11.30am\nMeet the cast: Wednesday 24th September 11.30am and Wednesday 1st October 11.30am\nCirca Two\n$20 per person\n$70 family pass (4 tickets) ",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Little Creators, Get creative with Aunty Cara at 11am each Wednesday in PlayHQ!\n\nCome along and try a sensory-based craft. Tamariki work with new and exciting materials, learning different techniques to make special creations.\n\nBest suits ages 3-5, Little Creators is part of our E Tipu E Rea term-time programme.\n\nFree, donations appreciated.\n\nNōku te Ao Capital E, 4 Queens Wharf. Pram parking and accessible bathrooms available.",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Little Creators, Join us in PlayHQ for these 11am Thursday sessions.\n\nProfessor Inventus brings science, laughter and chaos to PlayHQ on Thursdays. Tamariki learn curious concepts about science, nature and the changing seasons.\n\nBest suits ages 3-5, Science Jam is part of our E Tipu E Rea term-time programme.\n\nFree, donations appreciated.\n\nNōku te Ao Capital E, 4 Queens Wharf. Pram parking and accessible bathrooms available.",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Tamariki Time: Toi Art, A free interactive drop-in session for tamariki aged 5 and under. This month, explore the new exhibitions in Toi Art.\n\nAs hōtoke draws to a close, we will be exploring the new Te Whare Tapere, or house of entertainment, in the art studio in Toi Art. Follow prompts to find seasonal stories in our exhibitions and make shadow plays using puppets.\n\nTamariki must be accompanied by a caregiver at all times.",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "Whānau Sculpture with Clay - Creative Arts Holiday Programme, Children and their caregivers are invited to learn how to sculpt with clay!\n\nEach term, Christine brings a different project for the class to work on and in this workshop you will be creating dinosaurs!\n\nOur popular whānau workshops are designed to allow tamariki and their caregivers to work on their own projects side-by-side and learn basic hand-building techniques from experienced ceramicist Christine Winbush.\n\nThe pieces will be fired once, (bisqued) and can be decorated with paint at home.\n\nRecommended age for children are 6 and up. The booking is for one child and one adult and an additional child can be added for only $29.\n\nThis workshop is part of Inverlochy Art School's September School Holiday Programme. For more teen & tween workshops including photography, jewellery making, animation and sewing head to the 'Tamariki and Teens' section of our website.",
    "label": "Family Friendly",
    "skip": false
  },
  {
    "description": "SlavFest 2025 - Festival of Slavic and Balkan culture, food, music and dance, SlavFest 2025 - FREE - A vibrant celebration of Slavic and Eastern European culture!\nMark your calendars: September 6th at Te Whaea: National School of Drama and Dance in Newtown, Wellington.\nWhat to expect:\nThis year, the festival brings even more to enjoy: Ish, Vox Ethno, Balkany, Klezmer Rebs, Krackerjack, Cosmonauts, Wososi, Mehana, traditional Polish, Ukrainian and Bulgarian dancing, Slavic food stalls with dumplings, borscht, and burek, artisan crafts, kids’ workshops, and hands-on cultural activities, language tasters, and singing circles.\nWe can’t wait to dance, sing, and celebrate with you all! See you there! #wellington #festival #wellingtonfestival ",
    "label": "Festivals",
    "skip": false
  },
  {
    "description": "Wellington Jazz Festival - Gregory Porter, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Festivals",
    "skip": true
  },
  {
    "description": "Wellington Jazz Festival - Samara Joy, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Festivals",
    "skip": true
  },
  {
    "description": "Fundraiser For Trish's Campaign: Kneecap, This time last year, Kneecap premiered at the Wellington Film Festival - but not enough people got to see it. Some films deserve the big screen experience, so I’m bringing it back!\nCome along for a movie night supporting a great cause while enjoying this epic film. Set in Belfast, this wild, witty, and politically charged story follows the rise of the real-life rap trio Kneecap, blending music, humour, and rebellion in a way only the Irish can.\nYour ticket includes the screening plus a raffle with a twist\n- and every dollar goes towards my campaign, helping cover those last few expenses. Imagine the good we can do for our communities when I’m elected!\nDate: Monday 8 September\nTime: 5.45pm\nLocation: Lighthouse Cinema Cuba Street\nIt’s a perfect chance to laugh and cry - imagine Derry Girls, Trainspotting and Spinal Tap combined - it will change you for the better and help make a difference – so gather your mates and join us for some great craic!\n",
    "label": "Film & Media",
    "skip": false
  },
  {
    "description": "Seen The Film - Wellington, NZ. A Fundraiser for Te Aro School., We live in an age where, as parents and caregivers, there is more information than ever before. How much screen time is the right amount of screen time for our children? How best can we manage our children's daily meltdowns? Time in, time out, clear boundaries, feel all the feelings - what's best? We are hearing more and more reactive advice on how best to manage our children, yet we are missing the root cause and solution.\nSEEN is a groundbreaking feature-length documentary that not only explores the transformative power of personal healing for parents, but also delves into the scientifically supported effects of such healing on parenting and its impact on child brain development.\nmovie trailer: https://www.youtube.com/watch?v=bZPQXpw6kT0",
    "label": "Film & Media",
    "skip": false
  },
  {
    "description": "Alimentary Trail Wellington EDITION, HIT THE ALIMENTARY TRAIL! It's a big ol' weekend in the Capital City, & while we can't be there in person, we WILL be there in 'beer' as our friends at Monkfish, LBQ & The Malthouse share new brews made right here. Keep an eye on their socials for time & availability! Cheers, everybody! ",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Father's Day High Tea, BRING THE WHOLE FAMILY THIS FATHER'S DAY\n\nThis Father's Day weekend, we’ve crafted a High Tea menu with extra savoury indulgence and bold, satisfying flavours, perfect for those with serious appetites. More of a traditionalist? Our Classic High Tea is still available, alongside our children’s menu for younger guests.\nJoin us on the 5th, 6th or 7th of September to celebrate the father figures in our lives. Explore our menus below. Booking is essential.\n\nHEARTY HIGH TEA\n$60 PER PERSON\n\nVenison scotch egg\nCumin-spiced lamb sausage roll with harissa mayo\nClassic pork pie served with wholegrain mustard\nTarragon chicken finger sandwich\nCheddar & lavosh crackers\nBrandy-soaked sultana scone with cream\nLemon & raspberry profiterole\nWhisky chocolate truffle\n\nServed with bottomless T.W.G. Tea\n\nPlease note that our Hearty High Tea menu cannot be adapted to accommodate dietary or allergy restrictions.\nOur Classic High Tea menu can be adapted to vegetarian, vegan and gluten-free diets.\n\nCLASSIC HIGH TEA\n$55 PER PERSON\n\nCoronation chicken sandwich\nBraised lamb vol-au-vent, feta cream\nParmesan-crumbed bacon hock croquette, apple purée, mustard fruits\nSmoked salmon mousse, beetroot, buckwheat blini\nParmesan custard tart\nWhite chocolate and raspberry profiterole, pâté de fruits\nMacaron of the day\nRhubarb meringue tartlet\nPear scone with vanilla cream\n\nServed with bottomless T.W.G. Tea\n\nOur Classic High Tea menu can be adapted to vegetarian, vegan and gluten-free diets.\n\nCHILDREN'S HIGH TEA\nAVAILABLE FOR UNDER 12 YEAR OLDS | $25 PER PERSON\n\nHam and cheese slider\nFried chicken\nMini pizza\nOat cookie\nStrawberry jam pop pie\nScone of the day\n\nTerms and Conditions & Cancellation Policy\n\nOur Hearty High Tea cannot be modified for dietary requirements. However, our Classic High Tea is available in a Vegetarian, Vegan and Gluten Free version. Please note, we are unable to accommodate dietary requirements without prior notice.\n\nIf not already stated and confirmed at the time of reservation, guest numbers must be confirmed 48 hours prior to arrival.\n\nA credit card must be provided at the time of reservation to secure the booking.\n\nHigh Tea reservations cancelled within 24 hours prior to arrival will incur a cancellation fee of 100% of the total booking.\n\nNo-shows will be charged a cancellation fee of 100% of the total booking.\n\nDecreases in attendee numbers will not be accepted within 24 hours before arrival, and charges will apply based on the confirmed final count.",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Father's Day Lunch, Saturday 6th and Sunday 7th September 2025.\nCelebrate this Father’s Day in the heart of the Wairarapa, surrounded by the breathtaking views of Wharekauhau Country Estate and Palliser Bay. Treat the father figure in your life to a memorable afternoon with a luxurious lunch at our renowned restaurant, where rustic charm meets world-class cuisine.\nOur specially crafted Father’s Day menu highlights the finest seasonal produce, expertly prepared by our talented chefs. Enjoy a variety of mouthwatering dishes, from tender cuts of locally sourced meats to fresh, flavorful sides that will make every bite a celebration. Paired with a selection of New Zealand’s best wines, it's the perfect way to honor ‘Dad’ while taking in the stunning landscapes of rolling hills and expansive coastlines. ",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Saturday 'BAKES' By Onslow College, Each Saturday, we offer a variety of sourdough products next to Onslow College. We always have doughnuts, but on Saturdays we offer bread, savoury baked items, and mini-celebratory sourdough doughnuts.\nAll products can be pre-ordered and picked up on Saturday morning through our website.\nhttps://familykitchenwithmark.co.nz/weekly-menu/\nEFTPOS is always available.\nOur boxed mini-celebratory doughnuts, 70% of the original size, are available for a sale price of $25 for a box of all six flavours.\nOur regular doughnuts cost $6 each or $22 for a box of 4 doughnuts.\nWe also offer catering at Family Kitchen with Mark, so if you have a function or need for in-house dining, check out all our packages on our website. Our doughnuts are also available for purchase all week. Contact Mark on 021 0223 0824 for next-day pickup.\nhttps://familykitchenwithmark.co.nz/grazing-tables-theme.../\nAll our doughnuts contain a lively sourdough & biga starter, for a fuller flavour profile and a springy texture.\nHave you tried our sourdough doughnuts yet?\nOur doughnuts can be pre-ordered and picked up on the day to avoid disappointment (should we run out).\nWe launch a new flavour every two weeks and have created over 180 combinations since selling three years ago.\nSupport has been phenomenal, and we thank everyone so very much indeed for the weekly sales.\nIf you are not following us on our social media channels, please consider doing so, as it helps the company grow and increases the exposure of our products. Thank you.",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "We\nMac 'n' Cheese pop-up! Kaibosh X Everybody Eats collab for Welly On A Plate, We\nMac 'n' Cheese! A feast with purpose, where every bowl makes a difference. Celebrate the final day of Visa Wellington On a Plate and the end of winter with the ultimate comfort food: mac 'n' cheese, served all day long.\nAt just $10 per serve, every bowl will help raise funds for Everybody Eats and Kaibosh - two of Wellington’s legendary food rescue and community dining champions. Help us hit our target of 2,000 bowls in one day!\nWHEN: Sunday 31 August, 1-8pm (or sold out)\nWHERE: 60 Dixon Street (upstairs)\nCOST: $10 per bowl (pay-what-you-can options available).\nWalk-in only, dine-in or takeaway.\nVegan and Gluten Free options available.\nBring your friends, whānau, or the whole flat!\nYou'll be able to customise your mac 'n' cheese with a range of toppings and flavours which have been made with rescued food, showcasing just how delicious food recovery can be. From rainbow pickles to herby crunchy crumb, extra #FoodRescue flavour bombs to spice up your mac!\nAs official charity partners of the Wellington On A Plate Festival, Everybody Eats and Kaibosh turn comfort food into real impact for our communities.\nWe\nkai. We\nWelly.\nShare your\nwith Welly.\nPay-it-forward to help us share hearty kai with more people in Pōneke: https://donorbox.org/welovemacncheese-donation\nThank you to Fonterra's Doing Good Together programme, PAK'nSAVE Kilbirnie, Harrington's and All Good for supporting us with this event which is a joint fundraiser for our two charities.\nThe goal on 31 August is to serve 2,000 bowls AND to also fund 2,000 meals for the community. Join the celebration, enjoy incredible kai and help make a real difference. ",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Young Flame, Young Flame is a dining experience inspired by fire. Think fire show and flaming cocktail on arrival, to then dine surrounded by hundreds of flickering candles casting a warm glow, for an evening of fine finesse.\nQT Wellington’s Executive Chef, Antoine Collet, delivers a bold three-course chef’s tasting menu that’s as deliciously playful as it is refined. And if you like the finer things in life, while devouring each course, you’ll sip on wine and beer to your heart’s desire and let the sultry sounds of live music weave through the room, adding a touch of old-school glamour to your night.\nYoung Flame promises an evening steeped in elemental elegance.\nThis event is part of Visa Wellington On a Plate for 2025. Tickets are now available\nTickets are $180 and includes:\nThree-hour beverage package\nThree-course set menu\nFlaming cocktail\nLive entertainment ",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Česká a Slovenská setkání v hospodě, ** První patro v Hotel Bristol **\nFotbálek, kulečník, pivko!\nPoslední zimní hospoda, tak doražte do hospody pokecat, poznat nové kámoše a kámošky, nasdílet cestovatelské plány, probrat práci, campervany, víza, prodloužení víz, kempy, trajekty, plány na jaro/léto...\nPrvní jarní hospoda!\nStavte se domluvit na saunu, badminton, volejbal, bowling, kite, surf, nebo třeba přiložit ruku k dílu na jiných událostech ČS klubu.",
    "label": "Food & Drink",
    "skip": false
  },
  {
    "description": "Re-imagine Pōneke: Co-design our city, What would Wellington look like if it truly reflected our hopes for a just, sustainable, and thriving city – not in 30 years, but right now?\nJoin us for Re-imagine Pōneke, a half-day unconference where Wellingtonians will come together to dream big, share ideas, and co-create a bold vision for the future of our city. Through participant-led breakout sessions and live illustration, we’ll collectively map out what a better Wellington could be – from housing and climate action to transport, community spaces, and beyond.\nThis event is part of Stronger Together, a youth-led campaign making local democracy real and relevant in Pōneke. As local elections approach, it’s time to reimagine how our city works for us all and explore the power of community-driven ideas.\nWhy come along?\nConnect: Meet others who care deeply about the future of our city.\nCreate: Contribute your vision to a live, visual representation of a better Wellington.\nCollaborate: Join participant-driven sessions on issues that matter most to you.\nInspire change: Leave with practical ideas and energy to take forward.\nWhether you’re a seasoned organiser, new to local politics, or simply passionate about Wellington’s future, this event is for you.\nTickets: Free and koha-based (pay what you can).",
    "label": "Government & Politics",
    "skip": false
  },
  {
    "description": "Breathwork: A Gentle Reset, Breathwork: A Gentle Reset\nTake a pause from the noise of daily life.\nThis breathwork journey begins with gentle movement to awaken the body and open the breath. Through slow, mindful stretches, we begin softening tension and grounding into the present.\nYou’ll then be guided through two styles of breathwork — each offering a unique pathway inward. There’s no pressure or expectation, just the freedom to explore what feels right for you:\nA dynamic, connected breath for those who wish to build energy, move emotion, or break through internal blockages\nA slow, rhythmic breath for those seeking stillness, calm, and deeper grounding\nBoth approaches invite a sense of spaciousness — physically, mentally, and emotionally — while supporting nervous system balance and inner clarity.\nTo gently close the session, we’ll move into a quiet, nurturing meditation to support integration and leave you feeling steady, clear, and connected.\nAfterwards, stay and enjoy a nourishing plant-based dinner and dessert, lovingly prepared to complement the experience — because healing is also about how we feed and care for ourselves.\nWhy Breathwork?\nBreathwork has helped so many shift from a state of tension and overwhelm into a place of ease, clarity, and resilience — often after just one session. It’s a simple, powerful practice that reconnects you to your body, your breath, and your inner stillness.\nYou’ll leave feeling more grounded, more present, and more like yourself again.\nMeet Karla, your host\nKarla is a breathwork and trauma-somatic facilitator based in Aotearoa (New Zealand), originally from Malta. With over a decade of experience in Reiki and three years facilitating trauma-informed, science-based breathwork, Karla combines holistic tools, meditation, and conscious breathing to support nervous system regulation and deep emotional healing. Her offerings help release stored trauma, reduce stress and anxiety, and activate oxytocin—the “love hormone”—fostering connection, vitality, and a sense of wholeness. She currently holds regular classes, workshops, and transformative retreats that nurture the mind, body, and spirit.\n................................................................................................\nBooking for Thursday is recommended!\nFor more details and to book please go here--\nhttps://bit.ly/eventTickets\n...............................................................................................\nMake Thursdays your night to connect and take a break from your week. Events range from creative workshops, wellness courses to entertaining experiences. All within a down-to-earth and welcoming space. Each event wraps up with a plant-based dinner and dessert.\n...............................................................................................\nBhakti Lounge\n1/175 Vivian Street\nWellington",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Gong Bath at Vogelmorn Hall, $20\nLimited door sales for $25\nPlease bring a yoga mat, pillow, eye mask and blanket - or whatever it is you need to feel most warm and comfortable\nDiscover the transformative effects of sound therapy with this 1-hour gong bath experience.\nDuring this session, participants will be surrounded by the resonant vibrations of gongs, carefully designed to induce deep states of relaxation and calm. As you settle into the experience, allow the soothing tones to wash over you, releasing tension and promoting a sense of inner peace.\nScientific studies have highlighted the benefits of sound therapy, particularly gong baths, in reducing stress and promoting overall well-being. The rhythmic patterns and overtones of the gongs can help entrain brainwaves, leading to a meditative state and improved mental clarity.\nBeyond the immediate effects, many participants report experiencing lasting benefits such as improved sleep, reduced anxiety, and enhanced mood following a gong bath session. By immersing yourself in the healing vibrations of the gongs, you can tap into a deeper sense of relaxation and rejuvenation.\nWhether you're looking to unwind after a long day or explore new avenues of self-care, this 1-hour gong bath offers a unique opportunity to reconnect with yourself and find balance amidst the hustle and bustle of daily life. There will be cups of tea available afterwards to help us integrate and ground.\nTHIS EVENT IS RESTRICTED TO 40 PEOPLE ONLY\nAbout Me\nErika is a musician and astrologer based in Te Whanganui-a-Tara. She has 30+ years musical experience. Erika has an interest in the healing properties of sound for mental and physical wellbeing, which she currently explores through her gong bathing practice",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Humans: Why & What To Do, Humans: Why & What To Do\nTalk by Devamrita Swami + Plant-Based Dinner & Dessert\nWe’re the most connected generation in history — and somehow the loneliest.\nWe’ve built more technology than any civilisation before us — and still can’t solve our basic problems.\nWe talk endlessly about progress — while the planet burns and mental health plummets.\nWhat if the trouble isn’t just what we’re doing… but that we’ve forgotten why we’re doing it?\nIn this bold, no-fluff talk, Devamrita Swami — a world-traveling monk, strategist, and social critic — unpacks the mess we’re in and asks the questions most of us avoid: Why are we here? And what should we actually be doing about it?\nAfterwards, stick around for a plant-based dinner and dessert — fresh, colourful, and made to share. Grab a plate, grab a seat, and dive into real conversations with people who are curious, open-minded, and up for something different.\nMeet Devamrita Swami, your host:\nDevamrita Swami is an educator, author, and monk who has spent over forty years exploring and sharing the wisdom of bhakti-yoga. He brings ancient Vedic teachings to life, effortlessly navigating the latest research in archaeology, consciousness, ancient history, neuroscience, social science, and psychology. Author of Searching for Vedic India and Hiding in Unnatural Happiness, he combines philosophy with practical insights on happiness, wellbeing, and personal fulfillment. For anyone seeking to channel the human drive for fulfilment in a meaningful and sustainable way, Devamrita Swami offers clear, engaging, and indispensable wisdom.\n................................................................................................\nBooking for Thursday is recommended!\nFor more details and to book please go here--\nhttps://bit.ly/eventTickets\n...............................................................................................\nMake Thursdays your night to connect and take a break from your week. Events range from creative workshops, wellness courses to entertaining experiences. All within a down-to-earth and welcoming space. Each event wraps up with a plant-based dinner and dessert.\n...............................................................................................\nBhakti Lounge\n1/175 Vivian Street\nWellington",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Master Your Thoughts: Tools for Clarity and Control, Master Your Thoughts: Tools for Clarity and Control\nYour mind is a powerful place — but sometimes it feels like it’s running the show. In this engaging evening with Chaitanya Charan, a monk and internationally acclaimed speaker, you’ll discover practical tools to quiet mental noise, sharpen focus, and make clear, confident choices. Drawing on timeless wisdom and modern psychology, he’ll share insights to help you understand your thought patterns, break free from unhelpful mental loops, and channel your mind’s energy in a positive direction.\nSet in our welcoming and creative space, this event blends inspiration with connection. After the talk, enjoy a nourishing plant-based dinner and dessert — a perfect chance to unwind, reflect, and connect with like-minded people over great food.\nMeet Chaitanya Charan, your host\nWith warmth, insight, and humour, Chaitanya Charan has a way of opening minds and perspectives. A monk for over 25 years, he has dedicated his life to exploring how we think, decide, and live — and how to do it with more clarity and purpose. He has spoken in more than 30 countries, from Ivy League universities to grassroots gatherings, engaging audiences with his clear thinking, relatable stories, and practical strategies. An accomplished author and speaker, Chaitanya Charan offers insights that challenge perspectives, spark reflection, and inspire real change.\n................................................................................................\nBooking for Thursday is recommended!\nFor more details and to book please go here--\nhttps://bit.ly/eventTickets\n...............................................................................................\nMake Thursdays your night to connect and take a break from your week. Events range from creative workshops, wellness courses to entertaining experiences. All within a down-to-earth and welcoming space. Each event wraps up with a plant-based dinner and dessert.\n...............................................................................................\nBhakti Lounge\n1/175 Vivian Street\nWellington",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Men's Circle: Honest Conversations & Connection, Men’s Circle: Honest Conversations & Connection\nIn a world where men are often expected to have everything figured out, this gathering offers a space to be genuine, not perfect.\nThis is a free event, with an optional plant-based dinner available for $15. While there’s no obligation to stay for dinner, sharing a meal together offers a meaningful way to strengthen connections. Andre and Sri Jiva co-host this circle with a shared passion for creating authentic, supportive spaces where men can connect deeply—offering this gathering simply because they believe in its importance.\nThe Men’s Circle provides a safe and nurturing environment where men can share openly, express their feelings, and encourage personal growth—free from societal pressures to be stoic or self-reliant. Through honest sharing and collective support, participants build resilience, deepen self-awareness, and strengthen their sense of identity and purpose.\nStructure of the Circle\nGathering in a Circle: Participants sit in a circle to symbolize equality and unity.\nA short meditation or moment of silence may be included to help everyone arrive and connect.\nTalking Object: A sharing stick or object is placed in the center. Only the person holding the object may speak, ensuring uninterrupted sharing.\nOpen Sharing: Anyone may choose to share while holding the object. Sharing is optional, and passing is always respected.\nActive Listening: While one person shares, others listen attentively without speaking, interrupting, or offering advice. The focus is on witnessing and being present.\nNo Judgments or Advice: Participants refrain from judging or offering unsolicited advice, creating a safe space for authentic expression.\nClosing: The circle may conclude with a group reflection, a moment of gratitude, or a simple acknowledgment of the shared experience.\nCircle Agreements\nSupportive Environment: We are here to uplift and support one another, fostering trust and brotherhood.\nFocus on the Present: Share what's alive for you now, focusing on your emotions and experiences to deepen emotional awareness.\nUse \"I\" Statements: Speak from your personal perspective using \"I\" statements to promote authenticity and responsibility. Avoid generalizations like \"we\" or \"us.\"\nNo Judgment or fixing: Refrain from judging others sharing or offering unsolicited advice, ensuring a safe and non-critical space.\nConfidentiality: What is shared in the circle stays in the circle. You may discuss your own experience outside the group, but keep others' details private.\nMeet Andre and Sri Jiva, your hosts\nAndre has been immersed in men’s work since the age of 13, when he first experienced a rite of passage in Golden Bay. That formative experience sparked a lifelong connection to circle work, which he later deepened by returning as a mentor. A multi-instrumental musician, poet, and pranayama (breathwork) facilitator, Andre also brings his passion for ecstatic dance, philosophy, and authentic connection into his offerings. He is deeply inspired by the question of what it means to be human—how we can more fully experience our aliveness, our depth, and reconnecting with the beauty of life together.\nSince childhood, Sri Jiva has been fascinated by meaning, purpose, and authentic life fulfilment. This, among other things, led him to join a monastery at the age of 19. After years of monastic training, he chose to marry and pursue a career. He felt called to use his monastic experience to help others understand themselves, and to find wisdom, meaning, and purpose in their own lives. Inspired by this calling, he went to university to study counselling. Now, Sri Jiva and his wife live near Wellington, where he works with a small team of counsellors, supporting clients individually and in groups.\n................................................................................................\nBooking for Thursday is recommended!\nFor more details and to book please go here--\nhttps://bit.ly/eventTickets\n...............................................................................................\nMake Thursdays your night to connect and take a break from your week. Events range from creative workshops, wellness courses to entertaining experiences. All within a down-to-earth and welcoming space. Each event wraps up with a plant-based dinner and dessert.\n...............................................................................................\nBhakti Lounge\n1/175 Vivian Street\nWellington",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Sika Sound Journey, This powerful experience is like a soundtrack that is crafted to go with your life.\n\nSomething between an ancient ceremony and a movie soundtrack.\n\nPlease bring a yoga mat, pillow and blanket. Be prepared to drop into a deep space.\nDoor sales will be available if there is space. Advanced booking is recommended.\n\nSika's Sound Journeys are truly unique. They are sonic explorations that feature didgeridoos, drums, flutes, voice and orchestral elements. A collection of foraged sounds from objects he has recorded in nature, add even more textures. Many of his sounds are completely unrecognisable and abstract. Immersed in this cocoon of abstract sound, we can find ourselves in the most surprising places in our mind. In this timeless realm, beyond the normal limitations of rational reality, anything is possible.\n\nAn epic adventure deep inside yourself.\n\nJourney to worlds within worlds on incredible sound waves.\n\nSika creates a safe space to relax deeply and connect with our inner guidance. This Sound Journey begins and ends with a short guided visualisation.\n\nThere will be two journeys with an interval. Most people choose to lie down, so once again, please bring a yoga mat, pillow and blanket to get really comfortable.\n\nA journal is also recommended.",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Sound Healing Experience, Sound Healing Experience with Claudio Escutia\n\nIt’ll be a transcendent evening of Sacred Harmonic Sounds, where multi-instrumentalist Claudio Escutia will guide you through a deeply restorative sonic experience. Plus - there will be an amazing plant-based dinner & dessert included in your ticket!\n\nLet the vibrations of Gongs, Crystal and Tibetan singing bowls, Native American flutes, and other ancient instruments wash over you—melting away tension, quieting the mind, and opening a doorway to inner stillness.\n\nWith Claudio’s masterful soundscapes, you’ll not only hear the music but feel it resonating through your body, inviting profound relaxation and a reconnection to your heart. No prior meditation or yoga experience is needed—just come as you are and let the sound carry you into a space of deep peace.\n\nWhat to Bring?\nYoga mats, blankets & cushions are provided but you are also welcome to bring your own yoga mat and any extra cushions or any other comforts for the ultimate experience!\n\nWhy You Won’t Want to Miss This\n\n\nA rare opportunity to experience Claudio’s unique fusion of world music traditions and healing sound\n\nA deeply immersive, meditative experience—perfect for relaxation and renewal\n\n\nLimited spaces\n\nMeet Claudio Escutia, your host\nBorn into a musical family in Mexico City, Claudio’s lifelong passion for sound has taken him across the globe—from studying jazz in Montreal to mastering Tibetan singing bowls in Kathmandu. His music weaves together classical training, world instruments (Sitar, Esraj, Harmonium, and more), and a deep reverence for sound as medicine.\n\nReady to unwind and recharge through the magic of vibration?\n\nLearn more or listen to Claudio’s music here:\n\nSoundCloud https://soundcloud.com/claudioescutiasounds\nInstagram https://www.instagram.com/claudio_yoga_sound_healing\nFacebook https://www.facebook.com/soundhealingyogamusicclaudio",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Sound Healing Experience, Sound Healing Experience with Claudio Escutia\nIt’ll be a transcendent evening of Sacred Harmonic Sounds, where multi-instrumentalist Claudio Escutia will guide you through a deeply restorative sonic experience. Plus - there will be an amazing plant-based dinner & dessert included in your ticket!\nLet the vibrations of Gongs, Crystal and Tibetan singing bowls, Native American flutes, and other ancient instruments wash over you—melting away tension, quieting the mind, and opening a doorway to inner stillness.\nWith Claudio’s masterful soundscapes, you’ll not only hear the music but feel it resonating through your body, inviting profound relaxation and a reconnection to your heart. No prior meditation or yoga experience is needed—just come as you are and let the sound carry you into a space of deep peace.\nWhat to Bring?\nYoga mats, blankets & cushions are provided but you are also welcome to bring your own yoga mat and any extra cushions or any other comforts for the ultimate experience!\nWhy You Won’t Want to Miss This\nA rare opportunity to experience Claudio’s unique fusion of world music traditions and healing sound\nA deeply immersive, meditative experience—perfect for relaxation and renewal\nLimited spaces\nMeet Claudio Escutia, your host\nBorn into a musical family in Mexico City, Claudio’s lifelong passion for sound has taken him across the globe—from studying jazz in Montreal to mastering Tibetan singing bowls in Kathmandu. His music weaves together classical training, world instruments (Sitar, Esraj, Harmonium, and more), and a deep reverence for sound as medicine.\nReady to unwind and recharge through the magic of vibration?\nLearn more or listen to Claudio’s music here:\nSoundCloud Claudio Escutia\nInstagram Claudio Escutia Yoga and Sound Healing (@claudio_yoga_sound_healing)\nFacebook Claudio Escutia Yoga - Sound Healing- Music\n................................................................................................\nBooking for Thursday is recommended!\nFor more details and to book please go here--\nhttps://bit.ly/eventTickets\n...............................................................................................\nMake Thursdays your night to connect and take a break from your week. Events range from creative workshops, wellness courses to entertaining experiences. All within a down-to-earth and welcoming space. Each event wraps up with a plant-based dinner and dessert.\n...............................................................................................\nBhakti Lounge\n1/175 Vivian Street\nWellington",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "The Overthinking Mind: Finding Peace in Mental Chaos through hypnosis, Tuesday Wellbeing Seminars\n\nThe Overthinking Mind: Finding Peace in Mental Chaos through hypnosis\nIf your brain won’t stop running in circles, this workshop is for you.\n\nIn 60 minutes, we’ll unpack why your mind loves to overthink, how to break out of thought spirals before they swallow your day, and I’ll guide you through a relaxing hypnosis to quiet the noise on the spot. You’ll leave with simple tools you can use anytime life feels too loud.\n\nMeet your host, Gopi\n\nGopi helps spiritually minded professionals achieve clarity, overcome negative thought patterns and habits through his unique integration of hypnotherapy and palmistry. During his former life as a monk, he delved into the timeless wisdom of astrology, palmistry, and the ancient knowledge of the mind and consciousness, gaining deep insights into human psychology. He combines these powerful teachings with modern, effective tools as a certified practitioner in applied hypnotherapy, trauma informed coach, along with the knowledge he gained through his diploma in psychology and counseling.",
    "label": "Health & Wellness",
    "skip": false
  },
  {
    "description": "Dance Night - OUT HOUSE #1: Benny Salvador / Class War on the Dance Floor / UMU, Get yr dancing shoes on and come on down for the first instalment of OUT HOUSE, Pyramid Club's new, semi-irregular dance night showcasing the work of local creative musicians and producers. Skipping along the intersection of dance music and experimental sounds, Out House aims to get your feet moving, your body shaking and your brain waves oscillating. We are kicking things off with three exciting acts, Benny Salvador, Class war on the Dance Floor and Riki Gooch and Daniel Beban's new duo UMU.\n---\nOne of the most exciting young talents in his home country's revitalised dance music underground, Benny Salvador is a DJ, multi-instrumentalist and producer from Wellington whose music finds common threads between house, techno, electro, disco-funk, dub, boogie and beyond.\n---\nClass War on the Dance Floor is solo project of Pōneke musician, Marika Pratley. A tapestry of vaporwave, chiptune, ambient, lo-fi, retro synthwave and hip hop. Marika is inspired by artists from Wendy Carlos to Peaches, Eno to Merzbow.\n---\nUMU is a duo of Riki Gooch and Daniel Beban. Silver Apples meets Kuduro with Riki's deep grooves played on an 80s Roland electronic drum kit which are manipulated and dubbed out by Dan on two Tama Techstar drum synths.\n$17.50 presales available via UTR\nSpecial thanks to CNZ for supporting Pyramid Club's programme ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Family Shiny - Akatarawa Forest, Registrations open NOW\nWhat to expect\nThis is a “Family Shiny” trip into the Akatarawa Forest.\nNon members are welcome to join us but must register to obtain details of start time and location.\nVehicles must have a low ratio gearbox and must not be a 4wd car, station wagon or van, and if a soft top must have a roll cage.\nVisitor Registration- $20.00 per driver\nThere is no trip fee for this trip however non-members pay a “Day Membership Fee” of $20. This is payable in Cash to the Trip Leader on the day.\nThe trip should be relatively easy as it needs to cater for people just starting out and all types of 4wd vehicles – but a good way to see if you want to get into 4wding and a chance to meet some of our club members (if you are unsure if your vehicle is suitable just ask).\nNo Dogs Allowed sorry\nOnce you have completed 3 Family Shinys you can join the club but can only participate in Family Shiny or Touring Class trips. Once you have also done a Training Day and had your vehicle inspected by one of our approved inspectors you can come along on our other more adventurous trips. To find out more on how to join our club go to https://ccvcwellington.wildapricot.org/page-1725861.\nLike our Facebook page to find out about more trips and club nights. ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Monthly Life Drawing, Unleash your artistic side at our koha Life Drawing sessions, hosted monthly at the Gallery.\nWith a mix of timed short and long poses, you are invited to bring your own materials or use the basic supplies we provide.\nThe sessions run from 2 pm to 4 pm—please arrive early to set up. We'll take a short kaputī break halfway through. This is a koha event, with all contributions going directly to our models. Friends and whānau are welcome!\nAccessibility Information: The New Zealand Portrait Gallery is an accessible venue, all on one level. There is an accessible wharepaku at the back of the venue. The gallery has automatic sliding doors and glass doors that can be pushed or pulled to enter. We have a wheelchair available for use within the gallery, and there is low stool seating throughout. If you have any questions regarding accessibility or if there is something we could do to make your visit easier, please get in touch. ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "OPEN MIV - Vogelmorn Upstairs, Open Mic / Variety show night at Vogelmorn Upstairs\nStep into the spotlight and share your talent on the Upstairs stage.\nMusic, stand-up, poetry, storytelling, movement, experiments. If it's performable, it's welcome.\nNo genre too strange, no format too small.\nA vocal mic and simple PA will be provided, please bring along anything else you need to perform.\nBar open from 3pm, Happy hour from 3pm to 6pm, Open Mic from 5pm.\nSign-up on the night - all voices, styles, levels of experience etc welcome ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Paint and Wine Night in Wellington - Magical Dragonflies, The concept is simple - take a brush in one hand, a drink in the other and let’s paint a masterpiece!\nJoin us for a creative night of drinking\nand painting\nin the heart of Wellington! No previous painting experience necessary. Get your creative juices flowing and your brush strokes going!\nDrinks: No drinks are included in the ticket price, but drinks are available for purchase.\nFood: A delicious menu will be available to purchase throughout the event.\nWhat is Paintvine?\nIt’s a fun social painting class where our artists will run you through step-by-step instructions on how to create your very own masterpiece in a fun and relaxed bar setting. Perfect for dates, catching up with mates or for meeting new friends!\nWe provide all the materials you need (high-quality canvas, acrylic paint, brushes). All you need to bring is your creative spirit (or find some at the bottom of a glass). At the end of the night you will leave with your own painting ready to hang up on your wall.\nFor tickets, future events, FAQs and more info head to\n[[https://paintvine.co.nz/] ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Pop Remixed, Experience a night combining the new generation of pop artists with high-energy beats. Hear from the new era of pop singers such as: Pink Pantheress, RAYE, Charli XCX, Lorde, Dua Lipa, JENNIE and more…\nRemixes from noisecontrol:\nDJ RH\nMUDBABY\nmr playups\nOur mates at Lulu’s have provided special themed drinks for the night! If dancefloors aren't your thing, there are plenty of seating areas to chill, chat and have a go at our pop-themed quizzes. Join us for a night full of lights, tunes and spectacle, you won't want to miss this one.\nLimited tickets available! No door sales sorry :(\nFollow us at: @kickbackeventsnz for more info and events!\nFAQ:\nWill there be door sales?\nThere are NO door sales at this event. Tickets are only available on Humanitix until date of the event.\nDo I need my ID?\nR18 identification will be required on entry.\nCan I refund my ticket?\nYou can refund your ticket up to 7 days before the event.",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Pre Paid Carparking tickets, Get your Sky Stadium car park sorted in advance for the Blackcaps v England ODI on Saturday 1 November. Secure your spot early and avoid the hassle of finding a park on the day.\nIf you require a mobility car park space, please complete the online form here.\nOnline parking sales close one hour prior to the car park open time.\nCar parking EZY tickets will need to be printed and be ready to show on your arrival to the car park. Once parked, please display clearly on your dashboard.\nStandard size vehicles only up to 2m wide x 5.4m long x 2.2m high. Larger vehicles may be turned away at the owners' risk. Please contact Sky Stadium in advance should you wish to bring a large vehicle.\nPlease note: parking refunds will only be given if the match is called off prior to gates opening.\nCar park open: 10:00am\nGates open: 12:30pm\nMatch starts: 2:00pm",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Roxy Retro | Twilight, Step back into the world of vampires and werewolves, celebrating Bella's birthday on September the 13th we're bringing Twilight back on cinemas. To revive this love triangle debate, what would you be sipping? 'Team Edward' and 'Team Jacob' cocktails available to pre-order with your tickets. Can't decide? We'll have enough to upgrade you that night.\nHigh-school student Bella Swan, always a bit of a misfit, doesn't expect life to change much when she moves from sunny Arizona to rainy Washington state. Then she meets Edward Cullen, a handsome but mysterious teen whose eyes seem to peer directly into her soul. Edward is a vampire whose family does not drink blood, and Bella, far from being frightened, enters into a dangerous romance with her immortal soulmate. ---\n",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Sky Stadium Car Parking, Get your event day car park sorted in advance for the Ed Sheeran Loop Tour at Sky Stadium. Secure your spot and avoid any queues on the day. With limited car parking in the CBD, this is the best way to secure your spot and avoid missing out, especially if you are coming from out of town.\nIf you require a mobility car park space, please complete the online form here.\nOnline parking sales close one hour prior to the car park open time.\n\nCar parking EZY tickets will need to be printed and be ready to show on your arrival to the car park. Once parked, please display clearly on your dashboard.\nStandard size vehicles only up to 2m wide x 5.4m long x 2.2m high. Larger vehicles may be turned away at the owners’ risk.  Please contact Sky Stadium in advance should you wish to bring a large vehicle.",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Stargazing 101: Astronomy for Beginners, Perfect for anyone interested in the night sky, this two-hour live session under our immersive planetarium dome will guide you through the basics of stargazing: how and why the stars and planets move the way they do; how to find South and other useful markers in the sky; and how to locate your place in space.\nSit back and enjoy being taken on a detailed tour of the night sky with our high-definition laser projectors.\nIncludes:\n- Intermission with refreshments\n- Access to Space Place’s galleries and interactive exhibits\n- 20% discount at Space Place Shop",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Watercolour and Wine Night in Wellington - Oh Deer!, Turn wine into watercolour! Take a brush in one hand, a drink in the other, and let’s paint a watercolour masterpiece!\nJoin us for a beginner's watercolour painting event full of fluid colour mixing and delicate brushwork where you’ll craft your own bespoke watercolour artwork. One of our watercolour experts will guide step-by-step through the watercolour process and will encourage you to add your own unique touch.\nDrinks: No drinks are included in the ticket price, but drinks are available for purchase.\nFood: A delicious menu will be available to purchase throughout the event.\nWhat is Paintvine?\nIt’s a fun social painting class where our artists will run you through step-by-step instructions on how to create your very own masterpiece in a fun and relaxed bar setting. Perfect for dates, catching up with mates or for meeting new friends!\nWe provide all the materials you need (high-quality watercolour paper, watercolour paint, brushes). All you need to bring is your creative spirit (or find some at the bottom of a glass). All our events are in licensed venues, so you can purchase drinks to sip as you create! At the end of the night, you will leave with your own watercolour painting!\nFor tickets, future events, FAQs and more info head to\n[[https://paintvine.co.nz/] ",
    "label": "Hobbies & Interests",
    "skip": false
  },
  {
    "description": "Artisan Craft Market, The Artisan Craft Market is a premium handmade event that takes place across various locations in the broader Wellington region. This high-quality market is designed to foster a welcoming and friendly atmosphere.\n\nOur vision at Artisan Craft Market is to make the market accessible to those who appreciate shopping locally. We aim to provide a platform that supports local artisans, allowing them to showcase their meticulously crafted, high-quality products. By bringing the market directly to the people, we hope to celebrate and promote the unique talents of our community’s skilled artisans.\n\nCome support local at our NEW market in Wainuiomata (Lower Hutt City)",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Artisan Craft Market, The Artisan Craft Market is a premium handmade event that takes place across various locations in the broader Wellington region. This high-quality market is designed to foster a welcoming and friendly atmosphere.\n\nOur vision at Artisan Craft Market is to make the market accessible to those who appreciate shopping locally. We aim to provide a platform that supports local artisans, allowing them to showcase their meticulously crafted, high-quality products. By bringing the market directly to the people, we hope to celebrate and promote the unique talents of our community’s skilled artisans.\n\nCome support local at our monthly market in Lower Hutt City outside at the Dowse Square!",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "CUPRA 3-Day Demo Sale, Get ready for the CUPRA 3-Day Demo Sale! For three days only, explore our demonstrator and approved pre-owned CUPRA vehicles at exceptional prices.\nBrowse a selection of Formentor, Leon Sportstourer, Ateca, and more.\nSaturday only: Step into our racing simulator, feel the thrill, grab a Red Bull, and then take a CUPRA performance car for a test drive.\nMake Saturday extra special with simulator fun, Red Bull, and cake – it’s not your usual test drive!\nStock is limited and deals are only available while vehicles last – don’t miss your chance to drive away in a premium CUPRA.",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Creepy Cute Market, The Creepy Cute Market Returns to Wellington!\nGet ready, Wellington! The Creepy Cute Market is coming back to town!\nWhen: Saturday, 30 August 2025, 9:30am – 2:30pm\nWhere: Thistle Hall, Upper Cuba Street, Wellington\nIndulge your love for the weird, whimsical, and wonderfully wicked at a market where spooky meets sweet. After a hauntingly successful run last time, we're thrilled to return with even more delightfully dark treasures for all you macabre-loving misfits.\nExpect:\nSpine-tingling art & prints\nSpooktacular fashion & accessories\nMorbidly cute homewares\nHandcrafted oddities by local makers\nAnd everything your gothic heart desires\nWhether you're a long time lover of the bizarre or just creepily curious, this market is for you. Meet fellow oddity enthusiasts, shop from passionate creators, and embrace your spooky side in the heart of Wellington.\nFree entry | All ages welcome | Costumes encouraged!\nDon’t miss the return of the Creepy Cute Market. It's going to be wicked fun.",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Fashion Designer Pranay Baidya – North Island Pop-Up Tour, We’re so excited to be hosting designer Pranay Baidya at Sable on Tuesday, 8th September, and we would love for you to join us.\nThis is your chance to see and try on some of the most exquisite dresses, crafted with Pranay’s signature blend of tradition and contemporary style.\nAurea and I will be there, and Sarah Meikle from All India Permit Tours, together with Pranay himself, to personally welcome you to this exclusive showcase of handcrafted fashion.\nWe can’t wait to share this special afternoon with you. ",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Mean Market, MEAN MARKET is back this September at Mean Doses Taproom — and we’re bringing the full RETRO buzz!\n\nCome hang for a Saturday of brews, beats, and browsing some seriously cool local finds.\n\nExpect arcade games, pool tables, throwback 80s tunes, wintery drinks, and a killer line up of local makers and creative stalls.\n\nRock up solo, roll in with your mates — even bring the kids (yep, we’re family-friendly)… just make sure you’re there!\n\n* 80s music | Craft beer | Retro vibes | Local legends\n* Unique treasures\n* Cold brews + warm vibes\n* Cosy winter feels\n* Pure arcade nostalgia\n\nFREE ENTRY. Big vibes. Good times.",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Ngaio Village Market, The flowers are starting to bloom and what better way to spend the beginning of Spring, than joining us at the Ngaio Village Market on Sunday, 7 September 2024, at the Ngaio Town Hall!\n\nThis gorgeous little craft market will be open from 10am – 3pm and have a stunning selection of locally crafted products including:\n\n- Plants, fresh flowers & seedlings\n- Jewellery\n- Clothing, bags and accessories\n- Crochet & knitted toys\n- Scented candles\n- Homewares & soft furnishings\n- Children & baby items\n- Skincare, cosmetics, soaps & natural products\n- Gifts & treasures\n- Resin items\n- Crystals\n- Wooden & metal works\n- Ceramics & pottery\n- Pet accessories\n- Carvings & sculptures\n- Wool products\n- Much much more!\n\nA coffee cart, food trucks and fresh artisan bakery items will provide a selection of the delicious food and drink to enjoy while you peruse the various treasures and beautiful items for sale.\n\nEach stall will have either cash or eftpos facilities available, however it is best to bring cash to the market too.\n\nInvite a friend or 2 and have a great day out at this fantastic community event!",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "Plant Sale, I have had great success with NZ and imported seed propagation this year so we have a wonderful range of plants ready to go in the ground now.\nSome varieties are extremely limited due to the cost of the imported seed and the tiny amount of seeds per packet (only 5 in some cases).\nWe will be accepting preorders by messenger so get in quick if you don't want to miss out on these special plants.\n$7.50 each or multiples of 3 $20\nPlease note: Our garden will not be open during the plant sale. We aim to open in approximately 5 weeks but it depends how the tulips progress.\nAs other plants reach maturity we will make them available for sale on our open days. We have decided to have a pre season sale to make room for more beauties.\nAbutilon - a range of mixed colours including peach, rose and lemon.\nDwarf Agapanthus - a fine leaved pale blue variety. Great for edging paths and beds. Will not take over.\nAubretia - Lavender trailing plant for rock walls and garden edges.\nArabis - White blooming Spring groundcover\nAjuga - Pink and purple varieties. Great November blooming groundcover for damp areas.\nAster - Early summer flowering variety in blue/lavender\nCalamintha - new for us so I shall borrow the Chiltern seeds description. This is a most pleasant plant for your border or herb garden. Heavily scented with a fragrance described as pennyroyal-like, it is an erect perennial with small, somewhat hairy leaves. In summer it bears numerous whorled spikes of tiny blue flowers with long purple bracts. The herb can be used for flavouring. Flowers the first year from seed. 1½ft (45cm).\nCampanula glomerata - deep purple\nCerastium - grey trailing leaves smothered in white blooms in Spring. (These have just been cut back)\nCerinthe - By popular demand. Technically an annual but a non invasive self sowing one so once its in your garden you'll have more each year. Glaucous foliage and interesting pendular purple blooms.\nDianthus - Grey leaves and red blooms\nErigeron multiradiatus - A beautiful evergreen groundcover with yellow centred purple/blue daisies from late spring.\nErysimum - a specialty for us as we love them so much. What's not to love? Front to mid border, semi shrubby evergreen perennial, glorious scented blooms and we have individual named colours.\nIvory, Purple bi-colour, Fire King, Vulcan, Ellen Willmott, Primrose, Ruby gem, Siberian allionii and the brand new Tangerine Titan.\nEuphorbia - golden foam. Another newbie for us but we love the the chartreuse euphorbias add to the garden so we had to give it a go.\nEuphorbia characias - the blue leaved evergreen semi shrubs with huge chartreuse heads that grace our garden every spring.\nGeum - Yes, you guessed it, another favourite of ours. We have a good stock of the common types plus some more unusual ones.\nTall - Yellow, Red and Orange (Firestorm).\nDwarf - Deep orange/red, Lemon with hints of pink, blush (very pale pink) and the original geum rivale in a beautiful coppery peach.\nLunaria (Honesty). Two types available. Chedglow the purple leaf version that has taken Chelsea by storm the last couple of years. Variegata - the green leaves become edged in white in their second year before blooming with the typical mauve flowers.\nLysimachia nummularis - yellow creeping jenny. Great lime leaf trailing plant for part shady damp areas. One only.\nOrlaya grandiflora - another favourite among designers. A self sowing annual that will provide weeks of beautiful white lacecap flowers. Perfect for filling in border spaces until the summer perennials fill in or to give a light airy feel to meadows and spring plantings. Seedlings will return year after year.\nPelargonium - Deep red\nPulmonaria - Raspberry splash\nRomulea - small bulbs grow fine grassy leaves before erupting into a mass of deep rosy purple crocus type flowers in late spring.\nScabiosa - another specialty plant for us as they provide such amazing flower power all summer and autumn. They are not frost hardy but are perennial in sheltered spots for at least 3 years. Enjoy the flowers and at the end of the season collect several packets worth of seed to multiply your stock.\nNamed varieties available:\nSnowmaiden - white, Black Knight - deep maroon, Beaujolias Bonnets - a gorgeous blend of pink, white and burgundy on the same flower, Burgundy beau - a new one this year, Salmon Queen - the most delicious shade of salmon pink. Pale yellow Fata morgana, and blue ones will be available later in the season.\nStachys officinalis - dark pink flowered evergreen groundcover. Perfect for the front of garden beds and rock gardens.\nSissyrinchium blue eyed grass. Low grassy leaves burst in to a mass of blue star shaped flowers in Spring.\nSedum mexicana - a bright lime evergreen succulent groundcover. Perfect for supporting bold tulips in spring and bright perennials in summer.\nSedum Mr Goodbud. A slightly pinker version than the well known Autumn joy.\nSparaxia - very special maroon flowers. Couple only.\nSymphytum grandiflora - low-lying evergreen groundcover with medium sized leaves and stunning cream bell flowers all through spring. Excellent spreading plant for difficult to grow areas such as the shade of evergreen trees.\nUrospermum - sown last spring and flowered for the first time in summer. Don't be put off by its dandelion looking leaves. This is a beauty with huge lemon flowers ( yes again like a dandelion but oh so much more beautiful). It has survived a wet winter in our gravel garden and also in soil. Definitely not a weed!\nViolets - green leaf with white scented flowers and the later flowering purple leaved Viola labadorica with purple flowers.\n\n\n\n",
    "label": "Markets & Fairs",
    "skip": false
  },
  {
    "description": "5 And Still Live ! - The Fifth Anniversary of Mouthfull Radio, Five years ago we were in the midst of a global pandemic, visiting digital rooms with friends around the corner, making sourdough, and sort of watching the daily news. We were also making experimental attempts into the world of radio, with the birth of Mouthfull’s first international streaming server, playing music 24/7 (also live events a few times a week).\nIf we travel even further back in time, 2017 was the debut of the “Mouthfull Radio” episodic series (~20eps) - but we consider the ongoingness the real thing to celebrate.\nMoving towards present day ~ through a vast richness of hosts, events, music, shows, zines, selectors, connections, pop ups, and story-times. It is a real joy to help community contemporary radio ripple out from this Pacific Island nation to the world wide web.\n\n5 Years goes so fast, and so we shall honour this time with a great celebration in the capital city of Aotearoa! We will bring together all of the elements of Mouthfull you have known to love; make some books, make up some new dance moves with friends, and make our ears glisten in the sounds of live and selected music.\nWhiro // New Moon. The last dark night of winter. A time for reflection; an invitation to come together as friends and whānau and plant intentional seeds for future flowers to bloom, as well as rest in deep listening and shared beingness.\n\nLineup:\n*ºJuniper May\n*ºStar Time\n*ºajhoneysuckle (tāmaki)\n*ºMystery Waitress (duo)\n*ºDJ B.Lo (whākatu)\n*°Benny Salvador\n\n\nWe are also releasing our first ever compilation. This special event will be opened with a premiere listening session of the full CD, playing the album all the way through. You can purchase a physical copy at the show, or on bandcamp (preorders open September 1st).\n5PM sharp CD push play. Some divine collaborators with unique new releases on offer.\n\nThis is a fundraiser to support the sustainability of Mouthfull. We are only able to pay the bills due to events like this, and are fundraising to support a long awaited update of our digital infrastructure to enable future support. THANKS FOR YOUR SUPPORT - you can support us by purchasing a ticket (extra donation if you are balling), a tshirt, a raffle ticket, or a zine - it all goes to the same goal of enabling & uplifting one another.\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "80's Super Band 'Love Shack', Not to be missed, New Zealand's 80's super group 'Love Shack' are bringing their 80's party to the Solway Masterton\n\nCome and party with Love Shack as they bring their Ultimate 80's party to back to the mighty Wairarapa\nPlaying songs by The B52's, Prince, INXS, Blondie, David Bowie, Billy Idol, Peter Gabriel, The Eurythmics, Devo, Peter Gabriel, The Pretenders, INXS, Queen, Katrina and The Waves, The Mockers, ICEHOUSE, Stevie Nicks and Tom Petty, Coconut Rough, UB40, U2 and lots more.\n\nLove Shack features some of New Zealand's finest and most experienced musicians. Including Tui nominated and NZ charting artists, session muso's, hired guns and Diva's who have drawn on all their years of experience to create a magic live music show that will help you relive the great days of dancing the night away & rocking out to your favourite 80's bands\n\nThe band:\n\n\nLynley Christoffersen - Vocals\n\nHamish Graham - Vocals and guitar\n\nRob Joass - Lead guitar\n\nCameron Crawford - Keys\n\nMiklin Halstead - Bass guitar\n\nVinnie McParland - Drums",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "AWE Partnership Masterclass for Violists and Violinists with Yura Lee, Join us for a Masterclass!\nAs part of our 2025 partnership with At the World’s Edge Festival, Orchestra Wellington will host AWE 2025 Festival Artist Yura Lee to present a masterclass for violinists and violists in Wellington.\nAnyone can register to attend and observe the masterclass!\nVisit https://orchestrawellington.co.nz/event/awe-masterclass-2025 to register to attend and observe the masterclass for FREE!\nViolinist/violist Yura Lee is a multifaceted musician, as a soloist and as a chamber musician, and one of the very few that is equally virtuosic on both violin and viola. Her career spans three decades and takes her all over the world, captivating audiences through various musical mediums from baroque to modern, and enjoying a career that spans three decades and takes her all over the world. She has performed with major orchestras including those of New York, Chicago, Baltimore, Cleveland, San Francisco, Los Angeles, and given recitals in London’s Wigmore Hall, Vienna’s Musikverein, Salzburg’s Mozarteum, the Palais des BeauxArts in Brussels, and the Concertgebouw in Amsterdam.\nAt age 12, she became the youngest artist ever to receive the Debut Artist of the Year prize at the Performance Today awards given by National Public Radio. She is the recipient of a 2007 Avery Fisher Career Grant; she has received numerous other international prizes, including top prizes in the Mozart, Indianapolis, Hannover, Kreisler, Bashmet, and Paganini competitions. Yura Lee was the only first prize winner awarded across four categories at the 2013 ARD Competition in Germany.\nAn Incredible Partnership with At The World's Edge Festival!\nAs part of our 2025 partnership with At the World’s Edge (AWE) Festival, Orchestra Wellington is presenting a three-part series featuring AWE 2025 Festival Artist Yura Lee and AWE Artistic Director Benjamin Baker for a mini-series of concerts and a masterclass here in Wellington in addition to featuring these incredible artists' live performances with us on our subscription series concerts in September and October! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "AWE Partnership Masterclass for Violists and Violinists with Yura Lee, Join us for a Masterclass!\nAs part of our 2025 partnership with At the World’s Edge Festival, Orchestra Wellington will host AWE 2025 Festival Artist Yura Lee to present a masterclass for violinists and violists in Wellington.\nAnyone can register to attend and observe the masterclass!\nVisit https://orchestrawellington.co.nz/event/awe-masterclass-2025 to register to attend and observe the masterclass for FREE!\nViolinist/violist Yura Lee is a multifaceted musician, as a soloist and as a chamber musician, and one of the very few that is equally virtuosic on both violin and viola. Her career spans three decades and takes her all over the world, captivating audiences through various musical mediums from baroque to modern, and enjoying a career that spans three decades and takes her all over the world. She has performed with major orchestras including those of New York, Chicago, Baltimore, Cleveland, San Francisco, Los Angeles, and given recitals in London’s Wigmore Hall, Vienna’s Musikverein, Salzburg’s Mozarteum, the Palais des BeauxArts in Brussels, and the Concertgebouw in Amsterdam.\nAt age 12, she became the youngest artist ever to receive the Debut Artist of the Year prize at the Performance Today awards given by National Public Radio. She is the recipient of a 2007 Avery Fisher Career Grant; she has received numerous other international prizes, including top prizes in the Mozart, Indianapolis, Hannover, Kreisler, Bashmet, and Paganini competitions. Yura Lee was the only first prize winner awarded across four categories at the 2013 ARD Competition in Germany.\nAn Incredible Partnership with At The World's Edge Festival!\nAs part of our 2025 partnership with At the World’s Edge (AWE) Festival, Orchestra Wellington is presenting a three-part series featuring AWE 2025 Festival Artist Yura Lee and AWE Artistic Director Benjamin Baker for a mini-series of concerts and a masterclass here in Wellington in addition to featuring these incredible artists' live performances with us on our subscription series concerts in September and October! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Affirmation: Dvorak & Brahms, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Affirmation: Dvorak & Brahms, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Age of Sigmar @ Call to Arms 2025, It's a two day, 2,000 point Age of Sigmar event in Kilbirnie, Wellington!",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Air Force in Concert featuring Hollie Smith, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket\r\n\r\nThe Royal New Zealand Air Force Band is a reserve force military band based in Wellington. It can be heard welcoming dignitaries at Government House and Parliament, or providing music for nationally significant commemorations at Pukeahu National War Memorial. Being part-time, the band is made up of some of the top professional musicians in the country. Many of its members regularly perform alongside the New Zealand Symphony Orchestra, Orchestra Wellington, L.A.B., Shapeshifter, Bret Mackenzie, and the late jazz legend Rodger Fox to name just a few. For more info click here(Opens in new tab)",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Altared States | Electronic Soundscapes in a Divine Place, Wellington’s iconic Old St Paul’s will play host to a transcendent new series in August, partnering with the Pyramid Club to present Altared States, a unique electronic music experience.\nSet beneath the exquisite stained-glass windows of one of Te Whanganui-a-Tara’s most exquisite landmarks, this series promises an immersive sonic experience that invites audiences to explore sound in a deeply personal and transformative way.\nAltared States is inspired by Brian Sweeney’s New York-founded Ambient Church, an initiative dedicated to collaborating with artists to create transformative audio performances in architecturally significant spaces. This series will immerse attendees in soundscapes that transcend the ordinary, offering a chance to disconnect for a moment from the modern world.\nEach of the evenings will bring a different electronic vibe, conjured by some of Wellington’s most innovative artists. The series lineup includes:\nAugust 1: Ludus\nAugust 8: Stephen Gallagher with David Long and Jules Desmond\nAugust 15: Oghum\nAugust 22: Dream Chambers\nSet within the chancel at the altar of the venue, each artist will perform a 60-minute immersive sound experience that redefines ritual in a contemporary light.\nTickets are available from Wednesday 18 June, with limited capacity of 50 for each show of this intimate series.\nAbout the Artists\nLudus\nis the captivating musical venture curated by Emma Bernard. Her creative inspiration spans across the worlds of electronic music, audio engineering, sound design, and the written word. Bernard’s artistic journey explores the deep connection between soundscapes and the natural world, with a focus on evoking emotional responses to the environments we inhabit. She is also co-founder of the Pōneke-based collective Tonic.\nStephen Gallagher\nis an Emmy award-winning composer and music editor who has worked on an extensive range of projects, from global blockbusters to television and contemporary dance. Most recently, he completed the score for The Lord of the Rings: The War of the Rohirrim, directed by Kenji Kamiyama. Gallagher’s work spans collaborations with Peter Jackson, Brian Eno, Ed Sheeran, Nick Cave, and many more.\nDavid Long\nis a composer, performer, founding member of The Mutton Birds, and member of easy listening noise band, Teeth. His career has spanned over 40 years and seen him work on numerous projects to commercial and critical acclaim. In his own words he likes to “mash shit up”, creating orchestral scores that utilise “not only classical instruments but all sorts of things”.\nJules Desmond\nis an experimental musician from Wellington who has played in bands including Letterbox Lambs, 1/3 Octave Band, Bachelor of Architecture and Black Boned Angel.\nOghum\nis the interstellar duo of Nell Thomas (Orchestra of Spheres, Cookie Brooklyn and the Crumbs) and Jonny Marks (All Seeing Hand, Mean Bones), performing on Synthi AKS, theremin and other assorted items. Oghum blends electronic sounds from times past with an array of acoustic and found sounds, using nuanced improvisation to create detailed and tangible sonic environments, invoking memory and transporting the listener through narrow gaps into wide open otherworldly spaces.\nJess Chambers\nis a composer, musician, and educator currently based in Aotearoa New Zealand, and working under the moniker Dream Chambers. From her beginnings as a folk singer to her current explorations in electronic music, she experiments with sound as a practice of attention: to a room, an outer world, an inner feeling. It’s in that space of beholding where transformation and connection occur, and Chambers is a master alchemist, likening that stretch of attention in music to growing a garden: “There’s a lot of searching, reaching and eventual blossoming in my music – it feels like coming up from underground, like a tulip bulb.”\nThe Pyramid Club, located on Taranaki Street, is an artist-run space dedicated to experimental music and sonic arts, providing a home for innovative sound exploration. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Americana Jam, Join in with voices, fiddle, banjo, guitar, bass, washtub, spoons, saw, etc and help make this a warm, fun, festive and friendly monthly gathering for lovers of Americana music - the older the better - from murder ballads to oldtime, bluegrass, and early country - LISTEN, LEARN, OR LEAD THE WAY .. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "An Invitation to Love, You’re invited!\nCantoris is excited to announce our second concert for 2025: An Invitation to Love.\nRomantic love, sacred love, and even friendship will be captured through the works of Tallis, Ireland, Whitacre, and the shimmering centrepiece of Lauridsen’s ‘Nocturnes’.\nNew works by Wellington’s own Jonathan Berkahn sit alongside a vibrant selection of madrigals that capture the joy, longing, and playful spirit that love inspires.\nWe cannot wait to perform and share our love of this music with you!\nSunday 7th September | 3pm\nSt Peter’s Anglican Church | 211 Willis Street, Pōneke\nTickets are available NOW at the link in our bio. See you soon\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "BOK JOL WELLINGTON 2025, Age restriction. Under 18 only allowed with parents or legal guardian.",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "BOK JOL WELLINGTON 2025, Age restriction. Under 18 only allowed with parents or legal guardian.",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Back In The Day feat. Nick Collings| WLG | 48 Hr Sale|, Wellington – Are You Ready to Go Back in the Day?\n\nSignature Socials proudly presents:\nBACK IN THE DAY\n\nA night of dancefloor nostalgia, epic classics & feel-good vibes.\nOTTO, 125 Featherston Street\nSaturday, 30th August\n8:00 PM till late\nHeadlining:\nNick Collings (Auckland) – Spinning the greatest dance anthems from then 'til now!\nWith support from:\nAlopex\nAshwynz\nMr. Thicket B2B O’Sea\nTompy\nWhether you lived it or missed it, this night is all about celebrating the golden days of dance music. At Signature Socials, it's always about good music and even better vibes.\nTickets available now on Flicket\nDon’t miss your chance to relive the magic – see you on the dancefloor! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Back In The Day feat. Nick Collings| Wellington Show | Aug 30th, Wellington – Are You Ready to Go Back in the Day?\n\nSignature Socials proudly presents:\nBACK IN THE DAY\n\nA night of dancefloor nostalgia, epic classics & feel-good vibes.\nOTTO, 125 Featherston Street\nSaturday, 30th August\n8:00 PM till late\nHeadlining:\nNick Collings (Auckland) – Spinning the greatest dance anthems from then 'til now!\nWith support from:\nAlopex\nAshwynz\nMr. Thicket B2B O’Sea\nTompy\nWhether you lived it or missed it, this night is all about celebrating the golden days of dance music. At Signature Socials, it's always about good music and even better vibes.\nTickets available now on Flicket\nDon’t miss your chance to relive the magic – see you on the dancefloor! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Bed By 10 Is Coming To Wellington!, NEW DATE ADDED DUE TO DEMAND\nBed By 10: The Ultimate 30+ Clubbing Experience!\nFancy going out for a dance but not keen on sacrificing the next day? We've got you covered!\nBed By 10 is a chance for ravers over 30 to relive the peak of the 80s, 90s & early 2000s clubbing scene! Expect crazy visuals, confetti showers, Co2 cannons and more as our resident DJ spins all the club classics\nGood vibes only! Our event is designed for those who love to dance, socialize, and enjoy great music—all while being home and in bed by 10 PM\nTickets Here\nhttps://likeit-loveit.com/pages/wellington-new-zealand ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Bill Hickman, Cindy Muggeridge & Neil Billington play Hilltop, First Set; Bill Hickman - Opening the show is Wellington singer-songwriter Bill Hickman, known for his strong gravel dragged voice, driving guitar work, and honest, well-crafted songs. Blending folk, country and roots influences, Bill’s set moves between grit and tenderness, with stories of outlaws, love, and life hard-lived.\n\nSecond Set; Cindy Muggeridge & Neil Billington - The second part of this special show features the queen of the blues and boogie piano, Cindy Muggeridge, together with the firebrand of the blues harp, Neil Billington, performing their own unique brand of blues, boogies and ballads.\n\nNot for profit, supporting our dedicated musicians. Suggested donation $30\n\nTeas, coffee and snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays and all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7.\n\nMore information at www.hilltophouseconcerts.co.nz/upcoming-gigs/",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Blue Moon and Friends, 3, 2, 1... TAKEOFF!!\nOne small gig for man, one giant gig for mankind - we are landing at MOON in Newtown, Wellington.\nAnodine, Homie Gi Gi and Blue Moon. A night of Jazz, Rock and Pop on the dance floor.\nLooking forward to it people. The prophecy has been spoken and the stage has been set.\n9PM - 12AM on the 5th of September\nClear your calenders, book your tickets and tell your friends. This is it. The time is now. Let the games begin.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Bob McNeill and Emily, Bob McNeill & Emily Roughton are two of New Zealand's best-known folk musicians. They bring their deep musical connection to festivals across New Zealand, playing their favourite songs and tunes collected over years of playing together at festivals, stages and late into the night at kitchen tables.\n\nBased in Wellington, Bob is one of NZ's best known folk songwriters. His songs have been covered by artists in NZ, Australia, the UK and USA. New Zealand Musician magazine compared his songwriting to Bruce Springsteen and Mark Knopfler; the Dominion Post likened him to Jackson Brown, James Taylor, Luka Bloom and Dougie Ma­cLean. A guitarist, he is known for both his open-tuned acoustic fingerstyle style and electric guitar playing. He has toured widely in NZ, Australia, Canada, Ireland, the UK and USA. His latest album, released in June 2024, is Lost Stars, an extended release on CD and download featuring new recordings and rarities, with Emily on violin and piano.\n\nFrom Whangarei, Emily is a virtuoso violinist inspired by the Scottish tradition and the modern trad movement. Classically trained, she is infinitely adaptable with her gorgeous stylings and fiery tune playing and the perfect foil for Bob's lyrical songs.\n\nDon't miss a chance to see these two consummate musicians share their footstomping collection of banging tunes, favourite songs and stolen moments from the last 20 years.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Bold As Brass, Join us for an uplifting afternoon of music as we welcome the warmer days with Bold As Brass – a celebration of classic brass band favourites performed by the Masterton District Brass Band, the Masterton Junior Band, and special guests!",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Bold As Brass, Join us for an uplifting afternoon of music as we welcome the warmer days with Bold As Brass – a celebration of classic brass band favourites performed by the Masterton District Brass Band, the Masterton Junior Band, and special guests!\nCelebrate spring with toe-tapping tunes, stunning solos, and the unmistakable sound of Aotearoa’s only brass band in the Wairarapa.\nBring your whānau, bring your mates, and soak up the sounds of local talent in full brass bloom! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Brazza at Rogue and Vagabond, We are super excited to warm up your winter night next Friday at Rogue and Vagabond.\nWe'll bring you a selection of Brazilian hits and original music.\nFelicien on guitar, Bryn and Nick on wind instruments, Marcel and Abe on percussion, Pedro on Bass and Fabiola on vox. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "BØLZER - Southern Tempest Tour: Wellington - This week, BØLZER [bœlˈtsr] ~ He who strikes like lightning – with sudden, decisive force or implications.\nBØLZER - SOUTHERN TEMPEST TOUR\n20/08 - Wellington; Valhalla\n21/08 - Auckland; Whammy Bar\nTickets on sale from: https://www.undertheradar.co.nz/gig/97050/BLZER.utr\nAn intuitive art project born from raw passion;\nmusical ecstasy fueled by impulsive composition\nand enactment. Whilst wielding a lyrical and musical\nmedium largely inspired by – and seeking to\nchannel – the primeval essence of the human experience,\nflashes of illumination will descend the sky\nfrom which there shall be no shelter.\nForged of an intense understanding between drummer\nFabian Wyrsch and guitarist Okoi Jones, the\nproject first took physical form in 2008. Before\nlong, the dualistic significance of their musical partnership\noutshone any need for a bass player and\nhas since served to both challenge and empower the\nband’s creativity. Following their 2010 live debut in\nZürich, BØLZER soon made a name for themselves\nas the remarkable Swiss-Antipodean duo capable of\nconjuring up mighty barriers of sound with nothing\nbut a ten-stringed guitar and an almost ritualistic\npercussion style. The pair describe their own stage\nexperience as a form of spiritual rapture, an atavistic\nvortex woven together from the profound union\nof spectacle meeting spectator on a deeper plane.\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Cam and Sam - Live at Johnsonville Club, Join Cam and Sam this Saturday Night Session Live at The Johnsonville Club\nNZ's award-winning Duo Cam & Sam are bringing the party to the Johnsonville Club Friday 30th August\nBringing a wealth of musical experience from their other projects including NZ Chart success, international touring, luxury cruise ship shows, radio & TV performances, Cam & Sam bring the night alive with Singalongs & Party Hits from Elton John to Ed Sheeran, the Beatles to Bruno Mars, Queen to Calvin Harris, From Golden Rock'n Roll oldies to the latest TikTok viral tunes these guys have them under their fingers.\nSimply one of the Best nights out in NZ come and join the party.\nwww.camandsam.co.nz ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Capital City Big Band, Capital City Big Band (or CCBB for short) is a high level ensemble consisting of a mixture of professional and top community musicians in Wellington. They will be performing classic big band works in the art deco Wellington Cathedral of St Paul",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Composer Series Jam: Duke Ellington, Step into the timeless world of Duke Ellington at the Composer Series Jam!\nJoin us as we celebrate one of jazz’s greatest composers with an evening of swinging tunes, lush harmonies, and inspired improvisation. From iconic classics to hidden gems, this jam invites musicians and listeners alike to dive into Ellington’s genius and keep his music alive.\nCome down to Undercurrent on Wednesday 27th August at 7pm – Koha entry, all welcome.\nHouse band: Oscar Lavën, James Illingworth, Dan Yeabsley, Mat Enright. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Cumbia Blazera, Born on the pitch, raised on the dancefloor – Cumbia Blazera returns to the Rogue with a free gig that kicks harder than a Sunday League screamer.\n\nAs the musical wing of the legendary Sunday Blazers Football Club, we bring the same passion, rhythm, and camaraderie to our cumbia-infused grooves.\n\nExpect Latin classics, Blazera originals, and a vibe that’ll have you moving like you just scored the winning goal.\n\nNo cover charge, just good vibes. Come early, stay late – vamos a bailar!\n\nMusic from 9:30, FREE ENTRY",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "DNB ALLSTARS - Wellington, DNB ALLSTARS HITS NEW ZEALAND\n\nDnB Allstars, the world’s leading drum & bass community, touch down for three high-octane shows in New Zealand this September, bringing the UK rave flavour to your doorsteps, dancefloors and bass bins",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Daniel Champagne (Australia) LIVE at Martinborough Town Hall (7pm Show), Show #1 - SOLD OUT\nSecond show announced by popular demand!\nThe young virtuoso recently described as “the finest guitar player of this generation” has spent the past few years selling out shows all over the globe and will be bringing his dynamite live act back to New Zealand in 2025 for a series of intimate regional concerts!\nSeated show\nFamily friendly  \nCheaper $15 tickets for under 18s because live music is for everyone!\nBYO (non alcoholic) drinks and nibbles \nOctober 19, 2025 @ Martinborough Town Hall\nDoors open from 6:30pm / show starts at 7:00pm (8:10pm finish) \nTickets are VERY limited. DON'T miss out!\nWHAT THE PRESS SAY..\n“The word Prodigy seems to entirely fall short of this soft-spoken young man’s skills, he coaxes sounds and melodies out of his instrument that literally drop jaws.”\nThe Calgary Herald, CANADA\n\n“Today I saw the future of Folk – Festival goers flocking in the thousands towards the main stage to witness a young musical phenomenon from Australia dish out an absolute show-stopper.” The Firefly Column, USA\n\n“Daniel Champagne is a crossroads. Fusing the strong traditions of Blues, Folk and other roots art with pop showmanship and admirable lyrical ability. I firmly believe that he will become an ambassador for roots music in a time where it desperately needs representation.” The Indie Blender, CANADA\n\n“reinventing roots guitar” Rhythms Magazine, AUSTRALIA“Watching Daniel Champagne perform is a once in a lifetime experience. He is a true prodigy that plays like no one else could possibly play unless they spent at least two lifetimes studying the art.” BW Review, NEW ZEALAND\n\n“Daniel Champagne exudes a natural ease on stage, as he sings poignant lyrics and beautifully crafted melodies that invariably whisk the heart up with grand romanticism. Coupled with an exhilarating guitar talent that transcends mere acoustic playing to replicate a whole band, Champagne is just magical” Themusic.com.au, AUSTRALIA\n\n\"You feel as if he just invented the instrument yesterday and was discovering its possibilities afresh” Ted Gioia (American jazz critic and music historian)",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Daniel Champagne (Australia) LIVE at Martinborough Town Hall (7pm Show), Show #1 - SOLD OUT\nSecond show announced by popular demand!\nThe young virtuoso recently described as “the finest guitar player of this generation” has spent the past few years selling out shows all over the globe and will be bringing his dynamite live act back to New Zealand in 2025 for a series of intimate regional concerts!\nSeated show\nFamily friendly  \nCheaper $15 tickets for under 18s because live music is for everyone!\nBYO (non alcoholic) drinks and nibbles \nOctober 19, 2025 @ Martinborough Town Hall\nDoors open from 6:30pm / show starts at 7:00pm (8:10pm finish) \nTickets are VERY limited. DON'T miss out!\nWHAT THE PRESS SAY..\n“The word Prodigy seems to entirely fall short of this soft-spoken young man’s skills, he coaxes sounds and melodies out of his instrument that literally drop jaws.”\nThe Calgary Herald, CANADA\n\n“Today I saw the future of Folk – Festival goers flocking in the thousands towards the main stage to witness a young musical phenomenon from Australia dish out an absolute show-stopper.” The Firefly Column, USA\n\n“Daniel Champagne is a crossroads. Fusing the strong traditions of Blues, Folk and other roots art with pop showmanship and admirable lyrical ability. I firmly believe that he will become an ambassador for roots music in a time where it desperately needs representation.” The Indie Blender, CANADA\n\n“reinventing roots guitar” Rhythms Magazine, AUSTRALIA“Watching Daniel Champagne perform is a once in a lifetime experience. He is a true prodigy that plays like no one else could possibly play unless they spent at least two lifetimes studying the art.” BW Review, NEW ZEALAND\n\n“Daniel Champagne exudes a natural ease on stage, as he sings poignant lyrics and beautifully crafted melodies that invariably whisk the heart up with grand romanticism. Coupled with an exhilarating guitar talent that transcends mere acoustic playing to replicate a whole band, Champagne is just magical” Themusic.com.au, AUSTRALIA\n\n\"You feel as if he just invented the instrument yesterday and was discovering its possibilities afresh” Ted Gioia (American jazz critic and music historian)",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Donavon Frankenreiter | Wellington, Beloved US singer-songwriter & surfer Donavon Frankenreiter is heading back to New Zealand this November, with support from his son Hendrix Frankenreiter!\nTickets on sale Thu 7 August, 1pm.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "FIZZWIZARD - The Return!!!, Aleister ‘Fizzwizard’ Campbell returns from Tamaki Makaurau (Auckland) to his hometown to inflict all manner of psychedelic-blues-joy upon the good people of Te-Upoko-o-te-Ika (Wellington).\nTrained in a jazz conservatory then corrupted in dive bars and on the streets, Aleister James Campbell, with his evergreen love of Charlie Parker & Jimi Hendrix, is known for his spell-binding stage presence and deep connection to the music.\nCurrently on the run from the Jazz Police for inappropriate Wah Wah use in a straight-ahead jazz context...",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Fizzwizard - the Return!!!, Aleister ‘Fizzwizard’ Campbell returns from Tamaki Makaurau (Auckland) to his hometown to inflict all manner of psychedelic-blues-joy upon the good people of Te-Upoko-o-te-Ika (Wellington).\n\nTrained in a jazz conservatory then corrupted in dive bars and on the streets, Aleister James Campbell, with his evergreen love of Charlie Parker & Jimi Hendrix, is known for his spell-binding stage presence and deep connection to the music.\n\nCurrently on the run from the Jazz Police for inappropriate Wah Wah use in a straight-ahead jazz context...\n\nFor what promises to be a triumphant night, Aleister (on guitar and vocals) will be joined by: Tyson Smith - Electric Bass, Rick Cranson - Drum Kit, Baron Oscar Laven - Alto & Soprano Sax, and Jake Baxendale - Tenor Sax.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Folk B*tch Trio - Wellington, Folk Bitch Trio - 'Now Would Be A Good Time' Album Tour with special guest Georgia Knight\n\nNow Would Be A Good Time, the debut album by Folk Bitch Trio, tells vivid, visceral stories. Their music sounds familiar, and it’s built on a foundation of the music they’ve loved throughout their lives–gnarled Americana, classic rock, piquant, clear-eyed balladry. But the songs are modern, youthful, singing acutely through dissociative daydreams and galling breakups, sexual fantasies and media overload, all the petty resentments and minor humiliations of being in your early twenties in the 2020s.\n\nHeide Peverelle (they/them), Jeanie Pilkington (she/her) and Gracie Sinclair (she/her) have known each other since high school, and first started singing together five years ago. Peverelle recalls sending Pilkington a heartbroken—in their words “bad”—song they had written called “Edie”; Pilkington remembers the song differently. “I felt so inspired that my teenage peer had written something so honest and original,” she recalls. It wasn’t long before she messaged Peverelle and Sinclair, asking if they’d be interested in starting a “folk bitch trio.” As soon as they started singing together, their connection deepened, and “the chemistry of being inspired by each other was evident from the get-go,” says Sinclair.\n\nListening to Folk Bitch Trio, it’s clear that this is a band of three distinct points of view, with contrasting and complementary backgrounds and visions. Pilkington grew up with two musician parents and brings formative memories of watching them perform, of listening to Gillian Welch and Lucinda Williams, and of her own imagined path as a career musician. Peverelle spends their spare time making art and furniture; those hobbies, as well as their love of pop music old and new, articulate a love for the tactile, the home-grown and the hand-made. Sinclair is the self-proclaimed jester of the group, but her taste skews dark, gothic, baroque and dramatic, expressed as a love of opera and ballet as well as musicians as wide-ranging as Patti Smith, Nirvana and Tchaikovsky.\n\nFolk music has a bad habit of being presented as a deathly serious concern. It’s the music you cry to, it’s overly sacred, it’s solemnly considered by critic-historians. But Folk Bitch Trio have a shared sense of humour that is embedded deep in their music and that sets it alight, safe from the self-serious traps of the genre. Now Would Be A Good Time is funny and darkly ironic in the manner of writers like Mary Gaitskill or Otessa Moshfegh. On “Gods A Different Sword” they crack that “My body keeps the score/But if you tell me that you need it/I can get up off my floor,” a nod to the clichéd, over-referenced millennial self-help book, as they wryly sing about sex within earshot of housemates, and wring sexual innuendo from physics terminology",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Four Seasons, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Four Seasons, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Froth@Valhalla, FROTH returns with a heavy lineup to send you deep into the night. No gimmicks just highgrade selectors pushing heat across the spectrum. Expect a full-flavour blend of sounds from vinyl purists to club-minded rollers.\nLineup:\n🎶 Fred Sugar (Vinyl set)\n🎶 Inigo\n🎶 Baeoli\n🎶 Pulse\n🎶 Juce Porkmon (Vinyl set)\nTuned for heads who know. All vibes, no filler.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Funky Fridays Vol. 7 - Not My Sister, Libby K, Ben-Jammin, We're back for another night of house, techno, disco, bass & more at Moon with Funky Fridays Vol. 7!\nCreated to revive and celebrate the underground electronic scene, Funky Friday is more than just a night out—it’s a space for music lovers, dancers, and creatives to connect through rhythm and energy. Each edition features a rotating lineup of talented DJs, both local and international, ensuring a fresh and unique experience every time.\nCome with an open mind and leave with tired feet.\nThis edition features legends Libby K, Ben-Jammin & our host Not My Sister!\n$10 presales available now via UTR, or $15 on the door.\nTimes:\n9-10 Not My Sister\n10-11.30 Libby K\n11.30-1 Ben Jammin\n1-2 Not My Sister\n-------------------------------------------------------\nNOT MY SISTER\nNot My Sister is a house music DJ born and raised in a little town in the north of Italy. Now based in Wellington, she started this project in 2024, and recently she has been lighting up dance floors across New Zealand, you may have already come across her sets at Twisted Frequency, Kiwiburn, Earthbeat, Cuba Dupa, Arkadien and other events across the country. Influenced by funk and disco, with a special focus on vocals and anything groovy, Not My Sister brings high energy and uplifting sets. Constantly developing as an artist, she always brings fun and passion to the dance floors. Expect a delightful fusion of melodic basslines, blending soulful, tech, garage, and deep house sounds.\nwww.soundcloud.com/not-my-sister\nwww.facebook.com/notmysista\n\nwww.instangram.com/not.my.sister\n\nLIBBY K\nFrom the vibrant streets of Wellington, Libby's fascination with music began at an early age with the smooth sultry\nsounds of the clarinet and piano. Fast forward to her 20s where she stumbled into the hypnotic world of techno in\nBerlin and a passion for 4/4 was ignited.\nWith a deep appreciation for the power of music to transform, Libby finds the greatest joy on a dance floor, where\nthe magic of music brings people together and gives us the freedom to be ourselves. Her sets are filled with\nuplifting, emotive and tantalising sounds of downtempo, house and techno. Mixed with intention and a whole lot\nof love xx\nhttps://soundcloud.com/libby_k\nhttps://www.instagram.com/libbykdj/\nhttps://www.facebook.com/libbykmusic\n\nhttps://www.twitch.tv/libbykdj\nBEN-JAMMIN\nOriginally from Bristol, UK, Ben was immersed in soundsystem culture from an early age. He started collecting vinyl in his teens and developed a passion for the heavier side of electronic music. With his formative years spent mixing vinyl, studying African percussion and playing drums and recording for rock/rap group Band of Crooks, he moved on to play with some of the best underground DJ's, producers and musicians in Aotearoa, Australia and UK. Ben has played a myriad of parties and events including Newtown Festival, Cuba Dupa, Kiwi Burn, Little Monsters, Insomnia, Toots Suite Festival (Salmonella Dub, Laughton Kora, Pheonix Foundation), Breakaway Magical Doof Bus (Paige Julia, Y, Sorchalula,Young Gho$t, House MD), Cuba Dupa, Sydney Rd Street Festival (Melbourne), Cafe Blue (UK), Castros (UK).\nBen-Jammin can do what is needed to keep a dancefloor alive, comfortably switching between genres to suit the mood.\nAlways armed with bags of bass heavy treats expect a selection of new, classic and surprise music to help you release your spirit into the world.\nhttps://soundcloud.com/ben_young_2000 ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Funky Mama, They're back!\n\nnky Mama has been a staple in the Wellington music diet since it's inception in 2016. They bring a unique sound that's influenced by deep funk, bouncy boogaloo & 80's house featuring silly & poignant originals penned by Bryn van Vliet.\n\nBryn van Vliet - Saxophone, Vocals\nKaito Walley - Tbone\nPetar Tavich - Guitar\nDarren Mathiassen - Drums\n\nAnd a special mystery guest on the organ....\n\nMusic from 9:30, FREE ENTRY",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "GREAT SOUNDS GREAT, Eyegum Music Collective presents GREAT SOUNDS GREAT, a multi-venue music and arts festival taking over Pōneke's Cuba Street precinct for one night only on Saturday 6 September 2025. Showcasing 40 of Aotearoa's best artists across 10 neighbouring venues, this is one big party you shouldn't miss.\nEyegum has worked hard to curate a programme that is sure to offer something for everyone, from first time gig-goers to seasoned live music obsessives. The eclectic lineup includes perennial indie maestros The Bats, capital hometown heroes The Phoenix Foundation, hip hop superstar JessB, troubadour-turned-party starter Anthonie Tonnon, captivating genre-bender Reb Fountain, the incredible local-by-way-of-Naarm Jen Cloher, plus a selection of up-and-coming artists handpicked from Eyegum's Free Wednesday weekly showcase series, and everything in between. There will also be plenty more to be announced soon including more music, poetry, live-scored cinema, and a travelling DJ stage curated by Tonic Collective.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Greg Crayford's Jazz Night - Twenty Year Anniversary!, Twenty years! Yep, you read that right. This residency has run for two solid decades.\nGreg Crayford here. Host and drummer of what’s been billed for some time now as Wellington’s Longest-Running Jazz Residency. And rightly so! Little could we have known when this gig began at The Realm in Hataitai in August 2005 that it’d still be going in 2025. It’s a fantastic achievement. Longer residencies have occurred in our town but nothing currently running holds a candle to that sort of effort by a single artist, at a single venue, in this town (and possibly beyond).\nWe boast quite the legacy: two Tui-nominated live albums, several bar owners, many managers and staff, hundreds of featured professional musicians and young artists, 500-odd gigs, uncountable numbers of pizzas, beer, whisky, and much laughter and joy. From local music students to top-notch international artists we’ve seen it all.\nIt’s a huge milestone - 20 years of high quality music played by a massive variety of talented people.\nThe exciting programme is largely finalised and is pasted below.\nMark the date!\nTable bookings 04 974 2207 or info.therealm@nzvenueco.nz or therealm.co.nz and click on ‘book a table’\nGreat ambience, good company, superb kai and stellar music. What more could a jazz fan want? How about twenty years of quality music?\nSure hope to see you there\nArtist Schedule & Programme\nArtists:\n• April Philips\n• Zak Dikvert\n• Geoff Culverwell\n• Al Campbell\n• Michelle Scullion\n• Dave Feehan\n• Julie Lamb\n• Aslan Rowlands\n• Miles Crayford\n• Grant Sullivan\n• Ben Hunt\n• Lisa Tomlins\n• Oscar Lavēn\n• Lana Law\n• Nick Tipping\nEnsembles:\nThe Big Bands\n• Rongotai College Big Band\n• Wellington Allstar Youth Big Band\n• Capital City Big Band\nApril’s Fools\n• April Philips\n• Russell Henderson\n• Miles Crayford\n• Zak Dikvert\n• Rory Macartney\nRC Plays ‘Trane\n• Oscar Laven\n• Liam George\n• Tim Honiss\n• Rex More The King\nBlues Clues\n• Aslan Rowlands\n• Miles Crayford\n• Paul Mouncey\n• Oscar Laven\nThe Funkadelics\n• Jamie Musuva\n• Lisa Tomlins\n• Russell Henderson\n• Zak Dikvert\n• Miles Crayford\n• Paul Mouncey\nFinal Draft Programme:\n2:00-2:10 Marching Band ‘The Saints’\n2:15-2:45 Rongotai College Big Band\n2:50-3:30 Wellington Allstar Youth Big Band\n3:30-4:00 Student Jamming\n4:10-5:00 Capital City Big Band\n5:00-5:30 Guest Jamming\n5:40-6:30 April’s Fools\n7:00-7:30 RC Plays ‘Trane\n7:30-8:00 Guest Jamming\n8:00-8:45 Blues Clues\n9:00-10:00 Funkadelic feat. Lisa Tomlins\n\n\n\n\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Gregory Alan Isakov,   American indie-folk artist Gregory Alan Isakov is a Grammy-nominated singer and songwriter. He’s bringing his intimate and lyric-driven show to Wellington in February. Audiences will be given a special opportunity to experience stripped-down acoustic arrangements. He’ll delve into favourites from six of his full-length studio albums, including his most recent ‘Appaloosa Bones’. \nThis 2023 album was praised with an Associated Press reviewer saying, “His new songs are relentlessly majestic, a kind of musical morphine”. Gregory has amassed a devoted community of fans who have helped him garner over 1 billion streams on listening platforms to date.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Heaven & Earth: Celebrating 25 Years of Bold Sounds, Heaven & Earth marks 25 years of Stroma’s fearless exploration of sound and spirit since our inaugural concert Wind, Rain & Light in August 2000. We recall the theme of that first concert by similarly evoking musical impressions of the earth below and the sky above. Featuring a world premiere by New York-based NZ composer Leila Adu-Gilmore, the programme includes Olivier Messiaen’s ecstatic Louange à l’immortalité de Jésus, Gemma Peacocke’s Sky Fields, John Rimmer’s Where Sea Meets Sky 2, Michael Norris’s new piano trio The Spaces In Between, and—to mark the recent passing of Sofia Gubaidulina—her meditative Garden of Joy and Sorrow. Come join us in celebrating a quarter century of intrepid sonic exploration from the musicians of Stroma. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "High Vibes, High Vibes is making its debut!\n\nMantra meets electronic beats with DJ Arkaya Rising & lil Saums.\n\nDevamrita Swami’s bringing mind-bending insights that’ll have you rethinking life, the universe, and your 3am snack choices.\n\nThe menu’s stacked: pita pockets stuffed with ‘meatballs’ & tzatziki, mac n cheese bites with smoky BBQ sauce, ‘bacon’–tomato–avo salad, broccoli croquettes with ranch dip, and berry brownies with whipped cream.\n\nMocktail bar pouring Limoncello, Ruby Red, and Orange Spritz.\n\nGood vibes, great kai, and a night you’ll be talking about long after the lights fade.\n\nSunday 14th of September\n\nDoors open from 545pm, kicking off at 600pm\n\n$15 entry\n\n($10 for students and backpackers)\n\nGet tix here xxx",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "High Vibes, High Vibes is making its debut!\nMantra meets electronic beats with DJ Arkaya Rising & lil Saums.\nDevamrita Swami’s bringing mind-bending insights that’ll have you rethinking life, the universe, and your 3am snack choices.\nThe menu’s stacked: all plant-based pita pockets stuffed with ‘meatballs’ & tzatziki, mac n cheese bites with smoky BBQ sauce, ‘bacon’–tomato–avo salad, broccoli croquettes with ranch dip, and berry brownies with whipped cream.\nMocktail bar pouring Limoncello, Ruby Red, and Orange Spritz.\nGood vibes, great kai, and a night you’ll be talking about long after the lights fade.\nSunday 14th of September\nDoors open from 545pm, kicking off at 600pm\n$15 entry\n($10 for students and backpackers)\nGet tix here ~ https://tr.ee/HighVibes\nBhakti Lounge – Level 1, 175 Vivian St\n\n\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Hori i.n.c Presents: Grace Chia, j some horiz doin stuff ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Hori i.n.c Presents: Grace Chia, j some horiz doin stuff ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Jazz Orchestra Composer Series Presents Louisa Williamson, The ninth concert in this series of Aotearoa composers features the multi-talented saxophonist/composer Louisa Williamson.\n\nSince completing a Masters of Music in Composition in 2020, she has released two albums of original music (What Dreams May Come and Groundwork). In 2023 Louisa won the APRA Best Jazz Composition Award for her piece Dream Within A Dream, and in 2024 Louisa received a composition commission from the Wellington Jazz Festival and headlined the festival with the new work, The Chasm Where We Fall Into Each Other.  Louisa has worked with L.A.B, Bret McKenzie, AJA, The Rodger Fox Big Band, Royal NZ Air Force Band, Trinity Roots and Lord Echo.\n\nThis commission opportunity has come at a perfect time for me to process some recent grief and pain that’s inhabited my circles. Whilst composing this music, I’ve thought about ideas around mental health, specifically with youth in Aotearoa, and also honouring some friends who have passed. I think artists have the ability to turn heartbreak into beauty, and this music is an attempt at that. Although the inspiration which generated the music is heavy, the performance itself will hopefully feel light and reflective (turning heartbreak into beauty = darkness into light!), and will embrace and celebrate the talents of the musicians who are playing. I’ve brought together a beautiful group of people who I know will handle this music with care and fortitude\n\nBryn van Vliet - alto/flute\nTyaan Singh - alto sax\nLouisa Williamson - tenor/flute\nEilish Wilson - baritone sax\nSylvester Green - trumpet\nKaia Johnstone - trumpet\nKaito Walley - trombone\nJakob Elijas - trombone\nAnna Lee - euphonium\nSam Zhu - tuba\nLeonardo Coghini - piano\nJacob Hurst - bass\nMax Sheehan - drums\n\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15 from Humanitix.com, door sales $20.\n\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents Louisa Williamson, The ninth concert in this series of Aotearoa composers features the multi-talented saxophonist/composer Louisa Williamson.\n\nSince completing a Masters of Music in Composition in 2020, she has released two albums of original music (What Dreams May Come and Groundwork). In 2023 Louisa won the APRA Best Jazz Composition Award for her piece Dream Within A Dream, and in 2024 Louisa received a composition commission from the Wellington Jazz Festival and headlined the festival with the new work, The Chasm Where We Fall Into Each Other.  Louisa has worked with L.A.B, Bret McKenzie, AJA, The Rodger Fox Big Band, Royal NZ Air Force Band, Trinity Roots and Lord Echo.\n\nThis commission opportunity has come at a perfect time for me to process some recent grief and pain that’s inhabited my circles. Whilst composing this music, I’ve thought about ideas around mental health, specifically with youth in Aotearoa, and also honouring some friends who have passed. I think artists have the ability to turn heartbreak into beauty, and this music is an attempt at that. Although the inspiration which generated the music is heavy, the performance itself will hopefully feel light and reflective (turning heartbreak into beauty = darkness into light!), and will embrace and celebrate the talents of the musicians who are playing. I’ve brought together a beautiful group of people who I know will handle this music with care and fortitude\n\nBryn van Vliet - alto/flute\nTyaan Singh - alto sax\nLouisa Williamson - tenor/flute\nEilish Wilson - baritone sax\nSylvester Green - trumpet\nKaia Johnstone - trumpet\nKaito Walley - trombone\nJakob Elijas - trombone\nAnna Lee - euphonium\nSam Zhu - tuba\nLeonardo Coghini - piano\nJacob Hurst - bass\nMax Sheehan - drums\n\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15 from Humanitix.com, door sales $20.\n\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents Louisa Williamson, The ninth concert in this series of Aotearoa composers features the multi-talented saxophonist/composer Louisa Williamson. Since completing a Masters of Music in Composition in 2020, she has released two albums of original music (What Dreams May Come and Groundwork). In 2023 Louisa won the APRA Best Jazz Composition Award for her piece Dream Within A Dream, and in 2024 Louisa received a composition commission from the Wellington Jazz Festival and headlined the festival with the new work, The Chasm Where We Fall Into Each Other.  Louisa has worked with L.A.B, Bret McKenzie, AJA, The Rodger Fox Big Band, Royal NZ Air Force Band, Trinity Roots and Lord Echo.\n\"This commission opportunity has come at a perfect time for me to process some recent grief and pain that’s inhabited my circles. Whilst composing this music, I’ve thought about ideas around mental health, specifically with youth in Aotearoa, and also honouring some friends who have passed. I think artists have the ability to turn heartbreak into beauty, and this music is an attempt at that. Although the inspiration which generated the music is heavy, the performance itself will hopefully feel light and reflective (turning heartbreak into beauty = darkness into light!), and will embrace and celebrate the talents of the musicians who are playing. I’ve brought together a beautiful group of people who I know will handle this music with care and fortitude\"\nBryn van Vliet - alto/flute\nTyaan Singh - alto sax\nLouisa Williamson - tenor/flute\nEilish Wilson - baritone sax\nSylvester Green - trumpet\nKaia Johnstone - trumpet\nKaito Walley - trombone\nJakob Elijas - trombone\nAnna Lee - euphonium\nSam Zhu - tuba\nLeonardo Coghini - piano\nJacob Hurst - bass\nMax Sheehan - drums\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15, door sales $20.\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents Louisa Williamson, The ninth concert in this series of Aotearoa composers features the multi-talented saxophonist/composer Louisa Williamson. Since completing a Masters of Music in Composition in 2020, she has released two albums of original music (What Dreams May Come and Groundwork). In 2023 Louisa won the APRA Best Jazz Composition Award for her piece Dream Within A Dream, and in 2024 Louisa received a composition commission from the Wellington Jazz Festival and headlined the festival with the new work, The Chasm Where We Fall Into Each Other.  Louisa has worked with L.A.B, Bret McKenzie, AJA, The Rodger Fox Big Band, Royal NZ Air Force Band, Trinity Roots and Lord Echo.\n\"This commission opportunity has come at a perfect time for me to process some recent grief and pain that’s inhabited my circles. Whilst composing this music, I’ve thought about ideas around mental health, specifically with youth in Aotearoa, and also honouring some friends who have passed. I think artists have the ability to turn heartbreak into beauty, and this music is an attempt at that. Although the inspiration which generated the music is heavy, the performance itself will hopefully feel light and reflective (turning heartbreak into beauty = darkness into light!), and will embrace and celebrate the talents of the musicians who are playing. I’ve brought together a beautiful group of people who I know will handle this music with care and fortitude\"\nBryn van Vliet - alto/flute\nTyaan Singh - alto sax\nLouisa Williamson - tenor/flute\nEilish Wilson - baritone sax\nSylvester Green - trumpet\nKaia Johnstone - trumpet\nKaito Walley - trombone\nJakob Elijas - trombone\nAnna Lee - euphonium\nSam Zhu - tuba\nLeonardo Coghini - piano\nJacob Hurst - bass\nMax Sheehan - drums\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15, door sales $20.\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents Louisa Williamson, The ninth concert in this series of Aotearoa composers features the multi-talented saxophonist/composer Louisa Williamson. Since completing a Masters of Music in Composition in 2020, she has released two albums of original music (What Dreams May Come and Groundwork). In 2023 Louisa won the APRA Best Jazz Composition Award for her piece Dream Within A Dream, and in 2024 Louisa received a composition commission from the Wellington Jazz Festival and headlined the festival with the new work, The Chasm Where We Fall Into Each Other.  Louisa has worked with L.A.B, Bret McKenzie, AJA, The Rodger Fox Big Band, Royal NZ Air Force Band, Trinity Roots and Lord Echo.\n\"This commission opportunity has come at a perfect time for me to process some recent grief and pain that’s inhabited my circles. Whilst composing this music, I’ve thought about ideas around mental health, specifically with youth in Aotearoa, and also honouring some friends who have passed. I think artists have the ability to turn heartbreak into beauty, and this music is an attempt at that. Although the inspiration which generated the music is heavy, the performance itself will hopefully feel light and reflective (turning heartbreak into beauty = darkness into light!), and will embrace and celebrate the talents of the musicians who are playing. I’ve brought together a beautiful group of people who I know will handle this music with care and fortitude\"\nBryn van Vliet - alto/flute\nTyaan Singh - alto sax\nLouisa Williamson - tenor/flute\nEilish Wilson - baritone sax\nSylvester Green - trumpet\nKaia Johnstone - trumpet\nKaito Walley - trombone\nJakob Elijas - trombone\nAnna Lee - euphonium\nSam Zhu - tuba\nLeonardo Coghini - piano\nJacob Hurst - bass\nMax Sheehan - drums\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15, door sales $20.\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents: John Rae, Award-winning composer and musician John Rae invites you to an\nenchanting evening of Celtic-inspired music that promises to get your feet tapping and your ears thumping. This large ensemble draws on both new and traditional melodies, reimagined in a style that reflects Rae’s cultural roots and personal musical journey. Experience a vibrant celebration of Celtic heritage through engaging rhythms and rich harmonies that showcase the versatility and depth of contemporary Celtic music.\nJohn has recorded over 30 albums as a leader and side man including two BBC Jazz Albums of the Year (2003 and 2004). He has performed with the Scottish National Jazz Orchestra, was the first ever Jazz Composer in Residence at Victoria University, has written music for the NZSO/Wellington Jazz Orchestra and RNZAF Concert Band, and has toured internationally with his eclectic chamber ensemble \"The Troubles\".\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15, door sales $20.\n\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jazz Orchestra Composer Series Presents: John Rae, Award-winning composer and musician John Rae invites you to an enchanting evening of Celtic-inspired music that promises to get your feet tapping and your ears thumping. This large ensemble draws on both new and traditional melodies, reimagined in a style that reflects Rae’s cultural roots and personal musical journey. Experience a vibrant celebration of Celtic heritage through engaging rhythms and rich harmonies that showcase the versatility and depth of contemporary Celtic music.\n\nJohn has recorded over 30 albums as a leader and side man including two BBC Jazz Albums of the Year (2003 and 2004). He has performed with the Scottish National Jazz Orchestra, was the first ever Jazz Composer in Residence at Victoria University, has written music for the NZSO/Wellington Jazz Orchestra and RNZAF Concert Band, and has toured internationally with his eclectic chamber ensemble The Troubles.\n\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15 from Humanitix.com, door sales $20.\n\nThanks to Creative New Zealand for their generous support.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jess and Cam, Jess Deacon is a cross-genre vocalist and songwriter who embodies influences from jazz, folk, soul, classic rock and choral music. She is an engaging performer, has an ear for music that speaks to the soul, and writes songs that connect us as humans and challenge the expectations of the modern musician – following the ebb and flow of life as we know it.\nShe has fronted a number of bands, been commissioned as a composer, recorded on several projects, performed at a variety of festivals and events across Aotearoa, and has written a variety of original music.\nCam Steel is an amazing drummer and all-round beat master whose ability to produce a soundscape driven by rhythm is next level.\nTogether, Jess and Cam will give us a lunchtime of easy, groovy blues, a fine way to while away a Sunday afternoon.\nTickets $20 or $10 for Capital Blues Inc members.\n10% discount at the bar for food and drinks for members.\nThe Underworld, Pirie St, Wellington\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Jonathan Crayford - Bikes in Space tickets, Presented by: Jonathan Crayford\nJonathan Crayford introduces his latest project 'Bikes In Space' an electronic vintage keys and drums driven fully improvised groove space junk ensemble that sounds like what it might be like to be in the brain of Philip K Dick, Ursula Le Guin or Margaret St Clair - except more. After a 2 month tour of Auckland, they hit Nui with added punch to the drums featuring Riki Pirihi and Julien Dyne.\nJonathan Crayford keys, Joe Kaptein keys, Riki Pirihi drums, Julien Dyne drums.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Keli Holiday | Wellington, Aussie alt-rock star Keli Holiday is heading to New Zealand this September for three huge shows! Don’t miss your chance to catch the electric energy live.⁠\n⁠\nSign up now for exclusive Live Nation presale access → lvntn.com/keliholidaytix25\nMastercard Presale: Wed 30 Jul, 11am⁠\nLive Nation Presale: Thu 31 Jul, 11am⁠\nGeneral On Sale: Fri 1 Aug, 12pm⁠\nAll times local. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Kids Rock 4 Palestine, Kids Rock For Palestine\nOne Day. One Stage. One Cause.\nThis event is organised by kids in Pōneke to raise funds for kids in Palestine.\nJoin us for a one-day-only music fundraiser where young voices take centre stage to amplify hope and raise money for children in Palestine.\nUnder-18 musicians, solo artists, and bands (some joined by over-18 allies) are coming together to rock out with purpose, showing that music knows no borders and compassion has no age limit.\nThese young performers are using their talents to stand in solidarity with kids just like them who are living through unimaginable circumstances.\nOrganiser Eddie 12: \"We see children in Palestine who are being bombed and shot and are starving. We kids want to help. So that is what we are doing.\"\nThere will be stalls and crafting available for kids attending - Please come and support so we can raise money for Gaza's families.\n100% of proceeds go directly to emergency aid and child-focused relief in Palestine - Convoys of Good and Kiwi Trust for Palestinian Childrens Relief.\nWitness the next generation of artists and activists sharing the stage and raising their voices. Please support them with your attendance. Show them young people can make a difference.\nBe part of an event where music becomes action, and community becomes change.\nDo you want to volunteer to help? Email aotearoa2gaza@gmail.com\nALL UNDER 18s MUST ATTEND WITH A PARENT OR GUARDIAN.\nCan’t make it? Donate anyway!\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Kult presents act II : Red square, KULT – ACT II\n\n5th September 2025 |\n11pm till late�\nRed square, 26 Blair street, Wellington\n\nYour favorite techno takeover is already back for the ACT II. We hope everyone is ready for this new edition. New artists, evolving sounds and deep energy during a night of madness.\nKULT is a tribute to electronic music, a night where local techno artists meet the raw energy of Europe’s rave culture, and where we could all celebrate what matters.�KULT is more than a party – it’s a moment of sharing, an techno and mesmerizing experience built on freedom, inclusivity, and the love for music.\nThis time, we take the control of the @redsquare for a night that you will remember.\nLINE UP TBA\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Lacuna Presents - Us Two tickets, Presented by: Lacuna\nUs Two is a high-energy house DJ act from the Midlands, UK, with releases on some of the world's most respected labels including Knee Deep In Sound, MicroHertz, and Eastenderz. Known for deep grooves, rolling basslines, and infectious crowd connection, Us Two has earned support from global heavyweights like Marco Carola, Jamie Jones, and Skream.\nFrom European festival stages to Ibiza's 528 for a standout set with Knee Deep In Sound, Us Two's sound blends underground credibility with dancefloor-ready energy.\nHis latest release, \"Simulation\" (featuring Franksy), drops on Pete Tong's TSZR label, and has already earned plays from tastemakers like ANOTR, SG Lewis, LF SYSTEM, and SOSA, with early reactions going wild at Music On (Pacha Ibiza) and beyond.\nFor Lacuna, hosting Us Two’s debut in Wellington is about more than a headline — it's personal. We're thrilled to finally bring a dear friend's sound to our city and invite you to feel the energy first-hand on Saturday, 20 September 2025, at Meow Nui.\nPackages",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Lawrence Arabia Is Playing A Solo Show, It’s been six years since he last released an album and, like Richard Prebble before him, Lawrence Arabia’s been thinking.\nWhen songwriters think, often the result is songs. It’s time to bring out some of these new thought babies from the writing suite and expose them to the light; let them photosynthesise and become real and alive in the world.\nThe Silver Scroll, Taite and Tūī winning artist brings his engaging show of (new and old) songs and talk, accompanied by guitar and keys, to Meow.\nWith support from Frances Grass. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Lazy Friday Night, Join The Young Once for a fantastic night of great music and dancing, featuring all of your favourite hits from the 1950s and 60s.\nPut on your dancing shoes and dance away the winter blues.\nBring your family and friends for an evening of great food and entertainment.\nHelp us spread the word!\nClub membership is not required. Just sign in at reception and say you're here to see The Young Once band.\nCheck out the videos on our Facebook page for a taste of our music.\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Lisa Tomlins ft. OTC, The incredible Lisa Tomlins is back and bringing the VIBES – backed by the funky goodness of OTC\n! Expect Kiwi classics\n, big energy, and a whole lotta soul – it’s the kind of night that gets you up on your feet and dancing\nSmooth vocals, tight grooves, and tunes you definitely know the words to – come get amongst it!\nBook now to grab the best seats or just roll in and join the party on the dance floor!\nFree entry. Music from 6pm.\nBOOK A TABLE - www.stargroup.nz/events/southerncross-live-music ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Live 4 The Weekend-Sunday FREE Session - KOHA, What better way to spend Sunday than at Wellingtons best kept secret, the Vogelmorn Bowling Club.\nSituated in the Upper Space in the Bowling Club, Vogelmorn UPSTAIRS, this Sunday session is an intimate gig with Kakapo bringing his funk soul agenda on the turntables.\nLet the rhythm and baseline reset your energy.\nOffering a range of drinks and food, this is an all ages event, however those under 18 will need to be accompanied by a legal guardian.\nThis Sunday session will be live streamed on Titan FM 96.3 and YouTube because we Live 4 the Weekend X\nFREE Session - KOHA\nTags\ndj, edm, electronic, Kakapo\n\"Vogelmorn Upstairs is not a wheelchair accessible building. There is an accessible\nbathroom in the space. This is an all ages venue but those under the age of 16 must be\naccompanied by a designated adult after 8pm. The Vogelmorn Precinct is a community\nspace located in a residential area. With that in mind, the team ask that you be kind to\nothers' and that when you leave the gig, you do so quietly to avoid disturbing our\nneighbours.”\n“The Upstairs Bar and Smoked and Pickled Restaurant will be open from 3pm, to book a\ntable for pre-show kai email Alice at smokednpickled@gmail.com” ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Live 4 The Weekend-Thursday Nights, The weekend starts now!\n\nExperience the ultimate midweek drop every Thursday night from 9pm till late at The Garden Hotel where we Live 4 the weekend!\n\nThis is Wellingtons Thursday night club night, featuring Dj Kakapo on the turntables. Escape the week and let the rhythm and baseline reset your energy with the sound of house and drum&bass on the Kinky Soundsystem.\n\nFree Entry",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Live Acoustic Vibes with Pati Taii, Kick back, grab a drink\n, and ease into your evening with the smooth sounds of Pati Taii – live and acoustic in the heart of the Cross. With warm Kiwiana vibes\nand effortless crooning\n, Pati brings the kind of soul-soothing set that'll have you swaying in your seat\n(or up for a sneaky slow dance\n).\nPerfect for a cosy winter night out\n– good tunes, good kai\n, good company\n.\nFree entry. Music from 6pm.\nBook a table or just roll in early to snag a spot!\nTO BOOK A TABLE - www.stargroup.nz/events/southerncross-live-music ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Live Music - Tyler Legget, Live Music is back!\nTo kick it off we have @_tylerleggett playing at the Sprig + Fern Berhampore from 6pm, Friday 29th August.\nGrab your mates and book a table for Friday dranks.\nCall us on 04 380 0244 or slide into the DMs\n#bestlocal #sprigberhampore #livemusic #wellingtonevents ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "MESSIE - Wellington, MESSIE is taking Aotearoa’s electronic dance music scene to filthy new levels. As a former drummer, her passion for drumming was the pipeline for her falling in love with genres like Garage, Breakbeat, and Jungle. She has since expanded her sound and it’s safe to say each set will keep you guessing what will come next as she effortlessly merges genres such as Baile Funk, Ghetto Tech, Jersey Club, Juke, Afro beat inspired drums, Techno and many more global club soundscapes that encompass her high energy DJ sets. MESSIE’s sets are guaranteed to be bootleg heavy with something for everyone as she draws from her own music taste of rap and grime, to early 2000’s singalongs, girl-boss anthems and queer music culture in the form of edits you’d never expect.\n\nAlongside her headline tour around Aotearoa in mid 2024, MESSIE has now brought her fresh, high-energy club music to Glastonbury, Reading & Leeds, R&V, Beyond The Valley, Wildlands, Love Saves The Day, Gemfest & Outro Festival. With slots at Pohoda Festival, Hidden Festival, Motion, Truck Festival, AIASOUND and All Points East locked in for the second half of 2025, there is no slowing her down.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "MESSIE | Wellington #2, One of NZ’s most exciting DJs, MESSIE brings her high-energy, genre-blending sets this September for her 'All Night Long' Tour!⁠\nLive Nation Presale: Fri 22 Aug, 10am ⁠\nOn Sale: Mon 25 Aug, 10am⁠\nTickets → https://lvntn.com/MNZ25 ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "MINUIT : The Reunion Shows | PŌNEKE (Wellington)\nAfter over a decade away, legendary NZ electronic act Minuit are back – and bringing their iconic live show to Wellington.\n..................................................................................................\nThis reunion makes us very happy because we thought it might never happen – ‘the Kiwi band with the French name’ are back together for a series of shows.\nSinger, Ruth, describes the gigs as: \"a chance to dance, laugh and sing (in my case, often the wrong words), together live one more time.\"\nMinuit (minwee) became a must-see live act through the 2000s. Fronted by the enigmatic Ruth Carr, her coy persona ignites while bandmates Ryan Beehre and Paul Dodge forge rib-rattling beats around her.\nTheir debut album, The 88, released in 2003, achieved gold status in New Zealand, quickly followed up by the 'I Hate Guns' EP.\nOver the following decade, the trio toured their synths and samplers from Helsinki to Hanoi crafting their own refreshing sound – storming The Crystal Method's club night in LA, the FabricLive birthday bash in London, and headlining the Hanoi Music Festival in Vietnam. Along with festivals and shows up and down Aotearoa.\nHaving been retired since 2014, we’re excited to announce that Minuit are back onstage for a limited number of reunion shows.\nThese reunion performances will pay tribute to classic tunes from all four albums 'The Boy with the Aubergine Hair', 'Except You', 'Fuji', 'Menace', ‘Aotearoa’, ‘I Hate Guns’, ‘A Room Full of Cute’, 'Last Night You Saw This Band', ‘25 Bucks’ – everything gets a look in, plus a couple of other surprises.\nThe show will be supported by Western Haikus and JOLA BURNS.\nMinuit has a heart. And it beats loud. Real loud.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "MINUIT : The Reunion Shows | PŌNEKE (Wellington), SOLD OUT!!!!\nAfter over a decade away, legendary NZ electronic act Minuit are back – and bringing their iconic live show to Wellington.\n..................................................................................................\nThis reunion makes us very happy because we thought it might never happen – ‘the Kiwi band with the French name’ are back together for a series of shows.\nSinger, Ruth, describes the gigs as: \"a chance to dance, laugh and sing (in my case, often the wrong words), together live one more time.\"\nMinuit (minwee) became a must-see live act through the 2000s. Fronted by the enigmatic Ruth Carr, her coy persona ignites while bandmates Ryan Beehre and Paul Dodge forge rib-rattling beats around her.\nTheir debut album, The 88, released in 2003, achieved gold status in New Zealand, quickly followed up by the 'I Hate Guns' EP.\nOver the following decade, the trio toured their synths and samplers from Helsinki to Hanoi crafting their own refreshing sound – storming The Crystal Method's club night in LA, the FabricLive birthday bash in London, and headlining the Hanoi Music Festival in Vietnam. Along with festivals and shows up and down Aotearoa.\nHaving been retired since 2014, we’re excited to announce that Minuit are back onstage for a limited number of reunion shows.\nThese reunion performances will pay tribute to classic tunes from all four albums 'The Boy with the Aubergine Hair', 'Except You', 'Fuji', 'Menace', ‘Aotearoa’, ‘I Hate Guns’, ‘A Room Full of Cute’, 'Last Night You Saw This Band', ‘25 Bucks’ – everything gets a look in, plus a couple of other surprises.\nThe show will be supported by Western Haikus and JOLA BURNS.\nMinuit has a heart. And it beats loud. Real loud.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "MINUIT : The Reunion Shows | PŌNEKE (Wellington), SOLD OUT!!!!\nAfter over a decade away, legendary NZ electronic act Minuit are back – and bringing their iconic live show to Wellington.\n..................................................................................................\nThis reunion makes us very happy because we thought it might never happen – ‘the Kiwi band with the French name’ are back together for a series of shows.\nSinger, Ruth, describes the gigs as: \"a chance to dance, laugh and sing (in my case, often the wrong words), together live one more time.\"\nMinuit (minwee) became a must-see live act through the 2000s. Fronted by the enigmatic Ruth Carr, her coy persona ignites while bandmates Ryan Beehre and Paul Dodge forge rib-rattling beats around her.\nTheir debut album, The 88, released in 2003, achieved gold status in New Zealand, quickly followed up by the 'I Hate Guns' EP.\nOver the following decade, the trio toured their synths and samplers from Helsinki to Hanoi crafting their own refreshing sound – storming The Crystal Method's club night in LA, the FabricLive birthday bash in London, and headlining the Hanoi Music Festival in Vietnam. Along with festivals and shows up and down Aotearoa.\nHaving been retired since 2014, we’re excited to announce that Minuit are back onstage for a limited number of reunion shows.\nThese reunion performances will pay tribute to classic tunes from all four albums 'The Boy with the Aubergine Hair', 'Except You', 'Fuji', 'Menace', ‘Aotearoa’, ‘I Hate Guns’, ‘A Room Full of Cute’, 'Last Night You Saw This Band', ‘25 Bucks’ – everything gets a look in, plus a couple of other surprises.\nThe show will be supported by Western Haikus and JOLA BURNS.\nMinuit has a heart. And it beats loud. Real loud.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Monteverdi Vespers, Join us for our major project of the year! This will be the first time this groundbreaking work has been performed in Wellington for over a decade.\n\nJuxtaposing Renaissance melodies and polyphony with the rich virtuosity and colour of Baroque instruments, intimate vocal solos with a choir and orchestra of unprecedented grandeur, and dazzling opulence with striking emotional and spiritual depth, this will be an unmissable performance\n\n\nWe are thrilled to be joined by an incredible orchestra of top musicians from the NZSO and leading international artists! Come hear the striking tones of cornetti, dulcian, archlutes, Baroque recorders and more!\n\n\nN.B. There will be a pre-concert talk at 7pm. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Moon Jam Nite, Get your 15 minutes of fame at Newtown's famous Moon Jam Nite, every Tuesday from 7.30pm\n\nThe evening starts off as a regular open mic, and transforms into a full on jam towards the end.\n\nPut your moniker into the sign up sheet, and own your time slot. You can call upon the many talented muso's available to help you play your slot.\n\nA full stage with electric guitar, bass, keyboard, drums, mics, lights and full support from our sound tech.\n\nBring your own songs, poems, and friends (and make some new ones too)\n\nCome along for dinner, drink specials & enjoy the show!",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Moon Jam Nite, Newtown's favourite jam night! A weekly showcase of the musical talents of Newtown & beyond\nCome and share your original tunes, jam with other musicians, or simply enjoy the show & drink specials!\nElectric guitar, bass, keyboard, drums, mics, lights and mixer provided, along with support from our in-house sound tech Billy. Bring your own gear, cymbals, songs, & poems\nFree entry, sign ups from 7pm every Tuesday ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Music at the Begonia House – Gale Force Choir, Gale Force Gospel Choir is an inclusive choir in Wellington, New Zealand, that welcomes all singers regardless of previous experience, gender, religion, or cultural background. We primarily sing arrangements of gospel songs collected from the Southern United States by New Zealand song leader Tony Backhouse\n\nMeet at the Begonia House – entry by donation towards the Begonia House refurbishment. Free seating for Friends.\n\nThis is part of the monthly music series run by the Friends of the Wellington Botanic Garden. Join the Friends for only $30 a year and all the concerts will be free, as well as other great benefits. https://friendsofthewellingtonbotanic.wordpress.com/join-us/",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "NXT LVL - Pushing the Boundaries of Music for the NXT Generation, 🎶 NXT LVL – Pushing the Boundaries of Music for the NXT Generation 🎶\nGet ready for a night of pure energy, fresh sounds, and the future of dance music. NXT LVL brings together five rising young DJs—homegrown talents with a passion for beats, rhythm, and vibes that move the crowd.\n🔥 Meet the Lineup 🔥\n🎧 Ahinui – Afro House\n🎧 DJ Waylon – Hip Hop / Bass House\n🎧 Max Hart – Funky House\n🎧 G-Mann – House / Electronic / Tech House\n🎤 Hosted by MC Rinza Da Bard\nEach artist brings their unique sound, ready to light up the dance floor and take you on a sonic journey. This is the next generation of DJs — raw, ready, and real.\n💥 Don’t miss your chance to experience the NXT LVL. The future of music starts here.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "NZSM String Ensemble, The NZSM String Ensemble presents:\n\nSheen and Shadow by Penny Axtens (World Premiere)\n\nSt. Paul’s Suite Gustav Holst\n\nFeel free to bring a bag lunch to enjoy during the concert.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "New Zealand Secondary Students’ Choir, Bringing their “infectious joy for music-making” to Wellington’s Kāpiti Coast, the internationally renowned New Zealand Secondary Schools Choir present a wide range of music from classical choral to gospel, jazz, modern, and music from Aotearoa and the Pacific.\n\nThis is your chance to see their first full-length concert performance of 2025!\n\n“The repertoire we sing in this choir is so diverse and fresh. It’s not choral music as you’d expect. The choir is one of the best sounding in Aotearoa, and we have so much fun performing the pieces. Anyone who sings in choirs or just for fun as a hobby should come and hear us perform”– 2023-24 NZSSC singer\n\nBring the whole family for an evening of choral excellence and entertainment!\n\nGet your early bird special before 29 August 2025 to secure a great concert at a great bargain!\n\n--\nFor accessibility seating information and wheelchair space bookings please email kiaora@teraukura.nz or call 04)9740535 during office hours.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "O Fortuna!, Prepare for a night of musical grandeur as Orpheus Choir Wellington and Auckland Choral, New Zealand’s largest city choirs, unite to present Orff’s monumental Carmina Burana! With its apocalyptic opening, O Fortuna, this masterpiece explores the capricious nature of fate, the joys and sorrows of life, and the boundless energy of human passion. From the revelry of In Taberna to the tender beauty of Dulcissime, Carmina Burana is a visceral and unforgettable experience.\n\nThe concert opens with Bernstein’s radiant Chichester Psalms, a joyous blend of rhythmic vitality and heartfelt spirituality, providing the perfect prelude to the drama and intensity of Orff’s masterpiece. Both works will feature acclaimed pianists Jian Liu and Diedre Irons in little known arrangements\n\nThis performance will be mighty in sheer scale, with nearly 300 performers on stage, including a children’s chorus, the combined power of two elite choirs, and the dynamic sound of the Wellington Brass Band. Add to this the extraordinary talents of soloists Emma Pearson (soprano), Stephen (\"Coco\") Diaz (tenor), and James Harrison (baritone), and you have a musical event of epic proportions.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "OA @ Cuba St Tavern, The awesome humans at Cuba St Tavern will be hosting us along side some of the best NZ Selectors !\nExpect the usual high standards of production and elite flavors of House and Techno\nHere's your line up :\nFortuna w Blvir\nNot My Sister\nJamie Rose\nK-otiK b2b Ryan C\nAlopex\nCyril Orson\nKicking off at 4pm\nSee you on the floor !!! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "On Repeat: Hamilton Party - Wellington, I'M PAST PATIENTLY WAITING\n\nTICKETS ON SALE NOW!\nbit.ly/HAMwell\nHAMILTON: THE MUSICAL PARTY!\nSATURDAY AUGUST 30\nSAN FRAN\nWELLINGTON\nDOORS AT 9PM\n18+\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSinging Hamilton all night in a club? YES THANKS!!\nTake a Break and join us in The Room Where It Happens for a Hamilton tribute Party!\nYou’ll Be Back for more as DJs play songs from Hamilton + all your favourite show tunes from all the best musicals + all your Best of Both Worlds faves Non-Stop!\nWe Know you won’t be able to Say No to This so we recommend getting in quick for tickets if you want to be Satisfied!\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSOUNDS LIKE:\nHamilton • Wicked • Six • Chicago • Waitress • In The Heights • Heathers • Rent • Hairspray • Grease • Les Miserables • tick, tick… BOOM! • Newsies • Spring Awakening • Dear Evan Hansen • The Book of Mormon • Sweeney Todd • Legally Blonde • The Phantom of the Opera • Mean Girls • Funny Girl • Little Shop of Horrors • West Side Story • Beauty and the Beast • The Sound of Music • Cats • The Addams Family • Company • Hadestown • Billy Elliot • The Prom • School of Rock • Cabaret • Dreamgirls • Shrek the Musical • Company • Hadestown • Billy Elliot• Annie • Come From Away • Merrily We Roll Along • Evita • Beetlejuice • Shucked • Kimberly Akimbo • Parade • Oklahoma • Moulin Rouge • Frozen • Matilda • Mamma Mia! • The Lion King • Rocky Horror Picture Show • Into The Woods • 13 • Aladdin • The Wizard of Oz + HEAPS MORE!\nThe Best of Both Worlds would like to acknowledge the traditional custodians of the land our events take place on and honour their Elders past and present.\nPlease read our company T&Cs carefully prior to purchasing your ticket - https://bit.ly/PurchaseTCs\nPlease note: Our events may feature moving and flashing lights. If you have photosensitivity or any related concerns, feel free to reach out to us with any questions! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Original Sin (UK), FULL TIME SENDERS & JUICED UP PRESENT: ORIGINAL SIN - SATURDAY 20 SEPTEMBER | EVA, WELLINGTON\n\n\n\nThe jump-up king himself touches down in Wellington for the very first time. From tearing up the UK underground as one half of G Dub alongside Sub Zero, to unleashing solo anthems like Don’t Be Silly, Haunted and DNB Forever (Soz Nan), Original Sin has carved his name into the core of drum & bass.\n\n\n\nWith releases on RAM, Playaz, Souped Up, Crucast and Elevate, his sound is heavy, high-energy, and built for chaos. Having torn through festivals like Let It Roll and Boomtown, it’s finally Wellington’s turn to feel the full force of his basslines.\n\n\n\nThis one’s gonna be nasty. Backing him up is a stacked local roster, keeping the energy high from doors to close:",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "PAUL SEYB - FREE dj set ( koha), Seyb explores the underground spectrum of minimal house, tech house, house, and minimal techno. His sets are immersive journeys built on groove, subtle progression, and hypnotic layering, moving from deep rolling rhythms into darker, stripped-down textures. Each performance is crafted for true dancefloor immersion.\nFree (koha) dj set from 5pm\nBar open from 3pm to 10pm\n\"Vogelmorn Upstairs is not a wheelchair accessible building. There is an accessible\nbathroom in the space. This is an all ages venue but those under the age of 16 must be\naccompanied by a designated adult after 8pm. The Vogelmorn Precinct is a community\nspace located in a residential area. With that in mind, the team ask that you be kind to\nothers' and that when you leave the gig, you do so quietly to avoid disturbing our\nneighbours.”\n“The Upstairs Bar and Smoked and Pickled Restaurant will be open from 3pm, to book a\ntable for pre-show kai email Alice at smokednpickled@gmail.com” ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "PUR Techno Night, PUR x San Fran – August 23\nWe’re back at San Fran for another night of deep, driving techno.\nExpect hypnotic grooves, raw energy, and a lineup curated for the dancefloor.\nDoors open 11:30PM. Come early, stay late.\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Pōneke Dub Club 01, Bigbada Boom Sound System presents: Pōneke Dub Club!\nFeaturing the finest selectars and MCs in the region. Bringing in an authentic experience into the world of Reggae, dub, roots and sound system culture to the capitol of Aotearoa!\nSupported by Royal Jamaican Ginger Beer, Heartbreaker Bar & Restaurant. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Razored Raw Presents Radium (Ōtautahi)+ Guests, Radium ftom Ōtautahi\nhttps://radiumhc.bandcamp.com/.../witness-for-yourself...\nWith locals:\nFresh off grinding Japan, Forced Starvation\nhttps://forcedstarvation.bandcamp.com/.../forced-starvation\nFresh off Blacken Open Air, DAHTM\nhttps://dahtm.bandcamp.com/\nThe return of Stress Ghetto\nhttps://stressghetto.bandcamp.com/\nRaw-noise grindcore from Maced\nEmo-core newcomers Eurydice\n$15+bf presales\n$20 cash door",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Sam Bambery - Live at Vogelmorn Upstairs, Sam Bambery is an artist and impresario from Ōtautahi/Christchurch, currently based in Naarm/Melbourne. Exploring his love of semi-psychedelia through a twisted folk-rock lens, Bambery writes effectual and spacious songs burrowing into emotional identity and exhaustion. His sophomore album Rubricator released in 2024 with micro-label Under Underground Records, edging at outsider-pop influence.\n\n\"...very considered, like Bambery lived with the album in his head for a while before bringing it into the world...a hint of mystery hangs over things...it's as ornate as these well-crafted tunes\" - Tony Stamp, Radio New Zealand",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Schubert Octet with Aroha String Quartet and Friends, For this programme we are joined by four wonderful guest artists - Nick Walshe (clarinet), Justin Sun (bassoon), Alexander Hambleton (horn) and Oleksandr Gunchenko (double bass) - to present a programme enlivened by the varied timbres of wind instruments.\n\nBeginning with the Mozart String Quartet in B-flat K589 we move on to 'Serenata in vano' for Clarinet, Bassoon, Horn, Cello & Double Bass by Danish composer Carl Nielsen. This characterful work depicts a short and unsuccessful attempt at seduction. We finish with Schubert's mighty and virtuosic Octet, a work filled with jaunty dances, singable melodies and heart-rending moments.\n\nAroha String Quartet:\nHaihong Liu & Konstanze Artmann - violins\nZhongxian Jin - viola\nRobert Ibell - cello\nAcclaimed as demonstrating \"accomplished brilliance, soulfulness and sublime intensity in perfect balance and tonal unity\" (The Dominion Post), the Aroha String Quartet is firmly established as one of New Zealand's finest chamber music ensembles. Founded in 2004, this versatile Wellington-based quartet is known for its passionate musicality, impressive technique, and multicultural innovation.\n\nNick Walshe - clarinet\nNick Walshe is a clarinettist, music teacher and arts administrator based in Te Whanganui a Tara/Wellington. He is currently section principal clarinet with Orchestra Wellington, and co-principal clarinet with the Royal New Zealand Air Force Band and also maintains a busy studio of clarinet and saxophone students, privately and in high schools.Nick works as a freelance musician for organisations such as the New Zealand Symphony Orchestra, Stroma New Music Ensemble, and the Capital Theatre Trust.\n\nJustin Sun - bassoon\nJustin was born and raised in Canberra, Australia, and began playing the bassoon at age 12. After completing his studies in 2018, he was appointed Principal Bassoon of the Aarhus Symphony Orchestra in Denmark, where he worked for 3 years before being appointed Associate Principal Bassoon of the New Zealand Symphony Orchestra in 2021. He has performed as guest principal with many orchestras worldwide, including Sydney Symphony, Australian Opera and Ballet, Scottish Chamber, Royal Philharmonic and BBC Symphony.\n\nAlexander Hambleton - horn\nBefore joining the New Zealand Symphony Orchestra, Alex studied and worked in the UK and Sweden.\nAlex spent eight years as a member of the Gothenburg Opera Orchestra, in addition to touring and recording with the Swedish Chamber Orchestra.\n\nOleksandr Gunchenko - double bass\nOleksandr was born in Kiev, Ukraine, where he studied at Lysenko School of Music and Tchaikovsky Conservatory. He became a member of the National Philharmonic Symphony Orchestra at the age of 19 and at the age of 20 gained a position with the National Chamber Orchestra of Ukraine. Oleksandr joined the New Zealand Symphony Orchestra in 2007. He is a member of the contemporary ensemble Stroma, and also regularly performs solo recitals.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Seaside Sloths Social September Soirée, Hey. Have you heard the Seaside Sloths are hosting a Social Soirée in September? No? What the hell is even that?\n\nIf you're a bit apprehensive because this is your first time having a September Soufflé, then I'll give you a brief rundown below;\n\n- Sick beats etc...\n- Cool instruments i.e. drums\n- Ample refreshments\n\nLimited door sales may be available.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Sing & Fling, Join JoJo Bellini for an evening of epic sauciness and song!\n\nSing & Fling is more than just a burlesque show. Every single performer will be singing live on stage as they shimmy and shake their tassels for you!\n\nHarking back to the glamour of Vaudeville with a modern twist, this evening of burlesque and song will tease and delight you with voices dripping with velvet and costumes devine!\n\nWith performances by , Ms Weeds, Billie Bountiful, Willy Smack'n'Tush, Victor Victorious, Breathless La Belle, Hester Hawthorne and Velma Cherry!\n\nAll door sales $35 if the show is not sold out prior.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Sir Dave Dobbyn - Selected Songs, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket\r\n\r\nPlease note: There is no elevator in the Opera House and access to the Dress Circle and Gallery are via stairs. The Gallery may be unsuitable for patrons with accessibility requirements or experience vertigo. For further information, please contact us on 04 916 1205.\r\n\r\nChild Policy:\r\nThis event is all ages, all patrons must hold a valid ticket for entry. ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Songwriter Showcase 106, Every 3rd Sunday of the month we showcase four local songwriters and celebrate the rich culture and depth of talent we have here in Aotearoa.\n\nThis month we present.. The Vorn String Trio, Emily de Vegt, CP3o, and Banjo Ben and the Breeze\n\n\nThe Vorn String Trio..\nWellington songwriting legend Vorn needs no introduction! But since I have to write something in this box and you seem compelled to read it, let’s both reflect on the wonder of a 25-year career spent labouring in prolific obscurity, across 9 albums of songs which veer from sublime to ridiculous, often within a single verse. Fresh off releasing The Late Album (the only NZ indie album ever to beat terminal cancer), Vorn and the ludicrously talented Charley Davenport (cello) and Thomas Liggett (violin) will present a selection of the best songs ever written in this country. You should come listen!\n\nhttps://vornpowertool.bandcamp.com/track/a-safe-pair-of-hands\nhttps://vornpowertool.bandcamp.com/track/all-along-the-shore\nhttps://www.youtube.com/watch?v=MqYKO64nHuM\nhttps://www.youtube.com/watch?v=L7CoOPc6AX8\nhttps://www.facebook.com/Vornmusic/\n\nEmily de Vegt..\nTaranaki’s Emily de Vegt brings a cosy, whimsical charm to the girl-with-a-guitar flavour of singer-songwriter. Her songs draw from her background in classical piano and pay tribute to melancholic modern artists like Radiohead and Lana Del Rey.\n\nhttps://soundcloud.com/emilydevegt/birds-hawera-2023\nhttps://soundcloud.com/emilydevegt/somygardengrows-hawera-2023\nhttps://facebook.com/emilydevegt/videos/718456777591120\n\nCP3o..\nBarry Carter's CP3o give you original songs with a Jazz-Acana feel.\n\nhttps://www.youtube.com/@CarterParkerTrio-CP3o/videos\nhttps://www.facebook.com/people/CP3o-Carter-Parker-Trio/100091844075290\n\n\nBanjo Ben and the Breeze\nBanjo Ben and The Breeze are a new 4-piece indie-folk comedy band based in Wellington,\nNZ. They are known for their iconic beanies, their regular evening busking sessions on\nCuba Street, and their theatrically charged gigs which are packed full of catchy lyrics, wild\nstories and plenty of laughs.\n\nhttps://youtu.be/ejM7pZYBMYI?si=Rc_CSQEt2zQYvewW\nhttps://www.instagram.com/banjo_ben_and_the_breeze\nhttps://www.facebook.com/people/Banjo-Ben-and-The-Breeze/61578992621362/",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Southern Echo, Always a great Night.\nMembers, Affiliated Members and their guests are welcome.\nWhatman Restaurant open from 5.30pm for dinner or a snack.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Spring Thing, Spring Thing.\nA chance to shed winter.\nLonger days, warmer air and vibes.\nFriends, tunes, a couple of bevvies and a groove to toast the change.\nFamily-friendly venue, tasty bites and room to catch up properly.\nWarm up your feet and your soul.\nSaturday 20th September, from 3pm until 10pm.\nTickets $15 from Humanitix or on the door.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Stabat Mater, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Stabat Mater, All Tickets are Mobile Ticket Only. \r\nMobile Tickets are like Print-at-Home tickets but instead of having to print off the tickets yourself, you can just show the barcode on your mobile phone. It is the easiest way to access tickets to your events. For more information visit Ticketmaster.co.nz/mobileticket ",
    "label": "Music & Concerts",
    "skip": true
  },
  {
    "description": "Sunday Jam: Big Band Experience, A workshop where players can experience a full big band, under the expert musical direction of the fabulous Oscar Lavën, with the assistance of the great Chris Selley on lead trumpet! We will be playing arrangements by Ellington, Basie and Sonny Rollins. A small fee will be levied to cover the costs of the tutors. Limited places in the horn sections are still available! Spectators also welcome with koha entry as usual. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Sunday Jazz - Julien Wilson, The Rogue's regular Sunday afternoon jazz. Funky, jazzy, soulful jazz. Beer, hangs, and jazz, on a Sunday, perfect!\n\nThis week featuring Australian saxophonist Julien Wilson\n\nGet ready for an unforgettable outing of jazz as Australian saxophonist Julien Wilson teams up with Wellington’s own jazz drummer Mark Lockett for a special trio performance at The Rogue.\n\nHaving collaborated for many years, both locally in Australia and on international tours, Julien and Mark bring a wealth of experience and a deep musical connection to the stage.\n\nJoining them is talented and melodic Wellington mainstay bassist Seth Boy.\n\nDon’t miss this dynamic collaboration that promises to deliver a vibrant and captivating musical experience!\n\nMusic from 5pm, FREE ENTRY",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Sunday jam & dance, Our regular fortnightly event. This week we’ll try out some of the tunes we are planning to play at our upcoming Jazz Festival Gig - Hit tunes of the 1930s, so come and have a blow, dance or just a cuppa and biscuit. All welcome! ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "THE AFTERPARTY FT. SPECIAL GUEST | WELLINGTON, Keep the party going at Garden Hotel after the big dance at Netsky 360\nAudiology presents:\n______________________________________\nThe Afterparty ft. SPECIAL GUEST\n______________________________________\nSaturday 30th August\nThe Garden Hotel\nWellington\n10:00PM - late\nR18\n______________________________________\nFeaturing:\nSPECIAL GUEST\nWAVES\nSAMMY J\nFREEMAN & CHANO\nMAGNUM\nTickets on sale Tuesday 26th August 7:00PM\nTicket Link --->> bit.ly/AFTERSS_WEL ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Teddy Killerz: the Cooked Tour, Back again already? Yes. Yes they are.\n\n\n\nAfter tearing through Wellington in January, Teddy Killerz missed the memo on the annual stand down, but that’s not stopping what’s about to unfold.\n\n\n\nThis time they return with a brand new album. ‘Cooked’, the latest chapter in their heavyweight catalogue, and this tour is the celebration.\n\n\n\nAlso joining the carnage is Christchurch’s own Yen, plus a stacked local roster:",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Terry Shore, Terry Shore has been a real stalwart around the local Wellington music scene for over 30 years, playing his own original music both solo and with the Volun Terry Band.\n\nHe has 5 albums, 2 more on the way, and 3 EP's to his credit since releasing his first Poly Rhythm album in 2010. For the last 20 years he has run a programme on Wellington Access Radio showcasing unknown songwriters called Terry's Songwriters Show which airs on Saturdays at 2:30pm.\n\nTerry has written memorable original catchy pop songs such as Anything, Dancing On The Line Island Love, Galactica Calling, The Daleks Are Coming In and many more.\n\nHe will be playing at the Undercurrent on Sunday 24th August from 5:30pm performing his originals with electric acoustic guitar and MP3 backing tracks. Stay on after the Sunday Jazz and see Terry for a good entertaining show!\n\nSunday 24th August\n5:30pm\n$15 online/ door\n$20 for entry and CD\n\nComplimentary snacks, wine, beer & soft drinks, tea & coffee, and of course...books available for purchase!",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Cowpokers + Tyson Smith, THE COWPOKERS: Foot-tappin' Onekaka Swamp Rock, World Famous in Golden Bay!\nGolden Bay's finest local boys are rounding up and riding North to bring their unique brand of rock, blues and ska to the capital. What if swamp rock wasn't born in Louisiana, but in Takaka you ask? What if Iggy Pop and the Stooges had been Marlborough dairy farmers? What if Hendrix had settled in a Tukurua art gallery selling homemade jewellery crafted from shells and bone? The answer to all these questions and more can be found at a Cowpokers gig: a raw, barn-storming, rural-rock-and-roll sensation that 23 years of gigging has utterly failed to hone, polish, or refine.\nTYSON SMITH: Wellington-based guitarist/singer/songwriter Tyson Smith will be bringing his unique, original music combining elements of rock, blues, folk, world music and freeform improvisation.\nTyson has worked as a guitarist with acts ranging from the New Zealand Symphony Orchestra to vocalist Hollie Smith, before focusing on his own music in the last few years.\nIn 2024 he celebrated 10 years since the release of his album The Hollow Tree with Rick Cranson and Ed Zuccollo, and released his new single Wolves. Tyson has been performing regularly around various New Zealand venues and festivals with his raw and exciting sound both with the trio and solo (utilising multiple amps and a bass drum). ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Insomniacs, Come on down and get some jazz in your ears with The Insomniacs!\nJames Illingworth - Keys\nJohnny Lawrence - Bass\nDarren Mathiassen - Drums\nMusic from 9pm FREE ENTRY - Koha for the band encouraged ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Intruders, The Intruders are Wellington’s very own chordless powerhouse. Mark Lockett, Jack Harris and Isaac Randel have come together to form a trio designed to intrude.\n\nThe Intruders will take you from beautiful subtleties to time warping, confrontational swing.\n\nPlaying a mix of standards and originals, you’ll hear the music of Ornette Coleman, Mark Lockett, Steve Grossman, and Isaac Randel.\n\nThis upcoming group is surely one of a kind that is not to be missed.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Intruders, The Intruders are Wellington’s very own chordless powerhouse. Mark Lockett, Jack Harris and Isaac Randel have come together to form a trio designed to intrude.\n\nThe Intruders will take you from beautiful subtleties to time warping, confrontational swing.\n\nPlaying a mix of standards and originals, you’ll hear the music of Ornette Coleman, Mark Lockett, Steve Grossman, and Isaac Randel.\n\nThis upcoming group is surely one of a kind that is not to be missed.",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The RVMES Boundary Issues Tour w/ Devon Welch & Fortuna + 93silva, Come down for an epic night in the heart of Wellington with. The RVMES (pronounced The Rooms for the new). These lads are a high energy alt-rock band from Tāmaki Makaurau Auckland who are releasing their fourth album Boundary Issues and hitting the road for a 9-date tour around Aotearoa.\n\nSUPPORT FROM!\n\nDevon Welch:\nAn Auckland based alternative funk fusion up-and-comer. They lay down 70s funk grooves blended with hip-hop production and live showmanship that'll set your heart on fire\n\nFortuna:\nGrowing up in Germany with a vibrant family of musicians with Italian and African heritage. Fortuna's passion for music and dance was ignited from an early age. Her adventurous spirit and love for experimentation have now driven her to promote her own events in Wellington. With her mesmerizing and melodic beats, Fortuna takes to the decks, captivating audiences with her hypnotic and uplifting sounds.\n\nROY (93silva):\nFreshly returned to the Pōneke shores from his hometown - Taranaki, 93silva returns with a suitcase full of bouncy rhythms, groovy basslines, and infectious vocal dubs. With a sound that’s constantly evolving. 93silva is here to keep you guessing, keep you sweating, and most of all—keep you dancing.\n\nFortuna and 93silva will be performing together and we cannot wait to see what they come up with!",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Undercurrent All-Stars, The best and brightest of Undercurrent’s resident musicians are coming together again for their first ever evening show!\n\nThey will play two sets of the finest tunes from the All-Stars repertoire, including many previously unheard numbers. Brand new arrangements of favourite standards will awe and entertain you! Thrilling solos will soar over lush horn lines and fascinating rhythms. Relax in the comfortable atmosphere of the Undercurrent, grab a drink as you listen, and enjoy some exciting music.\n\nPersonnel:\nAlex Trask – alto saxophone, arrangements\nMike Taylor – trumpet\nBlair Latham - Tenor sax, Daniel Yeabsley – baritone saxophone\nLockie Bennett – guitar\nElijah Mulheron – bass\nJohn Rae – drums\n\nWednesday September 10th\nDoors 7pm/ Gig 7:30pm\n$20 on the door & online\n\nComplimentary snacks, wine, beer & soft drinks, tea & coffee, and of course...books available for purchase!",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "The Undercurrent All-Stars, The best and brightest of Undercurrent’s resident musicians are coming together again for their first ever evening show!\nThey will play two sets of the finest tunes from the All-Stars repertoire, including many\npreviously unheard numbers. Brand new arrangements of favourite standards will awe and entertain you! Thrilling solos will soar over lush horn lines and fascinating rhythms. Relax in the comfortable atmosphere of the Undercurrent, grab a drink as you listen, and enjoy\nsome exciting music.\nPersonnel:\nAlex Trask – alto saxophone, arrangements\nMike Taylor – trumpet\nBlair Latham - Tenor sax, Daniel Yeabsley – baritone saxophone\nLockie Bennett – guitar\nElijah Mulheron – bass\nJohn Rae – drums\nWednesday September 10th\nDoors 7pm/ Gig 7:30pm\n$20 on the door & online\nhttps://www.undertheradar.co.nz/.../The-Undercurrent-All...",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Tommy and the Midnight Sun @ The RSC, Free Entry, koha for the band!\n\nBrought to you by freestyler extraordinaire Tommy Midnight, anticipate a night that begins with heartfelt songwriting to wash away your winter woes, transitioning through to high energy conscious hiphop, soul and Raumati groove complete with horns, in his full band the Midnight Sun. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Traskforce! ft. Wallace Gollan and Eugene Wolfin, Two of Wellington’s most enthralling vocalists perform with a powerhouse octet in a celebration of the sublime songs of the jazz repertoire.\n\nTickets available from UTR or on the door\n\nStarring Wallace Gollan and Eugene Wolfin on vocals, the octet will present a fizzing set of big band swing, Broadway hits, and gorgeous ballads. Hear the fine lyricism of the 20th century sung by two of Wellington’s most exciting performers.\nExhilarating original compositions and arrangements will tug at your feelings in new and compelling ways. Daring solos from some of the finest musicians in the country will awe and shock you as the turbulent horns sing out.\nWitness the union of big band attitude and chamber music intimacy as this very special band play their hearts out to you.\n\nThe performers:\nConsistently connecting the dots between genres and influences, Wallace Gollan’s artistic identity has become uniquely recognizable, with her jazz training and distinct harmonies captivating audiences around the globe.\nFor the last 8 years vocalist Eugene Wolfin has been a regular of Wellington music scene performing in a wide variety of genres including Jazz, Blues, and Rock ’n’ Roll. He has had a hand in a few local Musical Theatre productions performing lead roles in ‘Chess’ and the modern hit ‘If/Then', and is a regular in front of Jazz Orchestras including the Royal New Zealand Air Force Band and the Rodger Fox Big Band.\nTraskforce! is bandleader Alex Trask’s most swinging musical organisation. They play fresh arrangements of original compositions, classic swing, and Broadway love songs. This includes songs from the Basie repertoire, Bob Mintzer, Oliver Nelson, Quincey Jones, and Lionel Bart's Oliver! to name a few. The five horn arrangements allow for the power of a big band and the subtlety of a quartet to shine side by side. The band is made up of Wellington’s top players, including members of the Rodger Rox Big Band, the RNZAF band, NZSM faculty, and rising stars.\n\nDoor sales $20, Pre-sales $15, Student/Concession $10\n\nPersonnel:\nWallace Gollan – vocals\nEugene Wolfin – vocals\nAlex Trask – alto saxophone, arrangements\nMike Taylor – trumpet\nOscar Laven – tenor saxophone\nKaito Walley – trombone\nDaniel Yeabsley – baritone saxophone\nDuncan Haynes – piano\nElijah Mulheron – bass\nJohn Rae – drums",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Vincent Vega Plays Tarintino, A night of surf, soul and rockn'roll bangers from Quentin Tarantino's cult classic films, played with great vengeance & furious anger by Wellingtons favourite surf-rock saviours Vincent Vega. Expect tunes from Pulp Fiction, Reservoir Dogs, Once Upon A Time In Hollywood, The Hateful Eight, Death Proof and more.\n\nFeaturing special guests Lisa Tomlins on vocals and Louis TM on keys and vocals, as well as the usual suspects in Richard Te One (drums), Nick Lissette (bass) and Chris Armour (guitar)\n\nMusic from 9:30pm, FREE ENTRY",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "WARM LEATHER + CHRISTIAN WOLVES + BEACH BALLS, Long overdue ramble down the line from Tamaki Makaurau to Te Whanganui-a-Tara for trio WARM LEATHER, to lock in a gig w/local crazy guitar ensembles, the latest of Campbell Kneale’s guitar noise scree riffage CHRISTIAN WOLVES, & Menno’s no doubt guitar terrorist outfit BEACH BALLS. At Underworld Tavern, 16 Pirie Street, Mt. Victoria, Wellington ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "WJC presents Randel, Harris, Lockett The Intruders, The Intruders are Wellington’s very own chordless powerhouse. Mark Lockett, Jack Harris and Isaac Randel have come together to form a trio designed to intrude.\nThe Intruders will take you from beautiful subtleties to time warping, confrontational swing.\nPlaying a mix of standards and originals, you’ll hear the music of Ornette Coleman, Mark Lockett, Steve Grossman, and Isaac Randel.\nThis upcoming group is surely one of a kind that is not to be missed. ",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Works for Loud Speakers #30, Works For Loudspeakers is a platform for emerging and established composers working in the field of electro-acoustic music.\nThis is a roughly one hour listening event in which works from local and international sound artists will be diffused through multiple unmatched speakers in a surround environment.\nKoha entry. Complementary refreshments. All welcome!\nFeaturing works by:\nMattia Benedetti\nVincent Giles\nDavid Cowlard and Andrew Moon / RST\nEFC\nKOshowKO\nPrzemysław Scheller\nHector Bravo Benard\nBox of Hammers\n",
    "label": "Music & Concerts",
    "skip": false
  },
  {
    "description": "Springbokke vs All Blacks 7pm, Update 23/8:\nWe are now at capacity for this event.\nI have sent PMs to everyone that commented in the chat that they were interested to confirm if they are attending or not. Please come back to me ASAP as I have a waiting list. If you are keen to go on the waiting list, please send me a PM so I can add you to the list.\nThe cost to hire the club is $200 so I will appreciate it if you can do a gold coin donation (or more if you are so inclined that we can give as tips to the bar staff) for every person that attends.\nYou can bring your own food/snacks for the game but all drinks are to be bought at the club. Knowing Peter (club manager), he will have a brandy and coke special again like last time. I will ask him for his latest drinks price list and post it here for you to see. Their prices are very reasonable.\nLooking forward to seeing you all there in your best Bokke outfits as the warm up for the following weekend's game in Wellington!\nAs you may be aware, the Bokke will be playing two games in New Zealand in September. The first game will be in Auckland on 6 September and the second on 13 September right here in Wellington.\nI have booked the Tawa Squash Club to watch the game on the 6th of September. Please mark the event as interested to get the notifications of what will be happening. ",
    "label": "Sports & Fitness",
    "skip": false
  }
]