[
  {
    "new": true,
    "description": "AR monthly Singaround,, AR Monthly Singaround. Bring songs, tunes or poems to share, or just come to join in. Now at our new venue. No charge for entry. Feel free to purchase tea, coffee, drinks and snacks at the\nbar. Held the third Wednesday of every month. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Site Visit - Studio of Pacific Architecture - Te Aro Double-Header!, Join us on Wednesday 20 August, for an exclusive NAWIC members-only site tour of two very different but geographically close projects in Te Aro. The National War Memorial and FPC Martin Square are both undergoing major refurbishment - join us for a look behind the scenes!\nNational War Memorial: Refurbishing a Wellington Icon\nStep behind the scaffolding and witness the National War Memorial Project – a complex seismic strengthening project where heritage sensitivity is of utmost importance. With construction works being carried out by Maycroft Construction, join us for the rare opportunity to explore a significant piece of the capital’s cultural fabric.\nKnown to many as the backdrop of ANZAC Day commemorations, this national memorial is undergoing a meticulous refurbishment to ensure its legacy endures for generations to come.\n What’s Happening On Site:\nSeismic strengthening of the tower and bell frame \nStone remediation to preserve its historic façade\nAsphalt roofing works\nThe real challenge? Balancing modern engineering with heritage preservation. Every upgrade is being carried out with deep respect for the building’s historical significance.\n\nThen, just around the corner, we will move on to another refurbishment project – at a much different scale and for a very different purpose!\n FPC Martin Square: from Workshop to Office Space\nLeading industrial design-and-build specialists First Principles Constructors are celebrating seven years of innovation with a bold move - into a brand-new headquarters in central Wellington. Take a look inside the transformation of a former engineering workshop into the new HQ for FPC. With exposed services, raw materials, and an industrial aesthetic, this compact yet clever refurbishment shows how much can be achieved in a small urban footprint. Construction is well underway by Aoraki Construction, with completion coming up in September.\nWhat’s Happening On Site:\n•     Structural steel installation, new roofing, cladding, a new concrete mezzanine slab\n•     Interior fit-out works\n•     Full building services upgrades\n The Details:\n🕒 DATE and TIME: Wednesday, 20th August, meet at 2.45pm for a 3.00pm start at the National War Memorial\n📍 LOCATION: Meet at the National War Memorial (19 Buckle Street) to explore this site first. We will then walk over to 21 Martin Square as a group, for the next site visit.\n🎟️ COST: Free to NAWIC members, with a maximum of 18 people on the tour, so please book your space consciously. Get in quick! You can join NAWIC here.\n👷‍♀️PPE: Hard hat, hi-vis, steel-capped boots. (Spare hard-hats/hi-vis are available if required, please make sure you advise us of what you need on your RSVP.)\n 🎉 After the site visits, unwind with drinks and nibbles sponsored by First Principles Constructors at a nearby venue (TBC) – a chance to connect, reflect, and chat all things design and construction.\n🧡 Huge thanks to Studio of Pacific Architecture, Aoraki Construction, Maycroft Construction, and First Principles Constructors for teaming up to make this event possible.\nPlease note: NAWIC is a voluntary organisation, committed to its obligations as a PCBU under the Health and Safety at Work Act 2015.   Amongst other things, this requires NAWIC to take all practicable steps to eliminate, isolate or minimize hazards that our event attendees are exposed to. Health and safety is a shared responsibility.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Believe it Or Not Quiz Night!, Put your knowledge to the test at our \"Believe It or Not\" Quiz Night\n, hosted by Wellington’s best quiz master! Join us every week for an evening of fun, challenge, and unbeatable energy\n. Arrive early to make the most of Happy Hour from 4 PM to 6 PM\nwith great drink deals to kick things off. Gather your team, grab a drink, and see if you’ve got what it takes to claim victory\n! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "CUPRA 3-Day Demo Sale, Get ready for the CUPRA 3-Day Demo Sale! For three days only, explore our demonstrator and approved pre-owned CUPRA vehicles at exceptional prices.\nBrowse a selection of Formentor, Leon Sportstourer, Ateca, and more.\nSaturday only: Step into our racing simulator, feel the thrill, grab a Red Bull, and then take a CUPRA performance car for a test drive.\nMake Saturday extra special with simulator fun, Red Bull, and cake – it’s not your usual test drive!\nStock is limited and deals are only available while vehicles last – don’t miss your chance to drive away in a premium CUPRA.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Alimentary Trail Wellington EDITION, HIT THE ALIMENTARY TRAIL! It's a big ol' weekend in the Capital City, & while we can't be there in person, we WILL be there in 'beer' as our friends at Monkfish, LBQ & The Malthouse share new brews made right here. Keep an eye on their socials for time & availability! Cheers, everybody! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "RNZB Presents Open Ballet Class - Thursday's, This class is for students with knowledge of classical ballet and who can comfortably complete all elements of a ballet class including; pirouettes, adagio and jumps.\n\nThese classes offer flexible booking, and participants can sign up week to week or purchase a term pass.\nThe teacher will alternate every 4 weeks.\n\nPlease see FAQ's on our website for any questions https://rnzb.org.nz/for-dancers/adult-open-classes",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Pōneke Shanty Club sing-along at Welsh Dragon, Join us for two hours of sea shanty sing-along at Welsh Dragon. Music provided. All skill and experience levels welcome!\nListen to a playlist of favourite shanties and check out our songbook from our site: https://linktr.ee/ponekeshantyclub\nShanty Club meets every month on the 1st and 3rd Thursday. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Wellington Lens Club Fortnightly Meetup, Calling on all photography enthusiasts! Join us this Friday for another fortnightly meetup with the Wellington Lens Club! We gather every second Friday at Heyday Beer Co (264a Cuba Street) 5:30-7pm - if we meet else where it will be announced on the event discussion and in the group. We'll kick off this weeks event with drinks and engaging conversations about camera lenses. Photo walk begins 7pm until 8:30pm, followed by a delicious dinner from 8:30-10pm. This FREE event is open to everyone, especially those interested in vintage lenses and adapting them to modern cameras. Don't miss out! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "THWUP and the P is for Poetry, Te Herenga Waka University Press brings you an all-star line-up of poets at the Undercurrent for this year’s Phantom Billstickers National Poetry Day celebration.\nHosted by Always Becominging and including readings by: Nick Ascroft, Hinemoana Baker, Kate Camp, Leah Dodd, Sylvan Spring and Stacey Teague.\nFriday 22 August, 6pm\nThe Undercurrent, 118 Tory Street, Te Aro, Wellington\nFree event, all welcome\nCome through or the FOMO will come for you! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Saturday 'BAKES' By Onslow College, Each Saturday, we offer a variety of sourdough products next to Onslow College. We always have doughnuts, but on Saturdays we offer bread, savoury baked items (this Saturday, we have brioche), and mini-celebratory sourdough doughnuts.\nAll products can be pre-ordered and picked up on Saturday morning through our website.\nhttps://familykitchenwithmark.co.nz/weekly-menu/\nEFTPOS is always available.\nOur boxed mini-celebratory doughnuts, 70% of the original size, are available for a sale price of $25 for a box of all six flavours.\nOur regular doughnuts cost $6 each or $22 for a box of 4 doughnuts.\nWe also offer catering at Family Kitchen with Mark, so if you have a function or need for in-house dining, check out all our packages on our website. Our doughnuts are also available for purchase all week. Contact Mark on 021 0223 0824 for next-day pickup.\nhttps://familykitchenwithmark.co.nz/grazing-tables-theme.../\nAll our doughnuts contain a lively sourdough & biga starter, for a fuller flavour profile and a springy texture.\nHave you tried our sourdough doughnuts yet?\nOur doughnuts can be pre-ordered and picked up on the day to avoid disappointment (should we run out).\nWe launch a new flavour every two weeks and have created over 180 combinations since selling three years ago.\nSupport has been phenomenal, and we thank everyone so very much indeed for the weekly sales.\nIf you are not following us on our social media channels, please consider doing so, as it helps the company grow and increases the exposure of our products. Thank you.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Your City. Your Voice. – Ethnic Communities Forum 2025, Join us for Your City. Your Voice. – a community-led forum designed by and for Wellington’s ethnic communities.\nSaturday 23 August\nWellington Indian Association, 48 Kemp Street, Kilbirnie.\n2pm to 4pm\nDoors open from 1.30pm\nThis special event brings people together to kōrero about the issues that matter most in our neighbourhoods — and how we can shape the future of our city, together.\nWhat’s on?\nHousing – Updates and support\nCity Safety – Learn about new initiatives and share your ideas for safer neighbourhoods\nSmall Business – Hear about tips, tools and opportunities\nCity Revitalisation – Updates on upcoming major city projects and what they mean for our communities\nFamily-friendly\nDelicious kai provided to share and enjoy together.\nAll voices welcome\nThe capacity for this venue is 150 people, and the doors will close for entry once that capacity is reached.\nWhether you’re new to Wellington or a long-time local, we’d love to see you there.\nThis is a free event - No need to register — just show up, bring your whānau, and take part.\nBe heard. Be seen. Help shape Pōneke\nContact: Engagement@wcc.govt.nz for any questions\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "OPEN MIV - Vogelmorn Upstairs, Open Mic / Variety show night at Vogelmorn Upstairs\nStep into the spotlight and share your talent on the Upstairs stage.\nMusic, stand-up, poetry, storytelling, movement, experiments. If it's performable, it's welcome.\nNo genre too strange, no format too small.\nA vocal mic and simple PA will be provided, please bring along anything else you need to perform.\nBar open from 3pm, Happy hour from 3pm to 6pm, Open Mic from 5pm.\nSign-up on the night - all voices, styles, levels of experience etc welcome ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "FULLY BOOKED - Family Shiny - Akatarawa Forestt, Registrations open NOW\nWhat to expect\nThis is a “Family Shiny” trip into the Akatarawa Forest.\nNon members are welcome to join us but must register to obtain details of start time and location.\nVehicles must have a low ratio gearbox and must not be a 4wd car, station wagon or van, and if a soft top must have a roll cage.\nVisitor Registration- $20.00 per driver\nThere is no trip fee for this trip however non-members pay a “Day Membership Fee” of $20. This is payable in Cash to the Trip Leader on the day.\nThe trip should be relatively easy as it needs to cater for people just starting out and all types of 4wd vehicles – but a good way to see if you want to get into 4wding and a chance to meet some of our club members (if you are unsure if your vehicle is suitable just ask).\nNo Dogs Allowed sorry\nOnce you have completed 3 Family Shinys you can join the club but can only participate in Family Shiny or Touring Class trips. Once you have also done a Training Day and had your vehicle inspected by one of our approved inspectors you can come along on our other more adventurous trips. To find out more on how to join our club go to https://ccvcwellington.wildapricot.org/page-1725861.\nLike our Facebook page to find out about more trips and club nights. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Inaugural Professorial Lecture - Professor Jason Gurney, Lecture title \" Our promise to each other\". In this deeply personal lecture, Jason will guide us through his dual Pākehā and Māori upbringing, and the experiences that drew him into a career in public health. While sharing lessons from his career so far, he will walk us through the choices we could make – and promises we could keep – to bridge the divide in health and life outcomes experienced by Māori.’\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "How To Fringe - Artists Q and A, This is an introduction to registration and all things NZ Fringe Festival 2026 with NZ Fringe Director Vanessa Stacey and CCAT Chief Executive Kim Bailey.\nIf you have any burning questions about registering your upcoming event for next year's festival, we would love to hear all about it and see how we can help!\nWe look forward to meeting you if it’s your first time at NZ Fringe or seeing you again and hearing about what you’ve been cooking up for 2026. Come and celebrate 36 years of innovation and creativity at the Birthplace of Brilliance, the New Zealand Fringe Festival!\nWe look forward to seeing you in person on the 26th of August, on the second level at the bar at Te Auaha from 6pm ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Lawrence Arabia Is Playing A Solo Show, It’s been six years since he last released an album and, like Richard Prebble before him, Lawrence Arabia’s been thinking.\nWhen songwriters think, often the result is songs. It’s time to bring out some of these new thought babies from the writing suite and expose them to the light; let them photosynthesise and become real and alive in the world.\nThe Silver Scroll, Taite and Tūī winning artist brings his engaging show of (new and old) songs and talk, accompanied by guitar and keys, to Meow.\nWith support from Frances Grass. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "On Repeat: Hamilton Party - Wellington, I'M PAST PATIENTLY WAITING\n\nTICKETS ON SALE NOW!\nbit.ly/HAMwell\nHAMILTON: THE MUSICAL PARTY!\nSATURDAY AUGUST 30\nSAN FRAN\nWELLINGTON\nDOORS AT 9PM\n18+\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSinging Hamilton all night in a club? YES THANKS!!\nTake a Break and join us in The Room Where It Happens for a Hamilton tribute Party!\nYou’ll Be Back for more as DJs play songs from Hamilton + all your favourite show tunes from all the best musicals + all your Best of Both Worlds faves Non-Stop!\nWe Know you won’t be able to Say No to This so we recommend getting in quick for tickets if you want to be Satisfied!\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\n⭐︎\nSOUNDS LIKE:\nHamilton • Wicked • Six • Chicago • Waitress • In The Heights • Heathers • Rent • Hairspray • Grease • Les Miserables • tick, tick… BOOM! • Newsies • Spring Awakening • Dear Evan Hansen • The Book of Mormon • Sweeney Todd • Legally Blonde • The Phantom of the Opera • Mean Girls • Funny Girl • Little Shop of Horrors • West Side Story • Beauty and the Beast • The Sound of Music • Cats • The Addams Family • Company • Hadestown • Billy Elliot • The Prom • School of Rock • Cabaret • Dreamgirls • Shrek the Musical • Company • Hadestown • Billy Elliot• Annie • Come From Away • Merrily We Roll Along • Evita • Beetlejuice • Shucked • Kimberly Akimbo • Parade • Oklahoma • Moulin Rouge • Frozen • Matilda • Mamma Mia! • The Lion King • Rocky Horror Picture Show • Into The Woods • 13 • Aladdin • The Wizard of Oz + HEAPS MORE!\nThe Best of Both Worlds would like to acknowledge the traditional custodians of the land our events take place on and honour their Elders past and present.\nPlease read our company T&Cs carefully prior to purchasing your ticket - https://bit.ly/PurchaseTCs\nPlease note: Our events may feature moving and flashing lights. If you have photosensitivity or any related concerns, feel free to reach out to us with any questions! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Tuesday Thali Treat, Kia ora and Namasthe everyone\nJUGNU'S Little India Porirua\n042382555\n1D Mungavin Avenue Porirua\nTry our Thali Feast when you Dine in on\nMonday and Tuesday\nFor $30\n2 Mains\nRaitha\nStarter\npickle\nRice\nNaan or Roti\nKuchumber salad\n#foodie #restaurant #takeout #takeaway #fooddelivery #events #eventspace #indianfood #indianrestaurant #poriruacity #thali #indianfood #foodfest #LunchSpecial #lunchdeal ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Club Night - Fireside Chat with Mark and Gavin, it's all about the punt!, Ever wondered what’s really involved in lifting your chains, checking your blocks, and keeping your boat secure inside the harbour?\nCome along and hear Gavin and Mark share their knowledge — including Gavin’s tale of installing blocks for Revenue Cutter inside the boat harbour, and how a “mooring muscle boy” became a rocket!\nYou’ll learn:\nHow to inspect chains and spot potential issues\nWhy regular servicing (every 2 years) is the best protection in heavy winds\nThe story of the Punt — over 100 years old and still servicing moorings in Clyde Quay\nThe Mooring Punt isn’t a dark art — it’s a simple winch with rollers that does an important job. This is your chance to see how it works, ask questions, and even book a slot to have your mooring serviced so you can sleep well knowing your boat is secure. ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "2025 Mid Year Prize Giving, Hi everyone!\nCan’t wait to celebrate all of the leagues that have happened so far this year with prize-giving!!!\nThis is your chance to hang out, catch up with teammates and friends. Whether you’re a prize winner or just keen to socialise, everyone is welcome!\nPrize winners will receive bar vouchers to spend on the night (terms & conditions to come). So if you’ve snagged an award, make sure you're there to enjoy it!\nSorry under 18s, you’ll need a parent or guardian with you.\nCome along, grab a drink, and let's make the most of playing social frisbee\n",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Age of Sigmar @ Call to Arms 2025, It's a two day, 2,000 point Age of Sigmar event in Kilbirnie, Wellington!",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Toi Pōneke Market Lane Tours: CANCELLED, We’re excited to announce tours of the new Toi Pōneke whare at 3-6 Market Lane, Wellington. We will be occupying a portion of the building on the corner of Cable Street and Market Lane.\n\nBefore our new premises undergo a refit, we invite you to tour the interior of the building and see where the artist studios, arts offices and workshop space will be located.\n\nTours are available on Sat 30 Aug '25 at 11am, 12noon, 1pm and 2pm and Sun 31 Aug '25 at 10am, 11am, 12noon, and 1pm.\n\nThe re-imagined Toi Pōneke Moemoeā (Vision) is:\nHe kaiwhakatere i te tupu me te whanaketanga o ngā ringatoi o Te Whanganui-a-Tara\n\nA catalyst for the growth and development of Wellington artists\n\nOur new Toi Pōneke will create a vibrant space that nurtures collaboration, creativity and cultural exchange among artists of all generations using Tuakana-Teina Kaupapa. \n\nFor more information head to the Toi Pōneke website.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Sunday Social - August- Wave goodbye to Winter, SUNDAY SOCIAL SESSION 31 August 3-5pm\nWave goodbye to Winter. The August Sunday Social is on the last day of Winter. Come join us for another Sunday Session at - The Garden Room - 90 Ghuznee St. Behind St Peter's Church under the appartments on the corner of Victoria and Ghuznee St - from 3-5pm.\nAs usual there will be a mix of Lindy, Balboa and Blues we would love to see you. This is a child friendly, super relaxed and fun event for all – there will be music for everyone.\nSunday Social Session 31 August\n3-5pm\n$5 on the door\nLooking forward to dancing with you! ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Tough Guy Book Club - Lower Hutt NZ Chapter, Join us for the Lower Hutt NZ Chapter of Tough Guy Book Club.\nYou can find out this month's book here https://toughguybookclub.com/books\nIf you have the chance, try to pick up the book and read a couple of pages before the night. If you haven’t, come anyway, no one gives a damn. We are not your boss.\nIf you got one, make sure to bring your copy of the books down, it’ll help you talk about bits of it, we suggest underlining stuff that sticks out to you as important.\nAlso like all months, we will be announcing next month’s book at the meeting and handing them out to those of you who were wise enough to pre-order last month.\nSee you there.\nWant to know more about Tough Guy Book Club? Read this -\nhttp://toughguybookclub.com/about-us ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Compliance made SME-asy: Employment basics with ATH Consulting, Are you confident in navigating the complexities of employment relationships in today’s ever-changing workplace? Join us for a comprehensive workshop designed for managers, employers, and business owners who want to deepen their understanding of employment fundamentals and people management best practices.\nWhat You’ll Learn:\nFoundations of Employment Relationships:\nExplore the essential components that shape every employment relationship, including relevant legislation, terms and conditions, and the pivotal role of workplace policies and procedures.\nUnderstanding Employment Types:\nDistinguish between permanent, full-time, casual, and seasonal roles, and learn how each type impacts your obligations and management strategies.\nEmployment Legislation Essentials:\nGet a practical overview of the 10 key employment laws that influence your workplace, ensuring you stay compliant and informed.\nGood Faith and Agreements:\nDiscover the importance of acting in good faith and the differences between Individual Employment Agreements (IEA) and Collective Employment Agreements (CEA), including mandatory clauses and recommended “nice to have” terms.\nManaging Change:\nLearn best practices for handling variations to employment agreements and implementing effective workplace policies and procedures.\nPeople Management Mastery:\nGain insights into the employee lifecycle, building a strong employment brand, and managing common workplace issues such as performance improvement plans (PiP), disciplinary processes, attendance, and health and wellbeing.\nLeadership and Succession:\nIdentify the hallmarks of poor leadership and develop strategies for effective succession planning to future-proof your team.\nSupport Systems:\nKnow where to get help—learn when to trust your gut, when to rely on facts, and how to access the right support at the right time.\nThis workshop is your opportunity to build confidence, reduce risk, and enhance your leadership toolkit. Whether you’re new to managing people or looking to refresh your knowledge, you’ll leave with practical insights and actionable strategies for every stage of the employment relationship.\nDon’t miss this chance to strengthen your employment management skills and connect with peers facing similar challenges. Register now and take the next step toward becoming a more effective, knowledgeable, and resilient leader.\nWhen: Wednesday 10 September 9.00 am - 11.00 am\nWhere: Carterton Community Courthouse (next to Events Centre) Holloway Street, Carterton\nCost: Members $65 + GST, Non-Members $120 +GST\nThis workshop needs a minimum of 15 attendees to go ahead.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Tangihanga, Created and performed by Kristyl Neho\n\nTangihanga is a solo drama-comedy centred around Jess - a devoted daughter whose father, Karanipa, has passed away. As Jess’ whānau gathers at the marae to mourn, tensions rise, secrets are revealed, and long-held family dynamics begin to unravel. Neho masterfully embodies over 30 characters, capturing the complexity of grief, cultural identity, and the strength of whānau. This bold, emotionally charged, and often hilarious performance speaks to the heart of Aotearoa.\n\n“A graceful celebration of the power of theatre to create and tell a story.” - Tanya Piejus, Regional News\n\nAudience care: Contains themes of grief and loss. Recommended for audiences aged 9+.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "2025 World of Wearableart (wow) Show: Rise, Experience the extraordinary at the 2025 WOW Show: RISE, as a city comes alive in celebration of the creative spirit. Audience and show will together ignite the creative spirit that lives in all of us, as Aotearoa’s finest performers bring the world’s leading wearable art to life onstage. With WOW's internationally acclaimed creative team at the helm, don't miss this unforgettable spectacle of boundless imagination and jaw-dropping artistry.",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Social Animal, Created by Stephen Papps and Damon Andrews. Performed by Stephen Papps.\n\nYou can’t teach an old dog new tricks... can you? Biting satire and theatre wizardry fuse in a comically inventive roller-coaster about the fear of irrelevance and the healing power of an animal. Award-winning actor, writer, and solo performer, Stephen Papps, plays twelve characters with beguiling virtuosity, in this gloriously funny solo tour de force about a man who loses face in a desperate attempt to regain his relevance.\n\n“It’s impressive for a performer to embody a big range of characters ... well-written and full of humorous insights and revelations ... glorious!” – Cate Prestige, Theatreview.\n\nAudience care: Recommended for audiences aged 13+",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Lacuna Presents - Us Two tickets, Presented by: Lacuna\nUs Two is a high-energy house DJ act from the Midlands, UK, with releases on some of the world's most respected labels including Knee Deep In Sound, MicroHertz, and Eastenderz. Known for deep grooves, rolling basslines, and infectious crowd connection, Us Two has earned support from global heavyweights like Marco Carola, Jamie Jones, and Skream.\nFrom European festival stages to Ibiza's 528 for a standout set with Knee Deep In Sound, Us Two's sound blends underground credibility with dancefloor-ready energy.\nHis latest release, \"Simulation\" (featuring Franksy), drops on Pete Tong's TSZR label, and has already earned plays from tastemakers like ANOTR, SG Lewis, LF SYSTEM, and SOSA, with early reactions going wild at Music On (Pacha Ibiza) and beyond.\nFor Lacuna, hosting Us Two’s debut in Wellington is about more than a headline — it's personal. We're thrilled to finally bring a dear friend's sound to our city and invite you to feel the energy first-hand on Saturday, 20 September 2025, at Meow Nui.\nPackages",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Community Evening Trimester 2 2025, About Ignite:\nIgnite Consultants is a student-run charitable organisation that provides free and creative advice to charities and social organisations across Aotearoa. All of our consultants are passionate and talented student-volunteers who are driven by their desire to foster social change. Our vision is to help organisations to maximise their impact through harnessing the fresh perspectives of university students. \nWe run two project cycles per year which coincide with the university semesters, each lasting for a duration of 9 weeks. Each team consists of a local charity, 5-6 students, a project manager (a person who has been through the Ignite Consultants experience before) and a professional mentor who has experience in consulting and/or the industry the organisation works in. \nAbout the Event:\nIgnite's Community Evening is a special occasion where our consultants share what they have learnt, created and experienced over the past nine weeks. This event is an opportunity to learn about the remarkable charities we have collaborated with this semester, to enjoy delicious food and to extend our heartfelt thanks to all our supporters. \nThis semester, attendees will get to hear presentations from the teams who have worked with WELLfed, Take10, Orange Sky, PACE and The Charitable Recycling Trust. \nTo join us virtually, please click on the link below: ",
    "label": "Other"
  },
  {
    "new": true,
    "description": "Jonathan Crayford - Bikes in Space tickets, Presented by: Jonathan Crayford\nJonathan Crayford introduces his latest project 'Bikes In Space' an electronic vintage keys and drums driven fully improvised groove space junk ensemble that sounds like what it might be like to be in the brain of Philip K Dick, Ursula Le Guin or Margaret St Clair - except more. After a 2 month tour of Auckland, they hit Nui with added punch to the drums featuring Riki Pirihi and Julien Dyne.\nJonathan Crayford keys, Joe Kaptein keys, Riki Pirihi drums, Julien Dyne drums.",
    "label": "Other"
  }
]