[
  {
    "id": "Daily Keyno And Warm Regards-Valhalla, Wellington-Under The Radar",
    "name": "Daily Keyno And Warm Regards",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96957-217581.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-16-20:30"
    ],
    "displayDate": "Wed 16 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96957/Daily-Keyno-And-Warm-Regards.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Valhalla - 154 Vivian Street, Te Aro, Wellington present -\n\nDaily Keyno & Warm Regards performing on Wednesday the 16th of July.\n\nDOORS OPEN: 7.30pm\nWarm Regards: 8.30pm\nDaily Keyno: 9.30pm\n\nDaily Keyno, the brain child of Mark Sommerville, is proud to announce the release of their debut album, That’s my jc, available on all major streaming platforms starting September 25th..\n\nThat’s my jc is a personal project, featuring 8 tracks that explore themes of love, loneliness, fatherhood, past reflections. The album showcases Daily Keyno’s signature spacious, crystal like guitar, while pushing into new sonic territory.\n\nLead singles like Sunlight. Sugar and Peaches & Creme have already garnered critical acclaim, with Sunlight. Sugar was praised by Glen Thurston of Music, Movies & Madness as A lot of fun, a dreamy musical experience. The album also features the slick rhythm section of Riki Gooch, Jacqui Nyman, and Dayle Jellyman\n\nThis album is a reflection of where I am creatively and emotionally right now, says Sommerville. I wanted to make something sincere and sonically simple/minimal.\n\nLeading up to the release, Daily Keyno will be performing -\n\nJuly 16th - Valhalla, Te Whanganui a tara\n\nTracklist for That’s my jc:\n\n1. Ocean Blue\n2. My beautifully sad walk home\n3. Birth\n4. Days drag\n5. My love is shining\n6. Sunlight. Sugar\n7. Dayle on the record\n8. Peaches & Creme\n\nWarm Regards are a Te Whanganui-a-Tara based country dream-rock band.\n\nThey are great mates, and have over 150 years of experience playing in bands and being human beings.\n\nThey are super pumped to be playing with their friends Daily Keyno at Valhalla - it’s going to be a great night!!\n\nThey recently released this song. Listen to it!!\n\n⁦https://open.spotify.com/track/3Sg0WWWoBh8PKSGQ1HdE55?si=anjNyNvaRhqi0Z_eABeFbQ⁩"
  },
  {
    "id": "Dream Weavers - Free Live Music Wednesdays-MOON, Wellington-Under The Radar",
    "name": "Dream Weavers - Free Live Music Wednesdays",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97427-302961.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-16-18:30"
    ],
    "displayDate": "Wed 16 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97427/Dream-Weavers---Free-Live-Music-Wednesdays.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "When the sun goes down and the lights go on, it’s time for the Dream Weavers.\n\nBrian, Richard and Don weave melodies, rhythm and chords for dancing, listening and whatever else seems right for the night.\n\nVeteran members of different blues, rock, jazz and country bands, the boys blend their talents in their own new sound.\n\nExperience guitar, keyboard, percussion, vocal and ukulele magic by the light of the Moon"
  },
  {
    "id": "Diesel Jenny x Synthetic Children - 'Backroom Smooches' Tour-Valhalla, Wellington-Under The Radar",
    "name": "Diesel Jenny x Synthetic Children - 'Backroom Smooches' Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96617-523521.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-17-20:30"
    ],
    "displayDate": "Thu 17 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96617/Diesel-Jenny-x-Synthetic-Children---Backroom-Smooches-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Diesel Jenny and Synthetic Children announce ‘Backroom Smooches’ tour\n\nTwo of Aotearoa’s most rungle hardware acts are joining forces for a mid-winter tour across the country this July. Armed with new releases and a reckless lack of MIDI cables, longtime pals Synthetic Children and Diesel Jenny are packing gear into the whip for a trip up and down the motu.\nThe six-date tour will see the pair serve up their respective dishes in Ōtautahi, Ōtepoti, Tāmaki Makaurau, Pōneke, Te Papaioea, and Whanganui. Joined by local favourites, the tour will bring the sounds of provincial Aotearoa to the big smoke. To pair will also make a special stop in at the legendary Tūrangi dairy ‘Sanjay’s Selection’, to spin some tunes through the most bass boosted speakers in the Waikato.\n\nVia hardware synths and drum machines, Synthetic Children (Te Papaioea’s Celina Goacher) is bringing bubbly synths, auto-tuned vulnerabilities, and sub-rattling beats. Her latest Smooch EP, and appearance on the Big Fresh Collective’s Footmahi compilation, show an emerging fun side to her dancefloor arsenal, following the murky weight of 2023’s Everything’s Perpetual. Donnys worldwide have heralded the new release as a “freshly cooked 3 course meal, served up by Palmy’s premier snack pack herself”. Think wonky hyperpop with plenty of low end.\n\nDiesel Jenny’s (Pōneke’s Josh Finegan) live set will blend brain-breaking breaks with sugar-rush synths and 3D club energy years. This tour will celebrate the inaugural release of Diesel Jenny’s white label series with a rock-solid RUC-exempt two-tracker. With multiple releases on underground mainstays Big Fresh Collective and Bankrupt Records as ABG, this isn’t the first time Diesel Jenny’s revved the engine.\n\nDiesel Jenny and Synthetic Children ‘Backroom Smooches’ Tour:\n4 July – Ōtautahi – Flux* (with BWD)\n5 July – Ōtepoti – Yours (supports TBA)\n11 July - Tūrangi – Sanjay’s Selection (DJ sets b2b Skymning)\n12 July – Tāmaki Makaurau – Audio Foundation (with Baby Zionov)\n17 July – Pōneke – Valhalla (with Ekho Lahlia)\n18 July – Te Papaioea – Snails (with Club Tremaine, Cradle)\n19 July – Whanganui – Porridge Watson (with Alphabethead, Club Tremaine)\nTickets available from undertheradar.co.nz *Tickets from flicket.co.nz"
  },
  {
    "id": "Dads Army-The Undercurrent, Wellington-Under The Radar",
    "name": "Dads Army",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97105-919129.jpeg",
    "venue": "The Undercurrent, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-17-19:30"
    ],
    "displayDate": "Thu 17 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97105/Dads-Army.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The Dancing and Drinking Society presents DADS Army!\n\nDADS is New Zealand’s premier exponent of authentic 1920s dance Jazz. Featuring Rags, Rambles, Shuffles, Drags and Blues that our great grandparents would have shimmied to in the juke joints, speakeasies, woolsheds and Memorial Halls of 1920s New Zealand.\n\nDADS Army’s debut performance enlists Matt Enright, Adrien Jenson, Jack Harris on bass, Julian Kirgan and Damian Forlong on trombone, Jack Harre on trumpet, and Blair Latham on sax.\n\nDon’t miss out on this stellar line-up!\n\nThursday 17th July\nDoors at 7pm/ Gig at 7:30pm\nTickets $20\nAvailable at the door and online!\n\nWine/ beer/ hot drinks/ snacks and books available as always ;)\nWe can't wait to dance alongside you!\n\n#wellington #wellingtonmusic #nzjazz"
  },
  {
    "id": "The Superjesus With The After - Aotearoa Tour - July 2025-Meow, Wellington-Under The Radar",
    "name": "The Superjesus With The After - Aotearoa Tour - July 2025",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96999-281083.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-17-20:00"
    ],
    "displayDate": "Thu 17 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96999/The-Superjesus-With-The-After---Aotearoa-Tour----July-2025.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "TICKETS: https://meow.flicket.co.nz/\nTHE SUPERJESUS - A long career in the music industry is much of a rarity these days but Adelaide rockers The Superjesus have managed to hold their place as one of Australia’s most respected live bands for almost 30 years.\n\nEmerging in the late 90’s and signing to Warners worldwide they released 3 classic albums, Sumo, Jet Age and Rock Music, two of which went platinum. The 3 x Aria award winners took a hiatus in the mid 2000’s to work on solo projects and re-emerged in 2013 to test the waters. Pleased to have found themselves well received by the public they headed back into the studio for 2016’s EP Love And Violence followed by a double live album.\n\nThe South Australian Music Hall Of Fame inductees have a strong work ethic and an ear for a good hook. With hits such as ‘Gravity’ , ‘Secret Agent Man’, ‘Down Again’ & ‘Now And Then’ under their belt their songwriting has always remained their strong point. It has been 20 years since The Superjesus have released a full-length album of new music. In 2025 the band released their first self-titled album ‘The Superjesus’. After 30 years of crafting their sound, the songwriting partnership of Sarah McLeod & Stuart Rudd has truly found its sweet spot.\n\nRudd say’s “our writing partnership together has blossomed into a fantastic place to be creative. McLeod backed this up with “When you find a great creative writing partner, stick with it” From the opening bars of ‘Starlight’ we hear classic TSJ, tipping the hat to the 90’s sound they are known for while surging forward lyrically & melodically to create something really special.\n\nThis is the new Superjesus, a more soulful engaging version of the band we know and love where song writing is king. To date 5 singles have been released from the forthcoming self-titled album “Money (We’re Only In It For Love), ‘Lights Out’, ‘We Won’t Let Go Until It’s Over’, ‘Something Good’ & a cover of Generation X’s ‘Dancing With Myself’. All 5 singles have gained national airplay, setting the mood for this highly anticipated release.\n\nThey have kept the beautiful ballad ‘Diamonds’ to accompany the release. Here we see The Superjesus like never before, a beautiful emotive stirrer written on the piano showcasing how far the band has come musically, coupled with Sarah McLeod's classic rich vocals. The Superjesus are back stronger than ever and according to Rudd “not going anywhere anytime soon” . McLeod said “For us the magic is in the creation of the music & as a band we have found this process very soul enriching, I truly feel it’s our best work yet, I love every song on this record ”.\n\nSupporting TSJ on the NZ shows is NZ’s THE AFTER.\nThe After are a pop/rock band blending moody grooves, gritty guitars & soaring melodies into emotionally charged soundscapes. Already two massive Asia Pacific tours under their belt, a string of NZ tours, significant airplay & video successes; The After are a well-oiled live act with a fast-growing international reputation. At the helm is the magnetic Ruby Fraser, whose powerhouse vocals and searing guitar work channel raw emotion & rebellious spirit. Founding member Andrew Featherstone lays the groundwork on bass with tight, tasteful songwriting. Behind the kit, Gareth Scott delivers versatile, thunderous rhythms, while Bruce Madden—a true Hammond organ virtuoso—elevates the band’s sound with lush swells & soul-soaked textures rarely heard in modern pop/rock.\n\nSingles co-produced & mixed by Steve James (Screaming Jets, Sex Pistols), latest track “Mesmerised” mastered by Leon Zervos (INXS, AC/DC, Pink). • ‘Mesmerised’ radio & TV in NZ & the Philippines • ‘Clear to Me’ (feat. Split Enz legend Eddie Rayner) the most-played rock track NZ’s Juice TV in 2021, airing on 500 stations worldwide.• ‘Doesn’t Matter’ Radioscope Top 40 & a JUICE TV staple. • ‘Where There’s a Will, There’s a Way’ 600k views, video shot in Tokyo, Manila, Hong Kong, Singapore, & Auckland. • cover of Filipinos Dilaw’s hit “Uhaw” 500k views."
  },
  {
    "id": "The Oscar Garvie Quartet Plays Coltrane-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "The Oscar Garvie Quartet Plays Coltrane",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97184-455827.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-17-21:00"
    ],
    "displayDate": "Thu 17 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97184/The-Oscar-Garvie-Quartet-Plays-Coltrane.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Join us for a powerful evening of music celebrating the legacy of one of jazz’s most visionary artists — John Coltrane. From his soulful early ballads and hard bop classics to the boundary-pushing spiritual intensity of his later free jazz works, this performance traces the full arc of Coltrane’s musical journey.\n\n\n\nLed by drummer Oscar Garvie, the group is anchored by the expressive and deeply studied playing of saxophonist Isaac Randel, whose sound channels the fire and depth of Coltrane’s voice. Randel brings a commanding front-line presence and a profound connection to the material, making him the perfect interpreter of Coltrane’s vast and evolving musical language.\n\n\n\nThe band also features Jack Harris on bass and Tane Kelly on piano — a dynamic rhythm section that navigates the full emotional and sonic range of Coltrane’s music.\n\n\n\nTogether, this quartet dives into every era of Coltrane’s work — from the lyrical beauty of Naima and the modal mastery of Impressions, to the raw, transcendent fire of Ascension and Interstellar Space. This tribute isn’t just a look back — it’s a living, breathing expression of what Coltrane’s music still means\n\nMusic from 9pm, FREE ENTRY"
  },
  {
    "id": "Capital Carnage-MOON, Wellington-Under The Radar",
    "name": "Capital Carnage",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96622-545058.jpeg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-18-20:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96622/Capital-Carnage.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Lung, Paper Fortune, Electric Tapestry, Girl I Wanna Be at Moon Friday 18 July"
  },
  {
    "id": "Sigil Sound: Electric Sweat-Valhalla, Wellington-Under The Radar",
    "name": "Sigil Sound: Electric Sweat",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97120-615920.jpeg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-18-22:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97120/Sigil-Sound-Electric-Sweat.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Get your hydraulic press out!\n\nSigil presents: ELECTRIC SWEAT ⚡?\n\nThis historic genre is finally receiving the love it deserves at Valhalla, 18th July. Pioneered by legends such as Kraftwerk, Afrika Bambaata and Grandmaster Flash, Electro has taken countless forms since it's inception. We've curated a lineup of artists to explore and showcase a range of sounds with their roots in electro. Expect Ghettotech, Volt, Miami Bass, and both classic and modern Electro.\n\n$10 on UTR, link in bio!\n\nFeaturing:\n@its_jay.luv (Christchurch)\n@jason_o_c (vinyl set)\n@doobiedenize\n@nymph.loads\n@stacey.leeeee\n\nPoster by @stacey.leeeee x"
  },
  {
    "id": "Double Trouble: An Evening of Singer/Songwriter Duos-The Pow Wow Room, Wellington-Under The Radar",
    "name": "Double Trouble: An Evening of Singer/Songwriter Duos",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97256-451177.jpg",
    "venue": "The Pow Wow Room, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-18-20:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97256/Double-Trouble-An-Evening-of-SingerSongwriter-Duos.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Double, double, toil and trouble! Come seek refuge from the cold winter night as we get the fires burning and cauldrons bubbling at Pow Wow!\n\nYou'll be in for a night of the best duo acts that Wellington has to offer, with tunes ranging from hackneyed old favourites to cutting-edge originals. Get ready to sing, dance, drink and leave the bitter Wellington cold at the door!\n\nAbout our acts:\n\nPlaid Moon Rising:\nUVSH's own Wolf Truong joins longtime friend and talented singer/instrumentalist Daniela Butterfield to bring you Plaid Moon Rising, your friendly neighbourhood covers duo! Sit back and relax for some easy listening as these plaid-wearing nerds give you harmony-laden acoustic renditions of your favourite folk rock tunes. Featuring hits from music greats including Cat Stevens, Paul Simon, Credence Clearwater Revival and Fleetwood Mac, there's bound to be something for everyone!\n\nYellow Rooms:\nYellow Rooms are Pōneke based sister duo Sarah and Grace Lawrence. The sisters swap between the violin, guitar, keys and vocals on songs that are both soulful and witty. Look out for their new release ‘Cool’ in the coming months!\n\nThe Footnotes:\nThe Footnotes are Wellington’s first ever 4-piece band with only 2 members featuring the inimitable talents of local legends, Theo Sekeris (guitar and bass, simultaneously) and Vorn Colgan (accordion and drums, simultaneously). Demonstrably the best pound-for-pound party band in the land!"
  },
  {
    "id": "'Chemical' Acoustic Concert-Te Auaha, Wellington-Under The Radar",
    "name": "'Chemical' Acoustic Concert",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97299-469579.jpg",
    "venue": "Te Auaha, Wellington",
    "coordinates": {
      "lat": -41.2917461,
      "long": 174.7759294
    },
    "dates": [
      "2025-07-18-19:30"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97299/Chemical-Acoustic-Concert.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "In anticipation of the release of her next single, Emma Kate presents an intimate acoustic showcase of original music, stripping back previously released songs to share how they were first conceived.\n\nBio:\nEmma Kate is a confessional and open singer-songwriter who captivates listeners with her raw, heartfelt lyrics. Writing songs for the yearners, the existential dreamers, the hopeless romantics and those who love too deep; Emma Kate's music is a diary-shaped window into her most personal experiences. Relatable and authentic, she writes songs about everything; from crash-out moments to inevitable heartbreaks. Listeners can guarantee that her straight-to-the-point lyrics will hit them right in the heart - \"why'd you go and throw away the best thing that you ever had?\" (Invisible Broken Hearts).\n\nBeginning her songwriting journey at just 8 years old, Emma Kate blends catchy pop melodies with descriptive storytelling. A truly unique voice from New Zealand, she's only just getting started. Listeners should be ready (and excited) for her next chapter."
  },
  {
    "id": "Delaney Davidson Anniversary Tour-Meow, Wellington-Under The Radar",
    "name": "Delaney Davidson Anniversary Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/95506-472813.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-18-20:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/95506/Delaney-Davidson-Anniversary-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Banished Music proudly presents\nDelaney Davidson\nAnniversary Tour 2025, With Support From Hemi Hemingway\n\nWith multiple album Anniversaries this year, Delaney Davidson takes to the road in July to celebrate his extensive and star studded catalogue with special band The Anniversaries.\nGenerally dealing with the darker side of things, Delaney Davidson has been described as “being the reigning king of capturing the essence of “Noir” in Country and Folk Music, pushing at the framework and preconceptions of roots music with his brand of modern gothic Americana.” (Post to Wire).\nHaving spent the last 20 years as travelling “troubadour” around the globe, sometimes solo, sometimes with accomplices, but always with his Ghost Orchestra, Delaney Davidson has found new focus embracing a love of Aotearoa.\nThrough his collaborative work with Troy Kingi “ Black Sea, Golden Ladder”, his visual art work with Tame Iti, and his most current album “Out Of My Head” produced by Merk, he has featured such varied talents as Hayley Westenra and Reb Fountain and has toured with Chamber Music New Zealand - all the while continuing to reinvent concepts and challenge expectations, and gaining respect and admiration from audiences.\n“Incontestably one of Aotearoa’s most influential and lauded contemporary songwriters” Under The Radar\nDelaney Davidson now takes his band of Anniversaries on the local roads around Aotearoa, don’t miss a night of wry sense of humour, some theatre of unease, and a rocking collection of bangers from his extensive back catalogue as he celebrates the music that got him where he is today.\nPre-sale tickets – 9am, Friday 21 March\nGeneral tickets – 9am, Monday 24 March\nTickets from Banished Music\nSubscribe to presale at: www.banishedmusic.com/subscribe"
  },
  {
    "id": "Radioactive Fm | Live At Cuba Barbers With Don Luchito-Cuba barbers, Wellington-Under The Radar",
    "name": "Radioactive Fm | Live At Cuba Barbers With Don Luchito",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96960-613619.jpg",
    "venue": "Cuba barbers, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-18-10:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96960/Radioactive-Fm--Live-At-Cuba-Barbers-With-Don-Luchito.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Has your hair been feeling a little too long recently? Are you wondering where you should get a trim whilst also listening to live radio simultaneously?? On July 18th, get ready for The Amplifier Show with Don Luchito, airing LIVE from Cuba barbers!\n\nHead down to Cuba Barbers from 10am-1pm for some razor sharp tunes! Whether it's just a light Friday boogie, a short back and sides haircut or a chance to see Don Luchito in action (with the mixers, not the scissors!)"
  },
  {
    "id": "Monthly Jazz Night: Les Tripes - Parisian Swing Trio-Thistle Inn, Wellington-Under The Radar",
    "name": "Monthly Jazz Night: Les Tripes - Parisian Swing Trio",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97106-826048.jpg",
    "venue": "Thistle Inn, Wellington",
    "coordinates": {
      "lat": -41.2776965,
      "long": 174.7796332
    },
    "dates": [
      "2025-07-18-19:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97106/Monthly-Jazz-Night-Les-Tripes---Parisian-Swing-Trio.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Get ready for a night of irresistible rhythm and sizzling jazz!\n\nSwing clarinetist Oscar Lavën, guitarist Adrian Jensen, and double-bass raconteur Robert Henderson are Les Tripes (french for The Guts) ; a hard-working interpretation of the irresistibly heart-pumping film-noir sound of Django Reinhardt's Quintette du Hot Club de France. Lavën, Jensen and Henderson are professional musicians based in Wellington, and have honed their project through years of performance in venues large and small.\n\nLes Tripes will have you tapping your feet and swinging along as they infuse each performance with passion, precision, and a touch of French flair.\n\nDon’t miss the chance to experience a night of pure, swinging magic!"
  },
  {
    "id": "Jazz Orchestra Composer Series Presents: Dave Wilson-Bedlam And Squalor, Wellington-Under The Radar",
    "name": "Jazz Orchestra Composer Series Presents: Dave Wilson",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97156-253709.jpg",
    "venue": "Bedlam And Squalor, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-18-19:00"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97156/Jazz-Orchestra-Composer-Series-Presents-Dave-Wilson.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The next concert in our series presents a new project by Dave Wilson titled Free, Free: Meditations on Liberation. This project brings together a collective of musicians from across the music communities of Pōneke in an invitation to explore the expansive possibilities for what liberation might sound like.\n\nFree, Free draws from legacies of musical collectivity, and celebrates a commitment to both collaboration and the distinct expression of each individual.\n\nRanging from contemplative minimalism to ecstatic ensemble energy and body-moving grooves, the music of Free, Free invites musicians and other listeners to tend to each moment, making their own offerings to shape the collective sound.\n\nDave Wilson is a saxophonist, clarinettist, composer, producer, and interdisciplinary scholar. His music bridges avant-garde and experimental music with various groove-oriented styles from the worlds of jazz, R&B, electronic music, and more. With his 2023 album Ephemeral, described as “quite spiritually intense music” by The Guardian, he was a finalist for Te Manu Taki Tautito o te Tau | Best Jazz Artist at the Aotearoa Music Awards, and for the APRA Best Jazz Composition Award. Before relocating to Te Whanganui-a-Tara Wellington in 2016, Dave grew up in the Chicago area, lived for a decade in Los Angeles, and spent several stints living in Skopje, North Macedonia.\n\nFree, Free: Meditations on Liberation\nDave Wilson, Tyaan Singh – alto saxophone\nLouisa Williamson – tenor saxophone\nMonique Lapins, Mana Waiariki – violin\nKen Ichinose – cello\nKaito Walley, Natania Ngawhau – trombone\nBen Hunt – trumpet\nDaniel Hayles, Andrew Faleatua – piano and keyboard\nPhoebe Johnson – bass\nCallum Allardice – guitar\nHikurangi Schaverien-Kaa – drums\n\nThe performance will begin with an opening set by Flute Journeys, an offbeat mass flute ensemble with the self-described playing abilities of 5–12-year-olds, embodying a form of liberation in music.\n\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15, door sales $20.\n\nThanks to CNZ for their generous support. See less"
  },
  {
    "id": "Strawb Fest - Free Festival!-Underworld Tavern, Wellington-Under The Radar",
    "name": "Strawb Fest - Free Festival!",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97179-305447.jpg",
    "venue": "Underworld Tavern, Wellington",
    "coordinates": {
      "lat": -41.2972108,
      "long": 174.7828717
    },
    "dates": [
      "2025-07-18-18:30"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97179/Strawb-Fest---Free-Festival!.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Strawb Fest is a free festival having its debut at Underworld Tavern on the 18th of July!\n\nPromoted by Strawberry Jam Promotions, this is the first event here in Poneke, and we're off with a bang. Some of Poneke's best up-and-coming local talent under one roof, for one free festival. With everything from Acoustic Folk, Pop, to Metal and Rock. This multi-genre event is not one to miss!\n\nFriday - July 18th - 7 Bands - No Charge\n\nDOORS: 6:00 pm\n\nSKRAM\nLipstick\nLucy Summerfield\nCian\nDreams Of The Damned\nFLOODGATE\nThe B.U.Ms\n\nSET TIMES\nLucy Summerfield - 6:30 pm\nCian - 7:15 pm\nFLOODGATE - 8:00 pm\nThe B.U.Ms - 8:45 pm\nDreams Of The Damned - 9:30 pm\nLipstick - 10:15 pm\nSkram - 11:00 pm\n\nNO TICKETS NEEDED - (Venue capacity may be reached, which could lead to wait times to get in)\n\nGet amongst Welly!!\n\nPlease note:\nThis is an R18 event at a fully licensed venue.\nPlease bring your ID for entry and service at the bar."
  },
  {
    "id": "Carmichael-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Carmichael",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97181-75537.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-18-21:30"
    ],
    "displayDate": "Fri 18 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97181/Carmichael.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Carmichael is back with a free gig! and you know what that means... it means you better get ready to dance! Revived and better than ever, this Pōneke based band blends rhythmic sounds of voice, horns, rhythm and bass to get you up and moving. We commence on Friday, 18th of July so tell your friends and bring your mothers - join us in the groove.\n\nMusic from 9:30, FREE ENTRY"
  },
  {
    "id": "The Dark Eighties Dance Party: Valhalla Debut!-Valhalla, Wellington-Under The Radar",
    "name": "The Dark Eighties Dance Party: Valhalla Debut!",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/95755-109844.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-19-22:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/95755/The-Dark-Eighties-Dance-Party--Valhalla-Debut!.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "THE DARK EIGHTIES CULT 80S HITS DANCE PARTY: VALHALLA DEBUT!\n\nNOW AT OUR NU SPOT, VALHALLA!!!\nSATURDAY, JULY 19TH 2025\n\nThe Dark Eighties DJs KAILEE RAVEN (WELLINGON/AUCKLAND) + PENNIE RAVEN BLACK (AUCKLAND/Director @concordpubanz Host of The Monday 1-4 & ‘Fashun’ on 95bFM) playing\n\nGOTH\nPOST PUNK\nNEW ROMANTICS\nEBM\nINDUSTRIAL\nDARK + COLD WAVE\nMINIMAL WAVE\nCULT 80S HITS\nSYNTH POP\nDARK HITS\n+ a few modern dark tunes thrown in for good measure\n\n***Get done up, it's more fun!***\n\nAlthough there is no dress code, we strongly encouraged getting dressed up for your big night out! Big hair, hairspray, loads of 80s style make up, deathrock/batcave style looks, leather, heels, buckles, jewelery, studs, lace, fishnets, eyeliner, black, big boots, Bowie style + new romantics outfits all encouraged! But dress how you feel best! There are no rules about clothing ?\n\n10:30PM-2AM\nVALHALLA\n\n18+\n\n154 Vivian Street, Te Aro, Wellington 6011, New Zealand\n\nhttps://www.facebook.com/thedarkeighties\nhttps://www.instagram.com/thedarkeighties\nhttps://twitter.com/thedark80s\nhttps://www.facebook.com/groups/680758361998881\nhttps://www.twitch.tv/thedarkeighties EVERY MONDAY 7pm PST"
  },
  {
    "id": "The Wooden Box Band Broken River Album Release-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "The Wooden Box Band Broken River Album Release",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96798-115427.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-19-19:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96798/The-Wooden-Box-Band-Broken-River-Album-Release.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Join the Wooden Box Band to celebrate the launch of their latest album Broken River.\nRecorded under the expert guidance of Lee Prebble at the Surgery in Newtown.\n\nWritten over the course of several years, the songs of Broken River tell stories of turbulence, change, immense loss and hope. They remind us to commune with our natural world and to remain steadfast in our commitments to each other.\n\nCome together, join us in music. A salve to thrive in these confounding times, and to build the community we need.\n\nDoors open at 7pm, music from 7:30pm"
  },
  {
    "id": "Harvest Moon - 19 July-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "Harvest Moon - 19 July",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96916-34482.jpg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-19-19:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96916/Harvest-Moon---19-July.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Gate opens 6.30pm Music Starts 7pm Saturday 19 July 2025\nAmericana and Country music band Harvest Moon feature a dazzling array of instruments including pedal steel, mandolin, guitars, banjo, accordion, and dobro, playing a diverse collection of classics from legends like Johnny Cash, John Prine, Dwight Yoakam, and Neil Young. The Wellington-based band’s front-man, lead vocalist Rob Reid provides a powerful and smooth singing style. Founding member & multi instrumentalist Garrett Evans plays pedal steel, dobro, guitars and sings vocals too. Dave Allen is Harvest Moon’s lead guitarist and banjo player - he also plays in Salty Hearts, and Hogsnort Bulldogs Goodtime Show. Another original member, Wayne Mills plays keys, accordion, bass and sings. A veteran of NZ’s vibrant 60s and 70s music scene, bassist Frits Stigter brings a wealth of experience and groove. On percussion - Robert Antonio is another well-known personality in the close-knit Wellington musical scene.\nCome along to this special space and enjoy these guys playing up close and personal.\nNot for profit, supporting our dedicated musicians. Suggested donation $40\nPlease reserve a seat via the Hilltop website.\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "My Pleasure By Bri Louise w/ Tui The Band And John Paul Jr.-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "My Pleasure By Bri Louise w/ Tui The Band And John Paul Jr.",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97029-289105.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-19-21:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97029/My-Pleasure-By-Bri-Louise-w-Tui-The-Band-And-John-Paul-Jr.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "It is My Pleasure to invite you to a Bri Louise single release event for their new single “My Pleasure.” on the 19th of July starting at 9:30pm at The Rogue and Vagabond.\n\nBri Louise band consists of Bri Louise (vocal/keys), Molly Wyatt (flute/vocals), Becky Devine (bass), Theo Thompson (guitar), Eloise Edmond (Saxophone) and Ateo Buhne (drums). Bri Louise's band blends sultry queer R&B with smooth jazz and undeniable groove. Bri’s sound has roots in Gospel and Neo-Soul, evolving into a rich fusion of Jazz, Hip-Hop, R&B.\n\nSupporting acts:\n\nTui the Band - a three piece Hi-Tek reggae band consisting of bassist Becky Devine, drummer Harper Champion and vocalist/guitarist Harry Young. The band merges electronic explorations with reggae making a unique experience spanning the many dialects of dub music. Echo drenched skanks meet heavy basslines and repetitive drum grooves that are bound to make you dance slow, low and easy!\n\nJohn Paul Jr. - a DJ, musician, and producer from Te Whanganui-a-Tara. Drawing from soulful underground sounds, he fuses the warmth of boogie, jazz dance, rare disco, dub, and global rhythms with deep, percussive energy built for the dancers."
  },
  {
    "id": "Polar Extremes Album Release w. Bottom Bunk Club + The Rugs-MOON, Wellington-Under The Radar",
    "name": "Polar Extremes Album Release w. Bottom Bunk Club + The Rugs",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97127-753228.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-19-20:30"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97127/Polar-Extremes-Album-Release-w-Bottom-Bunk-Club--The-Rugs.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Polar Extremes is the sci-fi infused, post-modern satirical, apocalyptic musical endeavour of Auckland based creative Quaint.\nShrouded in mystery, Quaint was purposefully restrained in online presence, but has been a driving force in New Zealand’s underground scene since the 1990s, when eclectic performances across Wellington, and the songwriting of his debut record STRANGE VISIONS 1, began.\nThe first installment of a swirling trilogy detailing the apocalypse, STRANGE VISIONS 1 briefly emerged in 2019 and caught the eye of NZ music critics such as Graham Reid, who described the work as “fun, surreal, clever, fantasy-full, adultly childish (and vice-versa).”\nIn 2025, with the musical world-building of Polar Extremes as relevant as ever, STRANGE VISIONS 1 has re-emerged for an official release via digital streaming platforms.\nThe self-produced, mixed and mastered 12-track record paints a surreal scene for an uncertain future, but all signs point to Quaint nearing the completion of his fanciful trilogy. When? No-one knows!\n**This event also features the multi-faceted talents of 'Bottom Bunk Club' and 'The Rugs'\n***Doors will open by 8pm, and the performances will commence soon after!"
  },
  {
    "id": "Cumbia Blazera-Abandoned Taproom Petone, Petone, Wellington-Under The Radar",
    "name": "Cumbia Blazera",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96321-182830.jpg",
    "venue": "Abandoned Taproom Petone, Petone, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-19-20:00"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96321/Cumbia-Blazera.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Cumbia Blazera are bringing our football-infused cumbia dance music to Abandoned for your dancing pleasure! A beautiful blend of originals, cumbia covers, and kiwi popular cumbia-fied covers!\n\nIf you've seen us at Newtown Festival, Cuba Dupa, or Rogue & Vagabond gigs you'll know the deal.\nBring your friends! Pre-sales $20 at humanitix, or $25 on the door"
  },
  {
    "id": "Towers Of Flints, Underwire-Valhalla, Wellington-Under The Radar",
    "name": "Towers Of Flints, Underwire",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97146-333197.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-19-01:01"
    ],
    "displayDate": "Sat 19 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97146/Towers-Of-Flints-Underwire.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Post-Punk Indie-Rock Wellingtonians Tower of Flints are joined by the mighty Underwire at Valhalla for a night of kick-ass original music with serious attitude!\n\nDoors open early, with Underwire taking the stage at 8pm and Tower Of Flints at 9pm.\n\nThe night will be completed with the Dark 80s Disco (tickets sold separately.) A discount will be given to anyone with pre-sales for the Dark 80s Disco.\n\nDOORS AT 7:30 - TICKETS $15 (or $10 with a Dark 80's presale)"
  },
  {
    "id": "The Tempests - 20 July-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "The Tempests - 20 July",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96917-908350.jpg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-20-19:00"
    ],
    "displayDate": "Sun 20 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96917/The-Tempests---20-July.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Gate opens 2.30pm Music Starts 3pm Sunday 20 July 2025\nLynley Christoffersen and Jade Eru weave a vocal magic that can only come from years of singing together. They have lent their sweet soulful harmonies to many artists around Aotearoa, (including Wayne Mason, Darren Watson, Pip Paynes Gospel project) and are currently touring with The Fleetwood Mac Experience.\nWe celebrate the release of their original EP, The Tempests, which brings their vocal blend to the fore. They will be performing with their incredible band of musical maestros- Chris Armour and Rob Matthews, (guitars), Miklin Halstead (bass) and Richard te One (drums). Joined by their dear friend Hamish Graham (Hobnail, Shot band, & Milkthistle) who opens their set with his lush and lively, beautifully crafted original songs.\nNot for profit, supporting our dedicated musicians. Suggested donation $30\nPlease reserve a seat via the Hilltop website.\nCome along and enjoy their gig up close and personal in our special space.\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Songwriter Showcase #104-MOON, Wellington-Under The Radar",
    "name": "Songwriter Showcase #104",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97117-581721.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-20-18:30"
    ],
    "displayDate": "Sun 20 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97117/Songwriter-Showcase-104.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Songwriter Showcase presents showcase #104, Sun July 20th at Moon bar in Newtown.\n\nEvery month we showcase four local songwriters and celebrate the rich culture and depth of talent we have here in Aotearoa.\n\nThis month we present our big busy Midwinter Massive, four great acts.. The Overdogs, The Kingston High All Stars, Buffalo Buffalo Buffalo and Janet Muggeridge and Dave Murphy.\n\n\nThe Overdogs\nLiterate ballads and breezy Americana. Hoe-down stompers on request.\nWellington combo The Overdogs have been playing round the city since 2016. Fronted by poet and songwriter John Newton, with clarinet and fiddle twins Andy Horwood and Jude Douglas, Tony Paine on bass and Liam Prince on drums. Expect dynamic playing and an easy-going vibe, thoughtful tear-in-your-craft-beer ballads and up-tempo country wig-outs.\n\n\nKingston High All Stars\nPoneke based band weaving the sounds of Sahara Blues, 60s psychedelia and Traditional middle eastern music to create a tapestry of sound to transport listeners to far flung places and times.\n\n\nBuffaloBuffaloBuffalo\nMorphed from a project set up 2 years ago, a herd of instrument addicts with an EP imminent. Buffalo-pop-rock, whimsical, catchy, playful. Songs of road trips, relationships and reality tv.\n\n\nJanet Muggeridge and Dave Murphy.\nWhen Taranaki’s premier folk mandolinist and habitual jammer teamed up with Wellington blues legend Dave Murphy a number of years ago, they created a unique sound.\nAt Moon they will present their original songs that have been arranged to showcase their musical strengths. Expect songs from Dave’s time touring on the road, a blues or two, songs about trains, places in Taranaki that are important to Janet."
  },
  {
    "id": "Moon Jam Nite-MOON, Wellington-Under The Radar",
    "name": "Moon Jam Nite",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97022-237037.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-22-19:30"
    ],
    "displayDate": "Tue 22 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97022/Moon-Jam-Nite.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Get your 15 minutes of fame at Newtown's famous Moon Jam Nite, every Tuesday from 7.30pm\n\nThe evening starts off as a regular open mic, and transforms into a full on jam towards the end.\n\nPut your moniker into the sign up sheet, and own your time slot. You can call upon the many talented muso's available to help you play your slot.\n\nA full stage with electric guitar, bass, keyboard, drums, mics, lights and full support from our sound tech.\n\nBring your own songs, poems, and friends (and make some new ones too)\n\nCome along for dinner, drink specials & enjoy the show!"
  },
  {
    "id": "Kult Presents: Act 1-Valhalla, Wellington-Under The Radar",
    "name": "Kult Presents: Act 1",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97137-617677.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-23-01:01"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97137/Kult-Presents-Act-1.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "KULT – ACT I\n\nEnter in the shadows and feel the groove\nThis is the first of three KULT events taking place this winter in Wellington, NZ.\nEach party will dive into the underground — new artists, evolving sounds and deep energy.\nKULT is a tribute to electronic music, a night where local techno artists meet the raw energy of Europe’s rave culture, and where we could all celebrate what matters.\nKULT is more than a party – it's a moment of sharing, an underground techno experience built on freedom, inclusivity, and the love for music.\nJoin a team where judgment doesn’t exist, the passion of techno music never stops.\n\nLINE UP\n7-8pm : Open decks\n8-9pm : Doitz\n9-10pm : Jacquart\n10-11pm : U-day\nClose\n\nTucked away in the heart of Wellington, Valhalla Tavern is more than just a venue — with its moody lighting, industrial atmosphere, and a history steeped in alternative music culture, Valhalla offers the raw, authentic vibe that Kult needed for his first edition.\nUnderground vibes, all night long\n\nThis is KULT.\nFollow us on :\nInstagram link : https://www.instagram.com/kult_event/\nTikTok link : https://www.tiktok.com/@kultevent"
  },
  {
    "id": "Milly Moon - Free Live Music Wednesdays-MOON, Wellington-Under The Radar",
    "name": "Milly Moon - Free Live Music Wednesdays",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97426-173542.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-23-19:00"
    ],
    "displayDate": "Wed 23 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97426/Milly-Moon---Free-Live-Music-Wednesdays.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "A vocalist known for remarkable range and diversity, Moon’s joyful veneration for unadorned song is captivating. Her rich melody, storytelling and seamless weaving of prose, inspiring intimate, rare and darkly explosive performances.\n\nMusic from 7pm, $15 pizzas 5.30-9"
  },
  {
    "id": "The Bigboyband-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "The Bigboyband",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96755-490947.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-24-21:00"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96755/The-Bigboyband.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Are you cold and miserable and tired and frumpy inside your damp and lonely hovels? Here's a better idea: be warm and happy and energised and uplifted inside the Rogue and Vagabond!\n\nEveryone's favourite band of absolute sweethearts the BigBoyBand are back once again to bring warmth and joy and music with: Winter Wonderland. A full 15-piece big band with featured special guests are playing brand-new arrangements of your favourite snow-falling, up-by-the-fire-cozying, sled-riding, cold weather songs. Fun! Uplifting! Heartwarming! There's gonna be snow inside (just kidding)! And as always, bandleader Seth Boy has special fun secret super cool twists gimmicks activities up his sleeve, come to the Rogue on Thursday the 24th of July 9pm to find out : )\n\n$10 online / $15 door sales / + raffle tix maybe? or something like that?\n\nMusic from 9pm"
  },
  {
    "id": "Dillon Jo w/ Sol Fide and Jayme Morpeth-Valhalla, Wellington-Under The Radar",
    "name": "Dillon Jo w/ Sol Fide and Jayme Morpeth",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96969-344294.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-24-20:30"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96969/Dillon-Jo-w-Sol-Fide-and-Jayme-Morpeth.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Dillon Jo headlining show with support from Sol Fide and Jayme Morpeth at Valhalla on the 24th of July."
  },
  {
    "id": "Ollie Bunnie (debut) | Edera | Menzies (solo)-San Fran, Wellington-Under The Radar",
    "name": "Ollie Bunnie (debut) | Edera | Menzies (solo)",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97252-173257.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-07-24-20:00"
    ],
    "displayDate": "Thu 24 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97252/Ollie-Bunnie-debut--Edera--Menzies-solo.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Following months of writing, rehearsing, Ollie Bunnie announces their debut show at Sanfran with Edera and Menzies! Thursday, 24th of July. with a line up of ecstatic performances, lyrical prowess and bloody rock’n roll, This will be a goodie for sure.\n\nMenzies:\nMenzies make twisted alt-country straight from the heart. Catch a very special Menzies solo performance.\n\nEdera:\nEdera is a melancholy girly who hates how she's perceived. With lyrics so romantic yet callous, Ederacore is music for people who wear black on the beach.\n\nOllie Bunnie:\nOllie bunnie is finally ready with a strong 4 piece crew of his closest homies (Marcus Lawrence, Chris Simpson & Alex Martin). Creating a set filled with fast, hot, heavy, personal and alternative rock tunes for their one time only DEBUT show.\n\nTickets are available for $15 via Moshtix, $20 door sales available. Doors open at 7:30pm sharp! Don’t Miss out on another wicked show at Sanfran!"
  },
  {
    "id": "Anthony Donaldson - Master Drummer - Night 1-Pyramid Club, Wellington-Under The Radar",
    "name": "Anthony Donaldson - Master Drummer - Night 1",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96993-938044.jpg",
    "venue": "Pyramid Club, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-25-01:01"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96993/Anthony-Donaldson---Master-Drummer---Night-1.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Anthony Donaldson is one of this country's great drummers a pioneer of improvised music in Aotearoa. A visual artist before becoming a musician, Anthony's starting point on the drums was in finding tonal colours, rhythms that come from nature, and constructing a drum kit that grew like a living sculpture, Beginning in the late 70s and early 80s with Primitive Art Group, his music making has always centred on free improvisation and collective composition. His musical journey has seen him perform with countless ensembles, often of his own creation, including the Black Sheep, Six Volts, Razorblades, Mean Bones, Flower Orphans, Teeth, Devils Gate Outfit, Rubbernecks, Farewell Spit, Melancholy Babes and the Stinging Nettles. He has been a creative force in Wellington music for over four decades and continues to push the boundaries of accepted musical norms, while encouraging and mentoring younger players.\n\nPyramid Club is very happy to host Anthony for two nights, performing solo and in collaboration with a large number of outstanding musicians. Gifted with a sparkling musical imagination, alongside his drum kit Anthony will be performing with electronics, 78rpm phonograph player, assorted percussion and spoken word.\n\nFor the first of his two night performance residency Anthony will be performing solo and in collaboration with:\ntrio with Nell Thomas (electronics) / David Long (guitar)\ntrio with David Donaldson (bass banjo) / Steve Roche (brass)\ntrio with Jonny Marks (Synthi AKS) / Daniel Beban (reel-to-reel)\n\nListen here to a recent Dancing in Your Head podcast featuring Anthony playing some of his own music and tracks which he's been listening to.\n\nAnd to his feature on RNZ's Mixtape a few years back\n\n- - - - - - - -\n\nPresale tickets for Night 1 $20\nPresale tickets for Night 2 $20\nPresales for a two-night pass $30\n\nRāmere 25th July\nsolo\ntrio with Nell Thomas (electronics) / David Long (guitar)\ntrio with David Donaldson (bass banjo) / Steve Roche (brass)\ntrio with Jonny Marks (Synthi AKS) / Daniel Beban (reel-to-reel)\n\nRāhoroi 26th July\nduo with Riki Gooch (taonga pūoro/electronics)\nduo with Alphabethead (turntables)\nquartet with Bridget Kelly (reeds) / Toby Laing (trumpet/keys) / Tom Callwood (bass)\n\nSpecial thanks to Creative NZ for supporting Pyramid Club's programme."
  },
  {
    "id": "The Bebop Brigade-The Undercurrent, Wellington-Under The Radar",
    "name": "The Bebop Brigade",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97090-613276.jpeg",
    "venue": "The Undercurrent, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-25-19:30"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97090/The-Bebop-Brigade.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Burning tempo? Cymbal crash? Call the Bebop Brigade!\n\nThis hot new quintet is equipped with all the finest bebop tunes from the 40s and 50s and is ready to go at a moment's notice. They will play a range of songs, from Charlie Parker classics to underground tunes by Lou Donaldson and Fats Navarro.\n\nAppearing for the first time at the Undercurrent, the band is excited to present a new set of rare tunes and bop classics. Expect exhilarating swing, gorgeous ballads, and intricate melodies. Come along for an exciting night of music, relax on a comfortable chair, and join us as we explore these iconic tunes.\n\nPersonnel:\nAlex Trask - alto saxophone\nMichael Costeloe - trumpet\nLockie Bennett - guitar\nElijah Mulheron - bass\nMark Lockett - drums\n\nFriday 25th July\nDoors 7pm/ Gig 7:30pm\n$20\nTickets available on the door and online!"
  },
  {
    "id": "Radar Angel | The Blue Summer | Sighthound-Underworld, Valhalla, Wellington-Under The Radar",
    "name": "Radar Angel | The Blue Summer | Sighthound",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97359-590512.jpg",
    "venue": "Underworld, Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-25-20:30"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97359/Radar-Angel--The-Blue-Summer--Sighthound.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An evening of music for the restless, romantic, and rebellious.\n\nRadar Angel are a four-piece synthfoolery ensemble who blend industrial grit with lush nostalgic sounds from the dawn of the digital age, all with a lavish theatricality and pop sensibility that is guaranteed to get your limbs thrashing.\n\nThe Blue Summer are a five-piece surrounding themselves with wisps of funk, post punk, alternative rock, and pop. Like a wave crashing upon the rocks, chaotic and multi-faceted, only to pull back exposing the calm of the depths below. Gracefully twisting and changing shape from ballads to bangers.\n\nFeaturing members of Murgatroyd and Opium Eater, Sighthound comes from a pedigree of noise makers. Blending trip hop, lush atmospheres and harsh noise, Sighthound promise a truly unique experience from two proficient maniacs.\n\nTickets: $10 + booking fee through UTR\n$15 on door."
  },
  {
    "id": "Jonathan Crayford Presents: Bikes In Space-Meow Nui, Wellington-Under The Radar",
    "name": "Jonathan Crayford Presents: Bikes In Space",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96883-143806.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-25-01:01"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96883/Jonathan-Crayford-Presents-Bikes-In-Space.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Jonathan Crayford introduces his latest project 'Bikes In Space' an electronic vintage keys and drums driven fully improvised groove space junk ensemble that sounds like what it might be like to be in the brain of Philip K Dick, Ursula Le Guin or Margaret St Clair - except more. After a 2 month tour of Auckland, they hit Nui with added punch to the drums featuring Riki Pirihi and Julien Dyne.\n\nJonathan Crayford keys, Joe Kaptein keys, Riki Pirihi drums, Julien Dyne drums.\n\nTickets from Ticketek."
  },
  {
    "id": "Good Luck Returns!-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Good Luck Returns!",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97200-698095.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-25-21:30"
    ],
    "displayDate": "Fri 25 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97200/Good-Luck-Returns!.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "We are back for round 2, exclusively making music to make you move. Good Luck, lead by Mads Taylor (Tahini Bikini) and Lee Stuart (Lee Stuart) is a double vocal lead 8 piece band once again bringing our disco house inspired beats live to the Rogue & Vagabond stage. Mark your calendars and set your reminders to loud cause you won’t want to miss out on this night!\n\nKoha entry!\n\nVocals - Lee Stuart\nVocals - Mads Taylor\nGuitar - Alex Esbee\nKeys - Aidan McCulloch\nBass - Seth Boy\nPrecision - Eric Sebastian\nDrums - Ryder Smith\nTrumpet - Robbo\n\nMusic from 9:30pm"
  },
  {
    "id": "Interlopers-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "Interlopers",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96862-463385.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-20:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96862/Interlopers.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Interlopers will stand out at Vogelmorn Upstairs on July 26th, but we're sure they'll fit right into this gorgeous venue's shagpile vibe.\n\nFollowing a memorable city debut at the Undercurrent, the quartet return with their fully-formed set of acoustic indie pop songs and stories. And tickets are priced like a bottle of bachelor wine!\n\nInterlopers are based around the long-gestating songbook of Andrew Armitage and mellifluous cello and vocals of Sarah Laing, backed by the solid sync of Phil Peleton on bass and David Morgan on percussion.\n\nMr. Morgan described their drummer-less incarnation as 'The Front Lawn' meets 'Violent Femmes' so they had no choice but to let him join. A few post-punk covers are thrown in for good measure, but their focus is on time-honoured song craft with a good measure of wit and wisdom.\n\nInterlopers are as yet unrecorded, but you can check out their little live music video of 'Bachelor Wine' for a wee taster..."
  },
  {
    "id": "Albi/Chris Dent & Hannah Morrell - 26 July-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "Albi/Chris Dent & Hannah Morrell - 26 July",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96918-2123.jpeg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-19:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96918/AlbiChris-Dent--Hannah-Morrell---26-July.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Gate opens 6.30pm Music Starts 7pm Saturday 26 July 2025\nAuckland based Albi/Chris Dent is an earthy songwriter who keeps both feet on the ground while being expressive and heartfelt in his stories and music.\nHis appearance is striking as he wields his albinism with pride in the form of a big white beard. His voice too isn’t quite what you’d expect. More smooth, more pronounced, and more powerful than his rough exterior may evoke. Chris grew up in rural New Zealand and likes to tell tales about the little things, as those are what make our lives rich and full. He’s mostly performed with award-winning indie-folk band Albi & The Wolves but has written songs in many different projects, including a collaboration with Mt Eden Dubstep that has amassed over one million streams, or his side project Sneakers which has a single with over 750,000 streams.\nWhether it’s on the stage or off, Chris is known for his work ethic and as he sets out on a new journey, quietly creating new solo music, he’s excited to see where that leads. For this show, Chris will be joined by the accomplished musician Hannah Morrell on the violin and maybe even the banjo. She is a seasoned touring musician who hails from Tasmania, Australia and has performed with the likes of The Dead Maggies (TAS), Claire Anne Taylor (TAS), Looking For Alaska, Finn Johanson, Holly Arrowsmith, and Jess Bailey (Fables).\nNot for profit, supporting our dedicated musicians. Suggested donation $30\nCome along and enjoy this gig in our special space, up close and personal.\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Anthony Donaldson - Master Drummer - Night 2-Pyramid Club, Wellington-Under The Radar",
    "name": "Anthony Donaldson - Master Drummer - Night 2",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96994-399104.jpg",
    "venue": "Pyramid Club, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-01:01"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96994/Anthony-Donaldson---Master-Drummer---Night-2.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Anthony Donaldson is one of this country's great drummers a pioneer of improvised music in Aotearoa. A visual artist before becoming a musician, Anthony's starting point on the drums was in finding tonal colours, rhythms that come from nature, and constructing a drum kit that grew like a living sculpture, Beginning in the late 70s and early 80s with Primitive Art Group, his music making has always centred on free improvisation and collective composition. His musical journey has seen him perform with countless ensembles, often of his own creation, including the Black Sheep, Six Volts, Razorblades, Mean Bones, Flower Orphans, Teeth, Devils Gate Outfit, Rubbernecks, Farewell Spit, Melancholy Babes and the Stinging Nettles. He has been a creative force in Wellington music for over four decades and continues to push the boundaries of accepted musical norms, while encouraging and mentoring younger players.\n\nPyramid Club is very happy to host Anthony for two nights, performing solo and in collaboration with a large number of outstanding musicians. Gifted with a sparkling musical imagination, alongside his drum kit Anthony will be performing with electronics, 78rpm phonograph player, assorted percussion and spoken word.\n\nThe the second of his two night performance residency, Anthony will be performing in collaboration with:\nduo with Riki Gooch (percussion/taonga pūoro/electronics)\nduo with Alphabethead (turntables)\nquartet with Bridget Kelly (reeds) / Toby Laing (trumpet/keys) / Tom Callwood (bass)\n\nListen here to a recent Dancing in Your Head podcast featuring Anthony playing some of his own music and tracks which he's been listening to.\n\nAnd to his feature on RNZ's Mixtape a few years back\n\n- - - - - - - -\n\nPresale tickets for Night 1 $20\nPresale tickets for Night 2 $20\nPresales for a two-night pass $30\n\nRāmere 25th July\nsolo\ntrio with Nell Thomas (electronics) / David Long (guitar)\ntrio with David Donaldson (bass banjo) / Steve Roche (brass)\ntrio with Jonny Marks (Synthi AKS) / Daniel Beban (reel-to-reel)\n\nRāhoroi 26th July\nduo with Riki Gooch (taonga pūoro/electronics)\nduo with Alphabethead (turntables)\nquartet with Bridget Kelly (reeds) / Toby Laing (trumpet/keys) / Tom Callwood (bass)\n\nSpecial thanks to Creative NZ for supporting Pyramid Club's programme."
  },
  {
    "id": "Re O Week @ Massey-The Dominion Museum Building, Wellington-Under The Radar",
    "name": "Re O Week @ Massey",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97064-570804.jpg",
    "venue": "The Dominion Museum Building, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-21:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97064/Re-O-Week--Massey.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "**EVENT OPEN TO ALL PUBLIC AND STUDENTS OVER 18**\n\nStart 2nd semester off with a bang!\n\nThe re-established Tea Gardens at Massey University hosts its first *open to public* show with 2 amazing bands playing all of your favourites.\nThe Tea Gardens are situated above the Great Hall in the Dominion Museum building.\n(Otherwise known as Block 10)\n\nLazy Suzan have been selling out shows across Wellington with their tribute show.\nPlaying your favourites from Paramore, My Chemical Romance, Fall Out Boy and every early 00's banger you can think of.\n\nThe Bums are a 2 piece band hailing from Wellington.\nTheyve toured consistently across the country playing 58 shows in 59 weeks with bands like Alestorm, Head like a Hole, The Schizophonics and Guitar Wolf.\nThe Bums are accompanied by Donal Gunning on bass to complete a 3 piece to play some Nirvana songs.\n\nEarlybirds: $10\nTickets: $15\nDoors: $20\nPlus booking fee\n\nMassey students get $5 off tickets when they use the discount code.\n\nPlease note:\nThis is an R18 event at a fully licensed venue.\nPlease bring ID for entry and service at the bar."
  },
  {
    "id": "Onandon Presents DJ Koa and Christopher Tubbs-Cuba St Tavern, Wellington-Under The Radar",
    "name": "Onandon Presents DJ Koa and Christopher Tubbs",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97092-97129.jpg",
    "venue": "Cuba St Tavern, Wellington",
    "coordinates": {
      "lat": -41.2944364,
      "long": 174.7749357
    },
    "dates": [
      "2025-07-26-16:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97092/Onandon-Presents-DJ-Koa-and-Christopher-Tubbs.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Join Wellington legend DJ Koa and head honcho Christopher Tubbs (Public Possession) for a daytime party of super eclectic dancefloor shenanigans, late afternoon into the evening.\n\nAfter the last two sold-out parties, Mr Tubbs turns to one of Wellington's most respected underground heroes, DJ KOA. A famed global warmup specialist for Fat Freddy's Drop, Koa is also a complete weapon when it comes to taking you to that special place amongst the heat and the smoke.\n\nTaking place again in the beautiful botanical courtyard at the brand new Cuba St Tavern, it's an opportunity for you to have a special dancefloor experience and not decimate your Sunday because you got to bed at 4.30am! Genius!\n\nExpect the full spectrum of vinyl treats: from dub wise science, balearic burners, house, disco and unstoppable detroit body music as the sun goes down."
  },
  {
    "id": "Songwriters' Circle Concert #3-The Petone Depot, Petone, Wellington-Under The Radar",
    "name": "Songwriters' Circle Concert #3",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97174-933509.jpg",
    "venue": "The Petone Depot, Petone, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-19:00"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97174/Songwriters-Circle-Concert-3.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Four Wellington songwriters meet to play their (very good) songs and talk about how they wrote them and why. It's an intimate deep dive into each writer's world. They may not be doing Wonderwall but it'll be even better."
  },
  {
    "id": "Oscar Lavën Quartet-The Undercurrent, Wellington-Under The Radar",
    "name": "Oscar Lavën Quartet",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97265-1586.jpeg",
    "venue": "The Undercurrent, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-19:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97265/Oscar-Lavn-Quartet.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Saturday 26th July\n\nThe Undercurrent presents The Oscar Lavën Quartet: The Music of Django Reinhardt!\n\nDynamic woodwind virtuoso Oscar Lavën joins forces with swing guitarist specialists Adrian Jensen & James Quick, and double bass raconteur Robert Henderson to present a homage to the unique music of guitarist Django Reinhardt and violinist Stephane Grapelli. Together they will create hard-working interpretations of the infectious, foot-stomping, film noir music known in 1940s Paris as Hot Club, in the perfect venue for this music, the bohemian wonderland, The Undercurrent.\n\nSaturday 26th July\nDoors 7pm/ Doors 7:30pm\n$20\nTickets available on the door & online!\n\nAs always wine/ beer/ hot drinks/ snacks & books available for purchase ?\nSee you there!"
  },
  {
    "id": "Princess Chelsea's Midwinter Ball-Meow Nui, Wellington-Under The Radar",
    "name": "Princess Chelsea's Midwinter Ball",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96738-987873.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-26-01:01"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96738/Princess-Chelseas-Midwinter-Ball.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "PRINCESS CHELSEA’S MIDWINTER BALL\nSWORDS AND SORCERY - Fantasy on The Big Screen\nwith your host TOM SAINSBURY\n\nSATURDAY 19 JULY - WINTERGARDEN, THE CIVIC, AUCKLAND (ALL AGES) *\nSATURDAY 26 JULY - MEOW NUI, WELLINGTON **\n\nWith special guests THE CIRCLING SUN & GOLDEN AXE *\nGRECCO ROMANK & LUKE BUDA **\n\n‘The Wintergarden will host many, many more incredible events, but it will never host something like the mesmerising Princess Chelsea and Twin Peaks crossover again’ - Rolling Stone\n\nThis winter, the Civic Wintergarden (ALL AGES) and Meow Nui (18+) Wellington will be transformed into a world of fantasy! Princess Chelsea’s Midwinter Ball returns, this year with a new theme: SWORDS AND SORCERY - Fantasy on The Big Screen. With your esteemed host comedian Tom Sainsbury, and live performances from Princess Chelsea & The Dream Warriors in both centres, with Auckland guests The Circling Sun & Golden Axe, while Wellington will be treated to sets from Grecco Romank & Luke Buda.\n\nIn the shimmering and VHS-heavy age of the early 1980s, a treasure trove of cinematic fantasy was thrust upon us. Gleaming swords and potent spells in Excalibur, the ethereal beauty and terror of Legend, valiant quests of The Sword and The Sorcerer, Ladyhawke, The Beastmaster, Willow, Dragonslayer, and the mighty & muscular quests of Conan The Barbarian. And let us not forget the timeless enchantments of pure fantasy with The Neverending Story, the delightful Princess Bride, the poignant Last Unicorn, and the unforgettable shape of Labyrinth.\n\nSo, brave adventurers, will you join us to celebrate this golden age? How will you dress to impress as visions of enchanted lands and heroic feats conjure a costume fit for fantasy?\n\nCalled by many as ‘the show of 2024’, last year’s Twin Peaks themed Midwinter Ball was a revelation, and a dress up party for the ages. A sold out Wintergarden heaved with 650 guests dressed as Log Ladies, Agent Dale Coopers, and even a giant slice of cherry pie… and oh, so much more.\n\nPrincess Chelsea and her band The Dream Warriors delighted the audience with a blazing set of originals alongside covers of Julee Cruise, Angelo Badalamenti and In Heaven from Lynch’s Eraserhead. This wild and unforgettable night has been lovingly captured and presented as a four song tribute to David Lynch, due for imminent release.\nFor 2024’s Twin Peaks-themed ball, no expenses were spared on transforming the venue into the quaint town of Twin Peaks. Decoration which featured lasers, an indoor pine forest, a shrine to Laura Palmer and a replica of the infamous Red Room, we can only expect magic and mystery from 2025’s fantasy- themed ball.\n\n“I’m not giving too much away but obviously we will need a medieval sword fight” - Princess Chelsea\n\nIf last year’s ball was anything to go by, I don't think she is joking - and further shenanigans will undoubtedly ensue. Expect the Civic and Meow Nui to be transformed into a world of fantasy.\n\nEarlybird tickets are on sale Friday at 10am. Book your evening, and swan down the red carpet dressed in your favourite fantasy-inspired outfits. Portraits will be taken on the night, and prizes for best dressed."
  },
  {
    "id": "Sanoi - Underwater World-Underworld Tavern, Wellington-Under The Radar",
    "name": "Sanoi - Underwater World",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96811-211240.jpg",
    "venue": "Underworld Tavern, Wellington",
    "coordinates": {
      "lat": -41.2972108,
      "long": 174.7828717
    },
    "dates": [
      "2025-07-26-18:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96811/Sanoi---Underwater-World.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "FORTUNES invites you to an immersive Underwater World curated to take you on a transformative journey with the sounds of German Producer Jonas Fischer AKA - SANOI....carefully curated local support from 2 of Wellingtons finest as well as a special pre-party to share with us before the show begins!\nVisual production by ZIPZAP, Musical curation and event hosts by FOR-TUNES, Sound by Gold For Gold."
  },
  {
    "id": "The Mixtape: Vol 6-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "The Mixtape: Vol 6",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97433-511626.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-26-21:30"
    ],
    "displayDate": "Sat 26 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97433/The-Mixtape-Vol-6.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "LJ Crichton is back with The Mixtape: Vol 6. A night of RnB, Soul and Funk to heat up the city a bit.\n\nJoined by some heavy musicians it’s gonna be a great night at the Rogue and Vagabond.\n\nFree entry ?\nMusic from 9:30pm"
  },
  {
    "id": "The Warratahs In Paekakariki-St Peters Hall Paekakariki, Paekakariki, Wellington-Under The Radar",
    "name": "The Warratahs In Paekakariki",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/warratahsjune2025.jpg",
    "venue": "St Peters Hall Paekakariki, Paekakariki, Wellington",
    "coordinates": {
      "lat": -40.98826,
      "long": 174.9509208
    },
    "dates": [
      "2025-07-27-19:30"
    ],
    "displayDate": "Sun 27 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97032/The-Warratahs-In-Paekakariki.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The legendary Warratahs make a welcome return to St Peters Village Hall in Paekākāriki to present their beautiful new album Burning Daylight along with familiar gems from their previous albums.\n\nFeaturing Barry Saunders' songs and the band's unique blend of country, rockabilly and folk, these pioneering icons and their renowned crack musicianship never fail to deliver a fantastic show with a rocking night out guaranteed.\n\n*Tix $40 at www.undertheradar.co.nz (from Monday 23 June)\n*Text/call 0272584251 for phone bookings\n*Cash only please for door sales (if any available)\n*Doors 7pm, show 7.30pm\n*BYO"
  },
  {
    "id": "Rogue Sunday Jazz - Emma Hattaway-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Rogue Sunday Jazz - Emma Hattaway",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97203-484778.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-27-17:00"
    ],
    "displayDate": "Sun 27 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97203/Rogue-Sunday-Jazz---Emma-Hattaway.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The Rogue's regular Sunday afternoon jazz. Funky, jazzy, soulful jazz. Beer, hangs, and jazz, on a Sunday, perfect!\n\nThis week featuring local bassist Emma Hattaway and her band.\n\nJoin Emma and friends for an evening celebrating two of jazz’s most original voices. One set explores the sharp, playful language of Thelonious Monk; the other dives into the bold, emotional world of Charles Mingus.\n\nAs if their voices weren’t daring enough, the band will explore new takes and outlandish arrangements of Monk and Mingus tunes—adding to the ongoing conversation these legends continue to inspire.\n\nMusic from 5pm, FREE ENTRY - koha for the band encouraged"
  },
  {
    "id": "vegetable.machine.animal 'Guest' Album Tour, w/ Indigogue Browne-Common Ground, Featherston, Wellington-Under The Radar",
    "name": "vegetable.machine.animal 'Guest' Album Tour, w/ Indigogue Browne",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97255-283180.jpg",
    "venue": "Common Ground, Featherston, Wellington",
    "coordinates": {
      "lat": -41.1175307,
      "long": 175.3259484
    },
    "dates": [
      "2025-07-27-16:00"
    ],
    "displayDate": "Sun 27 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97255/vegetablemachineanimal-Guest-Album-Tour-w-Indigogue-Browne.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "vegetable.machine.animal - 'Guest' album release gig\nfeaturing\nvegetable.machine.animal\nindigogue browne\n\nvegetable.machine.animal\nA live conversation between plants, fungi, machines, and human musicians\nWhat would it sound like if we could interact musically with plants and fungi—if humans stopped to listen and respond?\nvegetable.machine.animal is an interspecies improvisational trio exploring this question through a hybrid sonic language of biosignals, modular synthesis, and live drums.\nLed by drummer Kieran Monaghan, the project transforms living data from plants and fungi into voltage, translated into sound via modular synthesizer. Monaghan responds in real time, creating a feedback loop between human, organism, and machine.\n\nTheir debut album, GUEST, was recorded during the 2024 Sonic Artist Residency (Creative New Zealand / NZSM / Toi Pōneke) and emerged through open-ended, intuitive sessions. A diverse group of collaborators was invited to join the process, including Kedron Parker, Nico Buhne, Bill Wood, Ruby Solly, Indigique Brown, David Long, Andrew Faleatua, Andy Wright, Gemma Thompson, Timothy Morel, Mo H. Zareei, Tae Kyung Seo, Issac Smith, and Chrissie Butler.\nRather than guiding the music, contributors were invited to follow it—adding their voices to a living, shifting ecology of sound. The result is an album that is rhythmic, irregular, immersive, and alive.\n\nGUEST is co-released by Audio Foundation Records (Tāmaki Makaurau) and skirted Records (Te Whanganui-a-Tara).\n\nKIERAN MONAGHAN\nKieran Monaghan is a self-taught multi-instrumentalist, writer, recording artist and sound bogan based in Te Whanganui-A-Tara. He is a prolific creative and organiser, with an irrepressible DIY ethic, known for his experimental and innovative approach to performance and sound making. Used to drum with mr sterile Assembly\n\nindigogue browne\nguitar, detritus, synth, violin, vocals"
  },
  {
    "id": "Lockie Bennett And Elijah Mulheron - An Ias Cushion Concert-Inverlochy Art School, Wellington-Under The Radar",
    "name": "Lockie Bennett And Elijah Mulheron - An Ias Cushion Concert",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97370-303687.jpg",
    "venue": "Inverlochy Art School, Wellington",
    "coordinates": {
      "lat": -41.2941697,
      "long": 174.7700143
    },
    "dates": [
      "2025-07-27-17:00"
    ],
    "displayDate": "Sun 27 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97370/Lockie-Bennett-And-Elijah-Mulheron---An-Ias-Cushion-Concert.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "IAS Cushion Concerts presents local bands in the intimate environment of historic Inverlochy House.\n\nThis July. join jazz musicians Lockie Bennett (guitar) and Elijah Mulheron (bass) for an evening of their favourite selections from the first half of the 20th century. Expect raucous bebop, beautiful ballads and everything in between.\n\nFree entry for tamariki and no worries if cushion's aren't your thing - we have chairs!\n\n\nNgā mihi nui to our friends at Wellington City Council for sponsoring our 2025 Cushion Concert series,"
  },
  {
    "id": "Ngahuia, Cicada and Cordelia's-Valhalla, Wellington-Under The Radar",
    "name": "Ngahuia, Cicada and Cordelia's",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97081-863548.JPG",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-30-20:00"
    ],
    "displayDate": "Wed 30 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97081/Ngahuia-Cicada-and-Cordelias.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "On the 30th of July, there'll be no question whatsoever about where you should be.\nFrom the Valhalla stage, you'll witness some of the finest songwriting you can hear in Wellington from three stellar original acts.\n\nThe hauntingly beautiful music of singer-songwriter NGAHUIA opens the show.\nShe'll be followed by the raw and ragged brilliance of transsexual disaster folk-rock band CICADA,\nbefore a stunning closing set from feminine rage folk trio CORDELIA'S.\n\nThis show's a must-see for anyone who likes their acoustic music intense, ferocious and gay as all hell.\n\nTickets are $10 at the door or on UTR\nDoors 7:30. See you there!"
  },
  {
    "id": "The Toffee Pops-Cable Top Eatery, Wellington-Under The Radar",
    "name": "The Toffee Pops",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97396-689853.jpg",
    "venue": "Cable Top Eatery, Wellington",
    "coordinates": {
      "lat": -41.2856291,
      "long": 174.7676135
    },
    "dates": [
      "2025-07-30-17:30"
    ],
    "displayDate": "Wed 30 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97396/The-Toffee-Pops.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Calling all Dancing Queens (and Kings)! Introducing The Toffee Pops, an electrifying duo that transforms any venue into a pulsating disco wonderland. With their infectious energy and irresistible setlist of dance party hits, they keep the dance floor buzzing all night long. You won’t be able to stay in your chair as The Toffee Pops perform “sweet as” songs that will get your toes tapping and your body boogying. From Donna Summer to Gloria Gaynor to the Bee Gees these Disco Divas will have you strutting your stuff with sassy attitude! With a setlist and banter that’s at times sweet, spicy, and a little bit salty, they’ll get you into the groove! So grab your flares, sequins and platforms, and join us on the dancefloor!"
  },
  {
    "id": "George Young - Free Live Music Wednesdays-MOON, Wellington-Under The Radar",
    "name": "George Young - Free Live Music Wednesdays",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97425-347926.jpeg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-07-30-19:00"
    ],
    "displayDate": "Wed 30 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97425/George-Young---Free-Live-Music-Wednesdays.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Every Wednesday come down to Moon for FREE Live Music from 7pm & $15 Pizzas from 5.30-9\n\nGeorge Young has been called “one of the city’s best kept secrets”. With soulful arrangements and originals that spin webs between genres and themes. He is a passionate lyric writer and seasoned songsmith. If you have a blue bone and a sweet heart, he’s got something for you.\n\nCatch him playing a chill solo set this Wednesday at Moon while you sip a craft and have a nibble"
  },
  {
    "id": "Barbarianism 5 Extreme Metal Fest-Underworld Tavern, Wellington-Under The Radar",
    "name": "Barbarianism 5 Extreme Metal Fest",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96704-987523.jpg",
    "venue": "Underworld Tavern, Wellington",
    "coordinates": {
      "lat": -41.2972108,
      "long": 174.7828717
    },
    "dates": [
      "2025-07-31-19:00"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96704/Barbarianism-5-Extreme-Metal-Fest.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The fifth gathering of NZ's darkest and heaviest extreme metal!\n\nThree nights of the best Black/Death/Doom metal NZ has to offer! One night at the fantastic Underworld tavern and two nights at our beloved mecca Valhalla! Vendors with interesting and exciting stalls, awesome sets from carefully chosen bands of the highest calibre and the best crowd Wellington can gather!\n\nA huge lineup this year, a titanic gathering of the best performing monster bands!\nDECIMATION HAMMER, SLAVE CADAVER, HORRENDOUS DISFIGUREMENT (Ahu), VIGILANTE (Kap), METHCHRIST (Dun), OSSEOUS TOMB, DAEDRIC SEER (Akl), INSIDIOUS RETCH, BODYSIEGE, SCIOLISM (Giz), BLEED THIS EARTH, WINDSWEPT, EXECRATE (Kap), PEVERTOR, DARK DIVINITY, CELTIC DEATH\n\nOnly 70 bucks for the whole fest die-hards or 30 bucks a night, but honestly none of it is to be missed!"
  },
  {
    "id": "Klo-Promotion Fundraiser Gig-Valhalla, Wellington-Under The Radar",
    "name": "Klo-Promotion Fundraiser Gig",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97155-876002.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-07-31-19:30"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97155/Klo-Promotion-Fundraiser-Gig.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Klo-Promotion presents the Klo-Promotion Fundraiser Gig, raising funds for Kloey Shaw's new event promotion business at university. Join us on Thursday, July 31st at Valhalla.\n\nStarring RENÉE, Jayme Morpeth, Jeline, and Bri Louise with Molly.\n\nDoors open at 7pm\n\nEarly birds: $5 + BF\nGeneral admission: $10 + BF"
  },
  {
    "id": "Jazmine Mary I Want To Rock And Roll Album Release Tour-Meow, Wellington-Under The Radar",
    "name": "Jazmine Mary I Want To Rock And Roll Album Release Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96336-49228.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-07-31-20:30"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.undertheradar.co.nz/gig/96336/Jazmine-Mary--I-Want-To-Rock-And-Roll--Album-Release-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Tickets here - https://www.meow.nz/home-wav\n\nJazmine Mary releases Third Studio Album ‘I Want To Rock And Roll’ and will celebrate with a live show to mesmerise with full band.\nSpanning the dark to the light, the brilliant new emotive release, from award winning, indie-folk visionary, Jazmine Mary.\n\nWhen you step into a Jazmine Mary gig, be prepared to be met by either a clown, a popstar, a pilgrim farmer or a nightgown-clad ghost howling brazenly onstage. It’s a whimsical experience that you won’t want to miss out on - VICE"
  },
  {
    "id": "The Hip Town Bangers-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "The Hip Town Bangers",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97192-329455.jpg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-07-31-21:00"
    ],
    "displayDate": "Thu 31 Jul",
    "url": "https://www.undertheradar.co.nz/gig/97192/The-Hip-Town-Bangers.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Wellington's hardest swinging quintet are back for another round at The Rogue and Vagabond. Last time was so much fun we just had to go in again!\n\nFeaturing:\n\nChris Buckland - tenor saxophone\nBen Hunt - trumpet\nAnita Schwabe - piano\nEmma Hattaway - bass\nMike Jensen - drums\n\nMusic from 9pm - FREE ENTRY, Koha for the band welcome!"
  },
  {
    "id": "Altared States: Electronic Soundscapes In A Divine Place-Old St Paul's, Wellington-Under The Radar",
    "name": "Altared States: Electronic Soundscapes In A Divine Place",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96941-923243.jpg",
    "venue": "Old St Paul's, Wellington",
    "coordinates": {
      "lat": -41.2762651,
      "long": 174.7803602
    },
    "dates": [
      "2025-08-01-19:30"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96941/Altared-States-Electronic-Soundscapes-In-A-Divine-Place.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Wellington’s iconic Old St Paul’s (OSP) will play host to a transcendent new series in August, partnering with the Pyramid Club to present Altared States, a unique electronic music experience. Set beneath the exquisite stained-glass windows of one of Te Whanganui-a-Tara’s most exquisite landmarks, this series promises an immersive sonic experience that invites audiences to explore sound in a deeply personal and transformative way.\n\nAltared States is inspired by Brian Sweeney’s New York-founded Ambient Church, an initiative dedicated to collaborating with artists to create transformative audio performances in architecturally significant spaces. This series will immerse attendees in soundscapes that transcend the ordinary, offering a chance to disconnect for a moment from the modern world.\n\nEach of the evenings will bring a different electronic vibe, conjured by some of Wellington’s most innovative artists. The series lineup includes:\n\nAugust 1: Ludus\nAugust 8: Stephen Gallagher with David Long and Jules Desmond\nAugust 15: Oghum\nAugust 22: Dream Chambers\n\nSet within the chancel at the altar of the venue, each artist will perform a 60-minute immersive sound experience that redefines ritual in a contemporary light.\n\nTickets are available now, with limited capacity of 50 for each show of this intimate series.\n\nAbout the Artists\n\nLudus\n\nis the captivating musical venture curated by Emma Bernard. Her creative inspiration spans across the worlds of electronic music, audio engineering, sound design, and the written word. Bernard’s artistic journey explores the deep connection between soundscapes and the natural world, with a focus on evoking emotional responses to the environments we inhabit. She is also co-founder of the Pōneke-based collective Tonic.\n\nStephen Gallagher\n\nis an Emmy award-winning composer and music editor who has worked on an extensive range of projects, from global blockbusters to television and contemporary dance. Most recently, he completed the score for The Lord of the Rings: The War of the Rohirrim, directed by Kenji Kamiyama. Gallagher’s work spans collaborations with Peter Jackson, Brian Eno, Ed Sheeran, Nick Cave, and many more.\n\nDavid Long\n\nis a composer, performer, founding member of The Mutton Birds, and member of easy listening noise band, Teeth. His career has spanned over 40 years and seen him work on numerous projects to commercial and critical acclaim. In his own words he likes to “mash shit up”, creating orchestral scores that utilise “not only classical instruments but all sorts of things”.\n\nJules Desmond\n\nis an experimental musician from Wellington who has played in bands including Letterbox Lambs, 1/3 Octave Band, Bachelor of Architecture and Black Boned Angel.\n\nOghum\n\nis the interstellar duo of Nell Thomas (Orchestra of Spheres, Cookie Brooklyn and the Crumbs) and Jonny Marks (All Seeing Hand, Mean Bones), performing on Synthi AKS, theremin and other assorted items. Oghum blends electronic sounds from times past with an array of acoustic and found sounds, using nuanced improvisation to create detailed and tangible sonic environments, invoking memory and transporting the listener through narrow gaps into wide open otherworldly spaces.\n\nJess Chambers\n\nis a composer, musician, and educator currently based in Aotearoa New Zealand, and working under the moniker Dream Chambers. From her beginnings as a folk singer to her current explorations in electronic music, she experiments with sound as a practice of attention: to a room, an outer world, an inner feeling. It’s in that space of beholding where transformation and connection occur, and Chambers is a master alchemist, likening that stretch of attention in music to growing a garden: “There’s a lot of searching, reaching and eventual blossoming in my music – it feels like coming up from underground, like a tulip bulb.”\n\nAbout the Venue\n\nBuilt in 1866, Old St Paul’s is a prime example of timber Gothic Revival architecture and one of Aotearoa’s most important historic places. Managed and operated by Heritage New Zealand Pouhere Taonga, it is a venue steeped in history and beauty.\n\nThe Pyramid Club, located on Taranaki Street, is an artist-run space dedicated to experimental music and sonic arts, providing a home for innovative sound exploration."
  },
  {
    "id": "Funky Friday 006 - Not My Sister, Sorchalula, Mi Casa Su Casa-MOON, Wellington-Under The Radar",
    "name": "Funky Friday 006 - Not My Sister, Sorchalula, Mi Casa Su Casa",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97428-764320.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-01-21:00"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97428/Funky-Friday-006---Not-My-Sister-Sorchalula-Mi-Casa-Su-Casa.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "We're back for another night of house, techno, disco, bass & more at Moon with Funky Friday Vol. 6!\nCreated to revive and celebrate the underground electronic scene, Funky Friday is more than just a night out—it’s a space for music lovers, dancers, and creatives to connect through rhythm and energy. Each edition features a rotating lineup of talented DJs, both local and international, ensuring a fresh and unique experience every time.\n\nCome with an open mind and leave with tired feet.\n\nThis edition features legends Sorchalula, Mi Casa Su Casa & our host Not My Sister!\n\n$10 presales or $15 on the door.\n\nTimes:\n9-10 Not My Sister\n10-11.30 Mi Casa Su Casa\n11.30-1 Sorchalula\n1-2 Not My Sister\n\nNot My Sister is a house music DJ born and raised in a little town in the north of Italy. Now based in Wellington, she started this project in 2024, and recently she has been lighting up dance floors across New Zealand, you may have already come across her sets at Twisted Frequency, Kiwiburn, Earthbeat, Cuba Dupa, Arkadien and other events across the country. Influenced by funk and disco, with a special focus on vocals and anything groovy, Not My Sister brings high energy and uplifting sets. Constantly developing as an artist, she always brings fun and passion to the dance floors. Expect a delightful fusion of melodic basslines, blending soulful, tech, garage, and deep house sounds.\n\n--------\n\nMysterious, mercurial and multi-faceted. SorchaLula has as many shades to her music as she does to her personality. A dynamic producer/DJ, she flows from slinky sensuality, to fierce filth, to the uncompromising underground. Every set features her original tracks, many melting with honeyed vocals by singer Samuel (Cecilia’s Crop). In tune with what the body needs, she entwines beauty with bravery, sinuous melodies with hefty bass, lush peaks with decadent darkness.\n\nShe has played many top festivals around Aotearoa: Northern Bass, Shipwrecked Festival, Twisted Frequency, Aum Festival NYE, CubaDupa, Taniwha’s Den and more. She is highly rated by some of the biggest names in the scene for her taste, depth, and intuitive understanding of dancefloors. As founder of The Sensonauts she created events exploring the senses, music, dance, and music education with a focus on inclusivity.\n\n--------\n\nThese two scallywags have the Welly wind in their sails and a groove in their hearts.\n\nThey're the duo behind the capital's much loved club night, Mi Casa Su Casa, now rockin' for over 15 years.\n\nThey've also had the pleasure of playing some of NZ's most legendary shindigs like Shipwrecked, Off The Radar, Kiwiburn, CubaDupa, Taniwha's Den and Rhythm & Vines.\n\nWith the people on the dancefloor their inspiration, they'll share a bounty of underground house to lift you up and bring you on a journey."
  },
  {
    "id": "Jazz Orchestra Composer Series Presents: Callum Passells-Bedlam And Squalor, Wellington-Under The Radar",
    "name": "Jazz Orchestra Composer Series Presents: Callum Passells",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97178-148922.jpg",
    "venue": "Bedlam And Squalor, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-01-19:00"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97178/Jazz-Orchestra-Composer-Series-Presents-Callum-Passells.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The seventh concert in our series is a new suite of music by Tāmaki Makaurau composer, performer, and educator; Callum Passells.\n\nFor the Jazz Orchestra Composer Series Callum brings new music for his ensemble LCR, an ensemble which features three identical saxophone trios (sax, bass, and drums) that play with and against each other in a kaleidoscopic and often explosive fashion. The new pieces commissioned for this series continue to stretch at the fabric of jazz and improvised forms, and are inspired by Morton Feldman, Lennie Tristano, Henry Threadgill and Sly Stone.\n\nCallum has been deeply involved in the New Zealand jazz and improvised music scene for over a decade, and is a busy freelancer in the wider music community in Auckland. He has performed with Aldous Harding, Hans Pucket, the Exploding Rainbow Orchestra, the Auckland Philharmonia Orchestra, among many others. In 2021, Callum was commissioned to compose a large-scale work 'Solid Spirit, Liquid Body' for the Wellington Jazz Festival. He is currently completing a Master of Music degree at the University of Auckland, where he also teaches saxophone.\n\nThe Jazz Orchestra Composer Series showcases original music for large jazz ensemble by New Zealand composers. Concerts take place every 1st and 3rd Friday of the month, from May to October, from 7pm. Tickets are $15 from Humanitix, door sales $20."
  },
  {
    "id": "Salmonella Dub Soundsystem-Meow, Wellington-Under The Radar",
    "name": "Salmonella Dub Soundsystem",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97244-585927.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-08-01-20:00"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97244/Salmonella-Dub-Soundsystem.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Salmonella Dub originator Andrew Penman (aka Dj Rudeboy) drives the Sal Dub SoundSystem Machine featuring the Mighty Asterix & Whirimako Black on vocals with the epic Sal Dub horn section live. Prepare for an audio visual dance floor journey through the basslands of Salmonella Dub back catalogue + new tunes from the For All Things Alive and versions featured on next release.\n\nLook For Gold ft Whirimako Black\n\nSalmonella Dub began writing with Whirimako Black after touring with the band on their Feel The Seasons Change live with the New Zealand Symphony Orchestra summer shows of 2008. Look For Gold is the bands new 4 track EP featuring Whirimako on all four tracks. The title track Look For Gold - [I'm Coming Alive Low-Phi Rockers Dub] - ft. Whirimako Black is an unreleased dub track written during the bands For All Things Alive album sessions cross pollinating Whirimako’s Return to our Kowhai vocal with a stripped back dub of Andy’s Jam produced by Harry Bretherton.\n\nThe bands Salmonella Dub SoundSystem ft. Whirimako Black, the Mighty Asterix and Dub horns are out touring the bands new releases over May & June in preparation for the bands remastered digital back catalogue re-issue.\n\nNOTE Under 18 permitted with Legal Guardian"
  },
  {
    "id": "The Manuelitos-Thunderbird cafe, Wellington-Under The Radar",
    "name": "The Manuelitos",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97300-301266.JPG",
    "venue": "Thunderbird cafe, Wellington",
    "coordinates": {
      "lat": -41.2836491,
      "long": 174.7766603
    },
    "dates": [
      "2025-08-01-17:30"
    ],
    "displayDate": "Fri 01 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97300/The-Manuelitos.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An evening of laid back music by Vic Manuel, songwriter, guitarist and singer, joining Vic are Cindy Muggeridge, piano and vocals, Beans Wright, violin, guitar and vocals and Tony Paine on Bass and vocals, songs about the human condition and life in general. If you are into having a relaxing time, after work or wanting to have a great Mexican meal and drinks then this is for you, Wheelchair accessible, starts at 5.30 PM."
  },
  {
    "id": "InDuna - Go High - EP Release-MOON, Wellington-Under The Radar",
    "name": "InDuna - Go High - EP Release",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96746-651410.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-02-21:30"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96746/InDuna---Go-High---EP-Release.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Join Afro-Kiwi artist InDuna to celebrate the release of his brand new EP, ‘Go High’, live at Moon, Wellington on Saturday 2nd August.\n\n‘Go High’ is a gift from InDuna’s younger self to the artist he is today. It's an uplifting and reflective Afro-pop project inspired by his South African roots and journey of resilience. The EP is a reminder to keep dreaming boldly, no matter the obstacles.\n\nHe will also be joined by two incredible acts:\n\n*Tarin* is a soulful Moriori singer-songwriter from Whakatū, now based in Te Whanganui-a-Tara. Her sound blends dreamy R&B and soul with jazz influences, drawing inspiration from artists like Amy Winehouse and Etta James. With raw, introspective lyrics and a deeply emotive voice, Tarin delivers music that’s personal, expressive, and healing.\n\n*KB the DJ* is a Cape Town-born selector now lighting up Aotearoa with his genre-spanning sets. On the night, KB will be serving deep Afro grooves and infectious rhythms to keep the energy high and the dancefloor moving.\n\nDoors open: 9:00 PM\nShow starts: 9:30 PM\n\nVenue: Moon, 167 Riddiford Street, Newtown, Wellington\nMoon is a wheelchair-accessible venue with both seated and standing options available.\n\nWhen the NFC ticket bundle is purchased, fans will get exclusive access to a limited edition NFC-enabled EP, featuring the full EP plus unreleased demos and future tracks, delivered directly to your device before they’re available anywhere else. InDuna merchandise will also be available on the night — don’t miss it.\n\nAbout InDuna:\nSelf-taught artist and producer InDuna blends Afro-pop with the vibrant spirit of his South African heritage. He was recently honoured with the Young Global Achiever Award at the 2024 Prince’s Trust Awards in London and recognised at Buckingham Palace by King Charles III.\n\nHis music has reached global ears, with his track ‘Dreams’, written for the documentary Ink and Gold: An Artist’s Journey to Olympic Glory, winning Best Original Song at the International Online Web Fest and climbing to #6 on the NZ Hot Singles Chart."
  },
  {
    "id": "DOMUS (ESP, AU) / Juniper May-Pyramid Club, Wellington-Under The Radar",
    "name": "DOMUS (ESP, AU) / Juniper May",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97212-975434.jpg",
    "venue": "Pyramid Club, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-02-01:01"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97212/DOMUS-ESP-AU--Juniper-May.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "DOMUS: the duo of Tarik Rahim (Spain) and Mo Aung (Australia) - guide a journey through live improvisational soundscapes incorporating field recordings, synth textures and ethereal vocals.\n\nTheir performances reflect a fusion of their diverse influences - from lofi psychedelic to abstract electronic beats, contemporary neofolk and a merging of their respective South American and Southeast Asian heritage.\n\nWhile being accomplished artists in their own right with this project they blend their sounds into a unified, compelling and resonant experience.\n\n---\n\nJuniper May is the latest solo project of Pōneke artist Lora May. Using an SP-404, she channels and transfigures samples of found sounds, synths and field recordings into melodic, distant and estranged pop songs.\n\n\nSpecial thanks to CNZ for supporting Pyramid Club's programme"
  },
  {
    "id": "Start Today Crew - Only You, Western Haikus, American Muscle, Ruminari-Thistle Hall, Wellington-Under The Radar",
    "name": "Start Today Crew - Only You, Western Haikus, American Muscle, Ruminari",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97390-561282.jpg",
    "venue": "Thistle Hall, Wellington",
    "coordinates": {
      "lat": -41.2973613,
      "long": 174.7736646
    },
    "dates": [
      "2025-08-02-19:30"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97390/Start-Today-Crew---Only-You-Western-Haikus-American-Muscle-Ruminari.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "START TODAY CREW PRESENTS\n\nONLY YOU (ŌTAUTAHI/CHRISTCHURCH)\nWESTERN HAIKUS (PŌNEKE/WELLINGTON)\nAMERICAN MUSCLE (PŌNEKE/WELLINGTON)\nRUMINARI (PŌNEKE/WELLINGTON)\n\nHailing from the garden city is Only You, who are fresh off the release of their debut EP 'everything you wish you could forget'. Joining them are local emo/post-hardcore mainstays Western Haikus, American Muscle and Ruminari!\n\nAs always, All Ages, Drug Free, Hate Free & Alcohol Free.\nDoors will be $20"
  },
  {
    "id": "Bojack Funkman-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Bojack Funkman",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97199-584502.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-02-21:30"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97199/Bojack-Funkman.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Fronted by Ben Hunt, Kaito Walley, and Eilish Wilson (aka the Horn Section of Doom) with an all-star cast of rhythm section virtuosos, this crossover episode brings together Lettuce, Dave Guy, Ezra Collective, and some hometown bangers. Stay home? Neigh way, José!\n\nSpecial guests: Jade Merematira (vocals) and Louis TM (vocals/keys)\n\nAlso featuring:\n\nBen Hunt - trumpet\nKaito Walley - trombone\nEilish Wilson - saxophone\nPetar Tavich - guitar\nEmma Hattaway - bass\nJacob Randall - drums\n\nMusic from 9:30, FREE ENTRY, koha for the band encouraged"
  },
  {
    "id": "Fill The Void-Meow Nui, Wellington-Under The Radar",
    "name": "Fill The Void",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97366-369060.jpeg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-08-02-20:00"
    ],
    "displayDate": "Sat 02 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97366/Fill-The-Void.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Lacuna is back!! Expect a huge visual production alongside the classic sounds of Lacuna - all wrapped up inside Wellington's best venue, Meow Nui.\n\nTICKETS ARE LIVE!\n\nPrepare to descend into the depths of sound as Lacuna returns with Fill The Void — a night built on immersive energy, driving rhythm, and raw underground atmosphere.\n\nThis is not just a party — it’s a release. Expect a curated lineup of DJs pushing late-night, house, garage and electronic through Meow Nui’s bespoke system, surrounded by hypnotic visuals and a dance floor moving in unison.\n\nLine up:\n\nCee\nFronta\nJack Ritchie\nLamchopz\nParry\n\nStep into the void.\n\nFor regular updates follow our IG:\n@Lacuna_ftv"
  },
  {
    "id": "Homemade Weird Horror Festival-Newtown Community Centre, Wellington-Under The Radar",
    "name": "Homemade Weird Horror Festival",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96595-71925.jpg",
    "venue": "Newtown Community Centre, Wellington",
    "coordinates": {
      "lat": -41.3125737,
      "long": 174.7786303
    },
    "dates": [
      "2025-08-03-18:00"
    ],
    "displayDate": "Sun 03 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96595/Homemade-Weird-Horror-Festival.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Black Flock is proud to present the Homemade Weird Horror Film Festival!\nCome all you horror film fans and weirdos for Sunday Horrors like you've never experienced before.\nDress to distress and prepare to be pleasantly disturbed by a line up of short horror films made by local contestants. Spot prizes on the night! As well as other tricks and treats.\n\nYour host for the evening is the ever so enchanting Bek Coogan-aka-Shera (Aotearoa's first documented female werewolf)!!!\n\nAn awards ceremony follows the screening, with judging panel special guests Chelsea Nicols and Aaron Lister aka Curator of Screams.\nThis event will be seated...least you faint from the terrors.\n\nOnline early pre-sales $6.66 (+bf)\nOnline goody/gory bag + seat $35 (+bf)\n\nLimited door sales available on the night for $15 pp.\n\nFollow https://www.instagram.com/blackflockartcollective/ for updates, screening time and lineup.\n\n\n\n\n\n\nDate and time\nSun, 3 Aug 2025 doors open 6:00 PM\nLocation\nNewtown Community Centre - Te Whare Hapori o Nga Puna Waiora\nCorner of Colombo & Rintoul Streets,\nNewtown, Wellington."
  },
  {
    "id": "Ben Chavasse Unplugged With Strings (support From Bronwyn Wilde)-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "Ben Chavasse Unplugged With Strings (support From Bronwyn Wilde)",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97253-696597.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-03-16:00"
    ],
    "displayDate": "Sun 03 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97253/Ben-Chavasse-Unplugged-With-Strings-support-From-Bronwyn-Wilde.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Indie-folk artist Ben Chavasse is making his first trip to Wellington to celebrate the release of his first two singles. This set will feature stripped back arrangements of his songs accompanied with string arrangements performed by Karen Hu (cello), and Hijiri Yamamoto (violin).\n\nBen Chavasse is a 26-year-old singer-songwriter based in Tāmaki Makaurau. His lyric-forward approach embraces the indie-folk genre while incorporating rock, punk, and jazz influences. He explores themes of adolescence, mental health, and reconciliation through an introspective, reflective and vulnerable lens. Ben continues to thrive in collaboration with local musicians he met during his studies at the University of Auckland Jazz School.\n\nBronwyn Wilde grew up across the road from Vogelmorn and can remember performing at the Hall as early as age six (she sang the national anthem at the Ridgway school talent quest - it was not a winning song choice). Today, she is a trustee of the Vogelmorn Community Group and occasionally works behind the bar, where she has been lucky to see so many talented local musicians perform.\nShe has many fond memories of singing with Ben together in their flat in Auckland during the 2021 lockdown. She is thrilled to be joining him on stage at Vogelmorn, her second home."
  },
  {
    "id": "Sunday Jazz - Callum Allardice-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Sunday Jazz - Callum Allardice",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97186-825406.jpeg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-03-17:00"
    ],
    "displayDate": "Sun 03 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97186/Sunday-Jazz---Callum-Allardice.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The Rogue's regular Sunday afternoon jazz. Funky, jazzy, soulful jazz. Beer and jazz, on a Sunday perfect!\n\nThis week featuring local guitarist Callum Allardice and his trio\n\nJoin the Callum Allardice trio for some favourite standards and standard inspired originals, featuring the talents of John Rae and Eli Mulheron.\n\nMusic from 5pm FREE ENTRY, koha for the band encouraged"
  },
  {
    "id": "Shan-Cable Top Eatery, Wellington-Under The Radar",
    "name": "Shan",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97397-676298.jpg",
    "venue": "Cable Top Eatery, Wellington",
    "coordinates": {
      "lat": -41.2856291,
      "long": 174.7676135
    },
    "dates": [
      "2025-08-06-17:30"
    ],
    "displayDate": "Wed 06 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97397/Shan.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "SHAN is a duo so quirky, clever and in tune that you’ll want to keep watching and listening. Their music is a wonderful mix of original singer/songwriting with an energetic guitar and piano backbone. If you like Kate Bush, Bic Runga or Sia, SHAN provides vocal melodies that have the power to emulate both, soaring to the highs and braving the lows. Within each song, you’ll hear meaningful lyrics blossom from real life experiences and changing landscapes of sound."
  },
  {
    "id": "Merlin Webster (Tim Key) - Free Live Music Wednesdays-MOON, Wellington-Under The Radar",
    "name": "Merlin Webster (Tim Key) - Free Live Music Wednesdays",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97430-243076.jpeg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-06-18:00"
    ],
    "displayDate": "Wed 06 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97430/Merlin-Webster-Tim-Key---Free-Live-Music-Wednesdays.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "A familiar musical face in a less familiar format, Merlin Webster is the alter ego of Newtown Rocksteady guitarist Tim Key. Strumming and singing, whistling and wailing his way through original tunes and interpretations of obscure classics, his solo sets span genres and generations. Folk, rock and blues to rocksteady reggae, a sprinkling of mo-town soul and a smattering of high-brow country. All suffused with the psychedelic soul of the sixties. Expect to feel your toes tapping, your head nodding and your vibe rising.\n\n$15 pizzas 5.30-9pm, entry is FREE!"
  },
  {
    "id": "ABACUS-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "ABACUS",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96843-196762.jpg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-07-21:00"
    ],
    "displayDate": "Thu 07 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96843/ABACUS.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "ABACUS is back at The Rogue & Vagabond on Thursday the 7th of August for a night you won’t forget! ABACUS is an ensemble brought together by their shared love of the music of Brazil. Brush up on your Portuguese and get ready to dance and sing along to tunes by legends like Tom Jobim, Jorge Ben Jor, Novos Baianos, and many more!\n\nFeaturing the talents of:\n\nAlex Scott-Billing: Guitar\nLily Atu: Vocals / Saxophone\nStar Stephens: Trumpet/ Vocals\nElina Chester: Keys\nJono Benzur: Bass\nEric Sebastian: Percussion\nRanu Wijesuriya: Drums\n\nFREE ENTRY– music from 9 PM. Don’t miss out!"
  },
  {
    "id": "The Bitter Brothers-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "The Bitter Brothers",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97040-278547.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-08-19:30"
    ],
    "displayDate": "Fri 08 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97040/The-Bitter-Brothers.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The Bitter Brothers are coming home! After winding our way around the North Island in Holly Jean’s Estima, trailer in tow, from club to club in a jam-packed tour promoting our recent debut album, Daddy Was An Outlaw, we are very excited to bring it all back home and close off our tour full circle with a big party at the Voglemorn Upstairs! We have some old favorites, some new numbers lined up for you all, and some very special surprise quests who you won’t want to miss.\n\nAnd if you haven’t heard about us by now, The Bitter Brothers are a five-piece, Wellington based, southern gothic, old-time, alt-folk, alt-country musical experience. They have banjos, accordions, violins, various guitars and voices, upright basses, drums, percussions, delightfully unexpected arrangements, tempos, and smile-inducing harmonies. The Bitter Brothers bring it all and invite you along for the ride!"
  },
  {
    "id": "Vagina Dry: Vagtastic Voyage-Valhalla, Wellington-Under The Radar",
    "name": "Vagina Dry: Vagtastic Voyage",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97124-707663.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-08-21:00"
    ],
    "displayDate": "Fri 08 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97124/Vagina-Dry-Vagtastic-Voyage.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Vagina Dry single(s) release tour! Wellington show at Valhalla Featuring Lavender Menace and No Sector."
  },
  {
    "id": "Ringlets 'The Lord Is My German Shepherd (Time for Walkies)' Album Release Tour-Meow, Wellington-Under The Radar",
    "name": "Ringlets 'The Lord Is My German Shepherd (Time for Walkies)' Album Release Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96777-355075.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-08-08-01:01"
    ],
    "displayDate": "Fri 08 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96777/Ringlets-The-Lord-Is-My-German-Shepherd-Time-for-Walkies-Album-Release-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "To celebrate the release of their sophomore album ‘The Lord Is My German Shepherd (Time for Walkies)’ released via Flying Nun & Leather Jacket Records on June 27th, Tāmaki Makaurau post-punks Ringlets are embarking on a nationwide tour of Aotearoa this August.\n\nEmerging from Aotearoa’s musical ether in 2021; Ringlets have carved out space with their distinct blend of delicate wit, grit and evident sonic technicality. Since the release of their self-titled debut in 2023, the quartet have become a notorious live-act - supporting heavy-hitting internationals such as UK indie-rockers Sorry, seminal punk force The Damned, as well as stand-out festival performances at The Others Way, Newtown Festival & Junk Fest.\n\nAugust 2025 marks the band’s first headline shows since 2023, with performances in Ōhinehou, Ōtepoti, Te Whanganui-a-Tara and Tāmaki Makaurau this August to celebrate the album.\n\nThe Lord Is My German Shepherd (Time for Walkies) is Ringlets’ shimmering follow-up to the 2023 debut and a vibrant expression of their singular song craft - the record conjures mystic visions; takes raucous, unkempt yet solely committed turns, twists, and tiptoes delicately between the absurd and the divine.\n\nFriday 1 August - Wunderbar, Ōhinehou\nSaturday 2 August - Secret Show, Ōtepoti\nFriday 8 August - Meow, Te Whanganui a-Tara\nSaturday 9 August - Whammy Bar, Tāmaki Makaurau\n\nTICKETS ON SALE NOW FROM RINGLETS.CO.NZ"
  },
  {
    "id": "The Carol Bean Band - 9 August-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "The Carol Bean Band - 9 August",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96919-198903.jpg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-09-19:00"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96919/The-Carol-Bean-Band---9-August.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Gate opens 6.30pm Music Starts 7pm Saturday 9 August 2025\nThe Carol Bean Band play a mix of jazzy blues with a heavy helping of original songs and stylish instrumentation. Carol Bean – vocals and guitar, Costa Botes – guitar(s), George Packard – upright bass, and Andrew Grayson – drums.\nEnglish-born, California-raised, Carol was influenced by the West Coast music of the 60s and the blues of Mississippi John Hurt, Mance Lipscomb, Lightnin’ Hopkins, and Doc Watson. At LA’s Ash Grove and McCabe’s Music Store she was taught her picking style from a young Ry Cooder who encouraged her to buy the Martin guitar she still plays today. Carol has fronted several bands in New Zealand and recorded 3 studio albums, all on Spotify. She continues to perform at the Wellington Roomfulla Blues Club and with the Kelburn Viaduct Municipal Ensemble Jug Band.\nCarol’s singing is versatile, vibrant, and delivers an earthy quality to her songs. Tom Villano, LA\n… when the mood drops she reveals a more intimate, reflective side…. Graham Reid\nThe first three songs of Next Bus Out perfectly set the album up for the interesting journey that is to come. Nick Bollinger.\nCosta is a veteran independent filmmaker with several award winning short films and feature length documentaries to his credit, including the notorious ‘mock doc’ Forgotten Silver, which he made with Peter Jackson. For the last two decades he has created a run of films celebrating individuals who are quirky, creative, passionate, and above all, persistent (Struggle No More, The Last Dogs of Winter, Act of Kindness, Angie, When The Cows Come Home). These films have included studies of musicians (Paddy Burgin's Wooden Box Band, Nigel Gavin’s Circus, and The Shot Band/ Hobnails @ The Paramount Theatre) because Costa has been a persistent closet musician himself. He has had stints with Chris and Eva Prowse, and Carol Bean's Mount Misery String Band. When he was younger, Costa wanted to move his fingers really fast. Now he just tries to put them in the right place, song by song, and man - does he ever. “Tasty”, “Amazing”, “Great playing”.\nCosta Botes | NZ On Screen & Costa Botes Lone Pine Films (vimeo.com)\nGeorge is a professional musician and tutor on Whitireia Polytechnic’s Music Programme, trained classically on the cello. George’s first improvisational experiences were playing ukulele along with the Rolling Stones, John Mayall and The Band (in his bedroom). With little market for improvisational ukulele he took up the double bass.\nGeorge enjoys playing in bands that push the envelope and give expression to the human soul. He has played extensively in many Wellington groups (including currently with the Rag Poets band), appearing a number of times for the Wellington International Festival of the Arts, undertaking national tours for Chamber Music New Zealand, and backing overseas artists in New Zealand. His playing ranges from classical to jazz, to Latin, to ethnic fusion to Americana and country. He believes - at a fundamental level - that music is about human beings making sense of the world and themselves, and about helping heal the world.\nAndrew is also the drummer for the band Ghostplane (Beneath the Sleepy Lagoon; Panther Valley Country Club (Arch Hill Records), which includes Phoenix Foundation members). Not only has he joined our team, but his passion is surfing - so let's say he's the youngest and the fittest.\nNot for profit, supporting our dedicated musicians. Suggested donation $30\nCome along and enjoy this gig in our special space, up close and personal.\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Unfolding Ft. Eli Høff-MOON, Wellington-Under The Radar",
    "name": "Unfolding Ft. Eli Høff",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97038-504148.jpeg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-09-21:00"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97038/Unfolding-Ft-Eli-Hff.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Cable Management brings you Unfolding, our debut gig where we couldn’t be more happy to share the sounds that move us—techno for your mind and body. Expect evolving BPMs, genre hybrids, and a night that explores deep into the dark, hypnotic and underground.\n\nIt all started because we wanted to hear Eli Høff live—one of Aotearoa’s most exciting producers of deep, intricate and compelling techno, built for altered states. Plus ikona happens to be dropping his latest EP soon and it all just came together.\n\nWe’re all about crisp, full-bodied sound, so we’ve teamed up with the legendary Tub’s Audio to deliver, backed by crystalline visuals from Vision Chips and Catalyst.\n$12 presale via undertheradar / $20 on the door\n\nMoon, Newtown\nSat 9th August\n9 PM – 2 AM\n\nLineup:\nnani\njandalz\ninner pulse\neli hoff (live)\nikona (live)\n\nAnd no—we’re not actually great at cable management. Maybe the next one will be called Untangling.."
  },
  {
    "id": "Wishbone Fundraiser - American Muscle + Half/Angel + Eveline Breaker-Barrel Brothers Newtown, Wellington-Under The Radar",
    "name": "Wishbone Fundraiser - American Muscle + Half/Angel + Eveline Breaker",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97429-880951.jpg",
    "venue": "Barrel Brothers Newtown, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-09-21:00"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97429/Wishbone-Fundraiser---American-Muscle--HalfAngel--Eveline-Breaker.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "FUNDRAISER FOR WISHBONE (SHORT FILM)\n\nNEWTOWN BARREL BROTHERS\n\nLIVE MUSIC PERFORMANCES FROM:\nAMERICAN MUSCLE\nHALF/ANGEL\nEVELINE BREAKER\n\nPRESENTED BY SWAMPSOUL"
  },
  {
    "id": "Bookmark Big Night Out-The Bond Store, Paraparaumu, Wellington-Under The Radar",
    "name": "Bookmark Big Night Out",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97161-93084.jpg",
    "venue": "The Bond Store, Paraparaumu, Wellington",
    "coordinates": {
      "lat": -40.8972901,
      "long": 174.9861338
    },
    "dates": [
      "2025-08-09-07:30"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97161/Bookmark-Big-Night-Out.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Voice, music, and visuals collide in an electric celebration of people, story, and place.\n\nBookmark Big Night Out brings together a powerhouse lineup of musicians and storytellers: Mocean (Julia Truscott, Himiona Grace & Janet Holborow), Hinemoana Baker, Hori, Te Kahu Rolleston, and Jess Deacon, with stunning visuals by Phil Simmonds.\n\nExperience Kāpiti storytelling like never before.\n\n18+\nTickets are limited so get in quick!\nNo door sales!\n\nNgā mihi to Valley Audio for sponsoring this event."
  },
  {
    "id": "Niko Ne Zna Live (Wellington)- NZ's 9 Piece Balkan Brass Extravaganza-Vogelmorn Hall, Wellington-Under The Radar",
    "name": "Niko Ne Zna Live (Wellington)- NZ's 9 Piece Balkan Brass Extravaganza",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97271-526543.jpeg",
    "venue": "Vogelmorn Hall, Wellington",
    "coordinates": {
      "lat": -41.313737,
      "long": 174.7643993
    },
    "dates": [
      "2025-08-09-19:30"
    ],
    "displayDate": "Sat 09 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97271/Niko-Ne-Zna-Live-Wellington--NZs-9-Piece-Balkan-Brass-Extravaganza.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Wellington, get ready! It’s been a minute!\n\nFresh off a sold-out show in Auckland, Niko Ne Zna returns to the capital for a night of explosive Balkan brass at Vogelmorn Hall.\n\nExpect bold brass, infectious rhythms, soaring vocals, and a dancefloor that won’t quit. This nine-piece powerhouse delivers their signature high-energy performance — featuring brand new songs in preparation for their upcoming third studio album, as well as all the hits you know and love.\n\nLive Balkan brass music\n\nDelicious food available\n\nCash bar featuring local beers from Kererū Brewing, as well as wine and spirits from the Balkans\n\nA party like no other\n\nWith trumpets, saxophone, trombones, sousaphone, tapan (bass drum), snare drum, percussion, and vocals in multiple languages, Niko Ne Zna blends hypnotic melodies, driving rhythms, and theatrical flair into an unforgettable live experience. Whether on the street, in a club, or on a festival stage, their shows are part gig, part spectacle — all heart.\n\nThey’ve wowed crowds at WOMAD, featured in What We Do In The Shadows, and played to packed houses across New Zealand and Australia.\n\nCome early, grab a bite, enjoy a Kererū brew, and be part of something special.\n\n“It’s like being dropped into the hot and spicy lands of a faraway country.” — wellingtonlivemusic.com\n\n“Straight to the dancefloor.” — Elsewhere\n\n“Driving rhythms, an intoxicating effect.” — Taranaki Daily News\n\nwww.nikonezna.com"
  },
  {
    "id": "Swing Jazz Jam-The Undercurrent, Wellington-Under The Radar",
    "name": "Swing Jazz Jam",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97286-583595.jpeg",
    "venue": "The Undercurrent, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-10-17:30"
    ],
    "displayDate": "Sun 10 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97286/Swing-Jazz-Jam.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Swing into the golden age of jazz at the Swing Jazz Jam – a toe-tapping evening of classic grooves and spontaneous musical magic!\n\nFeaturing piano, guitar, double bass, and drums, this open jam invites musicians and jazz lovers alike to soak up the rhythm and energy of timeless swing.\n\nWhether you're here to play or just to sway, come down to Undercurrent on Sunday 10th August at 5:30pm. Koha entry – all welcome."
  },
  {
    "id": "Open Decks - Hosted By Gandoof-MOON, Wellington-Under The Radar",
    "name": "Open Decks - Hosted By Gandoof",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97424-528717.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-14-18:00"
    ],
    "displayDate": "Thu 14 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97424/Open-Decks---Hosted-By-Gandoof.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Moon Open Decks! DJs & producers of all experience levels are welcome to come & share their tunes ?\nWe'll be using an XDJ-RR on Moon's house soundsystem, so bring your tracks on a USB (ideally processed in rekordbox, aiff/wav or mp3), bring some friends, maybe make some new ones, or just come down for a boogie! It's always a fun, eclectic mix of genres. Free entry!\n\nGandoof is a Wellington-based DJ known for deep, genre-blending sets that move bodies and minds. Gandoof creates a welcoming space for new and seasoned selectors to share their sound. Whether it’s dubstep, techno, or beyond, Gandoof brings the vibe"
  },
  {
    "id": "Corrella Skeletons Winter Tour - Wellington-San Fran, Wellington-Under The Radar",
    "name": "Corrella Skeletons Winter Tour - Wellington",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96588-903180.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-08-15-01:01"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96588/Corrella-Skeletons-Winter-Tour---Wellington.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Corrella Skeletons Winter Tour - Wellington\n\nFriday, August 15 @ San Fran- Wellington\n\nWith special guests Valley Kids\n\nLoop, The Edge and Mai FM are stoked to present Corrella and their upcoming Skeletons Winter Tour!\n\nAfter a massive summer of festivals and touring alongside L.A.B across Aotearoa and Australia, Corrella are hitting the road this August for their biggest headline tour yet — bringing their new album Skeletons to the stage for the very first time.\n\nSkeletons marks the next chapter for the band as they continue to cement their place in the New Zealand and Australian music scenes. The album follows their breakout debut Road From 26, which featured the sleeper hit Blue Eyed Māori—a track that now holds the record for the most weeks ever spent at Number One on the NZ Singles Chart.\n\nSince their debut, Corrella have sold out shows nationwide, become festival favourites, and picked up multiple Aotearoa Music Awards and Waiata Māori Music Awards.\n\nThis run of shows will be their biggest headline tour to date. See Corrella live as they hit the road in August for their Skeletons Winter Tour taking on Auckland's Tuning Fork, Hamilton’s Factory, Wellington’s San Fran, Christchurch’s The Church & Dunedin’s Erricks, presented by Loop. Support for each show to be announced.\n\nPresented by Loop, Mai, The Edge, with thanks to Mānuka Phuel.\n\nTickets are on sale 10am Wednesday 28 March from Loop.co.nz"
  },
  {
    "id": "Monthly Jazz Night: Lisa Tomlins-Thistle Inn, Wellington-Under The Radar",
    "name": "Monthly Jazz Night: Lisa Tomlins",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97007-960198.jpg",
    "venue": "Thistle Inn, Wellington",
    "coordinates": {
      "lat": -41.2776965,
      "long": 174.7796332
    },
    "dates": [
      "2025-08-15-19:00"
    ],
    "displayDate": "Fri 15 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97007/Monthly-Jazz-Night-Lisa-Tomlins.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Experience an unforgettable Friday night at The Thistle Inn with our Jazz Special! We're thrilled to have the remarkable Lisa Tomlins back on stage, ready to captivate you with her mesmerising talent and stunning vocals.\n\nPrepare for a night filled with soulful melodies and irresistible rhythms, as Lisa's beautiful sound fills the room and sets the perfect ambiance for an evening to remember.\n\nMark your calendars for a jazz-filled night you won't want to miss!"
  },
  {
    "id": "Dave Against the Machine - Take the Power Back Tour-Valhalla, Wellington-Under The Radar",
    "name": "Dave Against the Machine - Take the Power Back Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96872-547611.jpeg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-16-21:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96872/Dave-Against-the-Machine---Take-the-Power-Back-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "By popular demand………..we are back in 2025!!!\n\nThe Ultimate Rage Against The Machine Experience: DAVE AGAINST THE MACHINE. Delivering their world class show with all the aggression, power and passion of the original band.\nIf you love Rage Against the Machine, you will LOVE this band."
  },
  {
    "id": "Sue Dyson - Welcome To Our Lounge Tour - 16 August-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "Sue Dyson - Welcome To Our Lounge Tour - 16 August",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96920-502099.jpeg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-16-19:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96920/Sue-Dyson---Welcome-To-Our-Lounge-Tour---16-August.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Featuring songs from Linda Ronstadt & Carole King\nGate opens 6.30pm Music Starts 7pm Saturday 16 August 2025\nSue Dyson, a gifted vocalist known for her warm and captivating stage presence, backed by talented pianist Mitch Dean to offer an extraordinary musical experience that celebrates the enduring legacies of Linda Ronstadt and Carole King. Set in Hilltop's laid-back intimate atmosphere, their performances promise an engaging experience where the audience will tap their feet to the classics that have defined generations. Sue has graced the stage of New Zealand's 'Good Morning Show' multiple times, showcasing her vocal prowess and musical versatility. Additionally, Sue has lent her voice as a backup vocalist at the prestigious New Zealand Music Awards and has enjoyed significant success with her original country music in Australia.\nMitch Dean complements Sue's voice with his extensive expertise as a guitarist and pianist, cultivated over more than 20 years of performing in diverse musical settings. Notably, he played keys and guitar in the acclaimed Wellington Fleetwood Mac Experience, contributing to their successful tour. Mitch’s deep understanding of music, combined with his skillful instrumentation, enriches the duo's sound and enhances the overall performance.\nTogether, Sue and Mitch create a harmonious blend of nostalgia and artistry, celebrating the timeless contributions of Ronstadt and King. Their performances promise to be an unforgettable evening of music that not only bridges generations but also stirs the soul, inviting audiences to revel in the rich tapestry of these legendary artists' works. Join them for a memorable experience that resonates long after the final note has been played.\nNot for profit, supporting our dedicated musicians. Suggested donation $30\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Orangefarm and Warm Regards-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "Orangefarm and Warm Regards",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97033-799585.jpeg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-16-20:00"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97033/Orangefarm-and-Warm-Regards.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Orangefarm and Warm Regards Live at Vogelmorn Upstairs.\n\nVogelmorn Upstairs comes alive on Saturday 16 August with an electric double bill featuring local favourites Warm Regards and Orangefarm.\n\nWarm Regards is a band that epitomizes style, comfort, economy, and power — a sleek sedan equally at home on the racetrack or with the family bundled safely in the back. Blending indie rock, pop, folk, and jazz-country flair, their infectious sound and high-energy performances have earned them a dedicated local following. With frontman Tom Watson (Cassette, Terror of the Deep, HLAH) leading the charge, Warm Regards deliver introspective lyrics, tight grooves, and lush harmonies that promise an unforgettable live experience.\nOrangefarm brings a distinct mix of shimmering guitars, melodic hooks, and lyrical wit that’s become their signature sound. Known for their dynamic sets and warm stage presence, the band has quietly carved out a niche as one of Wellington’s most engaging live acts.\nDon’t miss this night of standout local talent in the intimate upstairs space at Vogelmorn. Doors from 7:00 PM. Music starts 8:00PM or earlier if you’re there!"
  },
  {
    "id": "Hihi & The Stitchbirds - On A Good Day - EP Launch-MOON, Wellington-Under The Radar",
    "name": "Hihi & The Stitchbirds - On A Good Day - EP Launch",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97398-975642.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-08-16-19:30"
    ],
    "displayDate": "Sat 16 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97398/Hihi--The-Stitchbirds---On-A-Good-Day---EP-Launch.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Come celebrate Hihi & The Stitchbirds' first EP - On a Good Day - an exploration of love, and loss, and the pieces in between.\n\n7:00pm - Doors\n\n7:30pm - The Bidibids\n\n8:30pm - Hihi & The Stitchbirds\n\nAfter a whirlwind 18 months as a five-piece folk band, Hihi & The Stitchbirds are delighted to release their debut EP with five original songs that will make you feel soothed and seen. Written by band members Tess Luff, Elena Saunders and Ellie Stewart, this group of talented musicians invite you into contemplative corners of their brains with a set of gentle and jovial numbers that will entertain and delight.\n\nThey will be joined on stage by their friends the Bidibids.\n\n\nAbout Hihi & The Stitchbirds:\n\nHihi & The Stitchbirds are an exciting five-piece musical experiment, based in Te Whanganui-a-Tara. Pairing rich vocal harmonies with vibrant original music inspired by the folk and Americana playbooks, this band brings something for everyone.\n\nHihi & The Stitchbirds are:\nElena Saunders - vocals and vibes\nChris Goldsbury - guitar, clarinet and vocals\nTess Luff - guitar, banjo uke and vocals\nMatt Hutton - bass uke and vocals\nEllie Stewart - fiddle and vocals\n\n\nAbout the Bidibids:\n\nWith lush harmonies, intricate arrangements, and beguiling melodies, the Bidibids explore what it means to play folk music in New Zealand. The Bidibids are Sarah August on banjo and guitar, Simon Carryer on cello-banjo, and Brendan Schenk on mandolin and guitar. The trio came together at the 2020 Wellington Folk Festival, where they were each supposed to be playing in different groups. Since then, the Wellington-based band have become regulars at some of the region’s best venues for folk music, including the Mussel Inn, Moon, and the Wellington Bluegrass Society.\n\nDriven by Sarah’s honest, intimate songwriting and Brendan’s blazing musicianship, the Bidibids balance soulful ballads that will tug your heart-strings with upbeat numbers which will get your toes tapping. Influenced by American bluegrass and folk bands like Watchhouse and Nickel Creek, they’re also inspired by local acts like the Eastern and Marlon Williams who are forging an authentic New Zealand folk tradition. You can listen to the Bidibids' debut EP here: https://open.spotify.com/album/6Q8HW5g0FzDl3VYz44OZU5?si=4gIRmfaRSiOUlgxJnVUbuw."
  },
  {
    "id": "Goodnight Kiwis: Live Lullabies And Anthems-Fringe Bar, Wellington-Under The Radar",
    "name": "Goodnight Kiwis: Live Lullabies And Anthems",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97376-165346.jpg",
    "venue": "Fringe Bar, Wellington",
    "coordinates": {
      "lat": -41.2933007,
      "long": 174.7820939
    },
    "dates": [
      "2025-08-17-19:30"
    ],
    "displayDate": "Sun 17 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97376/Goodnight-Kiwis-Live-Lullabies-And-Anthems.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Grab your blankets, for our beloved leader is going to put us to bed, with a tuck-in and all ♡\n\nAn acoustic & sincere evening of music. Covering tunes from Dave Dobbyn, to Nicki Minaj & Barney the Dinosaur, this is a time for rest, peace and some late night giggles.\n\nThere are two shows, on the 17th & 19th of August\n\nTickets on Eventfinda at the link below"
  },
  {
    "id": "Jenny Mitchell - The Forest House Tour-Old St Paul's, Wellington-Under The Radar",
    "name": "Jenny Mitchell - The Forest House Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97058-450808.jpg",
    "venue": "Old St Paul's, Wellington",
    "coordinates": {
      "lat": -41.2762651,
      "long": 174.7803602
    },
    "dates": [
      "2025-08-18-20:00"
    ],
    "displayDate": "Mon 18 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97058/Jenny-Mitchell---The-Forest-House-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Presented by Strung Out Touring\n\nJenny Mitchell - The Forest House Tour\n\nAfter opening for Kasey Chambers around Australia, award-winning songwriter Jenny Mitchell returns home for a national tour celebrating her acclaimed album Forest House.\n\nAn Aotearoa Music Award Winner and 2 x Australian Golden Guitar nominee, Jenny is a gifted storyteller from the deep south of New Zealand. Now based in Melbourne, the AU Review describes Jenny’s music as a “sublime slice of folk” and her new highly anticipated album, Forest House, is capturing fans across the motu and the globe.\n\n“Forest House - 10/10,” Newstalk ZB\n\nEvery so often, an artist emerges who has everything it takes to reach the pinnacle of country music success. Jenny Mitchell is a star.” Country Music Capital News\n\nJenny is thrilled to welcome very special guest Katie Thompson to The Forest House Tour. Hailing from New Zealand’s West Coast, Katie is a captivating alt-country artist known for her soul-stirring storytelling and rich, emotive voice. A 2024 finalist for Best Country Song, Katie has shared stages with legends like Sir Elton John and Don McLean, leaving lasting impressions with her raw honesty and polished edge.\n\nWELLINGTON\n? Old St Paul's\n? Sunday 18 August\n⏰ Doors open at 7pm\n? Support from Katie Thompson\n\nNZ TOUR DETAILS\nSAT 17 AUGUST - Errick's Venue, Dunedin\nSUN 18 AUGUST - Old St Paul's\nTHURS 21 AUGUST - The Piano, Christchurch\nFRI 22 AUGUST - The Tuning Fork, Auckland\n\nFor more information please visit www.jennymitchell.co.nz.\n\nABOUT JENNY MITCHELL\nNZ Best Country Artist Winner and 2 x Golden Guitar nominee, Jenny Mitchell, is a storyteller from the deep south of New Zealand with impactful songs full of grace and grit. Her last album ‘Tug of War’ included the pivotal release of the 2022 APRA NZ Best Country Song ‘Trouble Finds a Girl’ and was described by Rolling Stone as an album, “worthy of every award it will inevitably collect.”\n\nNo stranger to the road, Jenny was recently awarded a scholarship to perform at Nashville’s iconic AmericanaFest and has toured Australia and New Zealand extensively over the last decade - supporting artists including Fanny Lumsden (AU), Tami Neilson (NZ) and Nadia Reid (NZ) along the way. Her most recent touring project, The Bush & the Birds Tour, travelled throughout NZ in support of conservation organisation; Forest & Bird. An ode to her late Grandfather’s love of the land, the tour generated over $2000 in donations for Forest & Bird.\n\nJenny grew up in a home and family of music and often tours with her sisters, The Mitchell Twins, and country music loving Dad, Ron Mitchell. After growing up with a musical diet of The Chicks, Hank Williams and Dolly Parton, Jenny penned her first songs at the age of 11 after a trip to Ireland where she connected with her Irish heritage and explored the immigration story of her Irish born Grandparents. A few years down the track, Jenny performed original work on the TV show New Zealand's Got Talent, was placed 3rd and went onto crowdfund and release her first album at the age of 15. In 2017, she was crowned the overall winner of the NZ Gold Guitar Awards which kickstarted the professional chapter of her career, leading to her Aotearoa Music Award Winning album 'Wildfires’ produced by Tasmania’s Matt Fell.\n\nWith a sound that No Depression describes as, “poetry that dominates a beautiful melody,” Jenny Mitchell is comfortable with a country twang or softly spoken ballad and is rapidly capturing fans across the globe."
  },
  {
    "id": "BØLZER-Valhalla, Wellington-Under The Radar",
    "name": "BØLZER",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/bolzerPressPoster2025.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-20-01:01"
    ],
    "displayDate": "Wed 20 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97050/BLZER.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An intuitive art project born from raw passion; musical ecstasy fueled by impulsive composition and enactment. BØLZER describe their own stage experience as a form of spiritual rapture, an atavis-tic vortex woven together from the profound union of spectacle meeting spectator on a deeper plane.\n\nTags: Bolzer"
  },
  {
    "id": "Charity Event- This Silent Divide, Rain, Electric Tapestry, Los Punkys-The Welsh Dragon, Wellington-Under The Radar",
    "name": "Charity Event- This Silent Divide, Rain, Electric Tapestry, Los Punkys",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96771-538325.jpg",
    "venue": "The Welsh Dragon, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-22-20:00"
    ],
    "displayDate": "Fri 22 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96771/Charity-Event--This-Silent-Divide-Rain-Electric-Tapestry-Los-Punkys.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Charity event for Compassion Soup Kitchen - koha entry or a can of food for vulnerable people in our community.\n\nFeaturing:\nTHIS SILENT DIVIDE\nRAIN & THE URBAN BOHEMIANS\nELECTRIC TAPESTRY\nLOS PUNKYS\n@ the iconic Welsh Dragon!"
  },
  {
    "id": "The Music Video Showcase-Newtown Community Centre, Wellington-Under The Radar",
    "name": "The Music Video Showcase",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97236-487674.jpg",
    "venue": "Newtown Community Centre, Wellington",
    "coordinates": {
      "lat": -41.3125737,
      "long": 174.7786303
    },
    "dates": [
      "2025-08-23-19:30"
    ],
    "displayDate": "Sat 23 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97236/The-Music-Video-Showcase.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An evening of music video exploration!\n\nThe Music Video Showcase presents a curated screening of locally made music videos of all styles, music genres, budgets and release dates, each followed by an open-floor discussion with special guests from behind (and in front of) the lens\n\nEnjoy music videos on the big screen and hear the stories that shaped them\n\nSpecial guests to be announced\n\nDoors 7pm\nVideos 7.30pm\n\nDrinks can be purchased from the bar (no BYO)\nPlease bring cash - no EFTPOS available\n\nThe Music Video Showcase is kindly supported by The Image Gig Guide\n\nThe Newtown Community Centre Theatre is wheelchair accessible with an accessible wharepaku"
  },
  {
    "id": "The Wellington City Shake-em-on-Downers-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "The Wellington City Shake-em-on-Downers",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97399-740601.jpg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-23-21:30"
    ],
    "displayDate": "Sat 23 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97399/The-Wellington-City-Shake-em-on-Downers.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "From amidst the wreckage of our capitalist wasteland they rise, like a phoenix soaring through a bowl of molasses... The Wellington City Shake-em-on-Downers ARE BACK proving themselves to be the most resilient life form on the planet, giving even the cockroaches a run for their money. Middle New Zealand's favourite dadaist swing cult phenomenon are back with a vengeance, serving up a fiery primordial soup of fresh tunes for your listening and dancing 'pleasure'. Prepare for the stupidest gags, hottest horn solos, stonkiest grooves and pea-brained banter as we reign supreme in the battle of wits and people's attention against the existential crisis rectangle, otherwise know as the iPhone. Don't miss this exuberant show, or you may regret it for the rest of your miserable life.\n\n----------------------------------------\n\nGeneral Admission: $15 +BF ($20 on the door)\nStudents/Unwaged: $10 +BF ($15 on the door)\n\nLIVE at The Rogue & Vagabond, Wellington - Saturday 23rd August.\n\n----------------------------------------\nFacebook:\nhttps://www.facebook.com/ShakeemonDown\nYoutube:\nhttps://www.youtube.com/channel/UCCX29VHaEGi9ZxRZX20aQIQ\nBandcamp:\nhttps://shake-em-on-down.bandcamp.com/album/on-the-menu"
  },
  {
    "id": "Greta O'Leary - River Dark Album Release Tour-Sacred Heart Church, Featherston, Wellington-Under The Radar",
    "name": "Greta O'Leary - River Dark Album Release Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97298-464248.jpg",
    "venue": "Sacred Heart Church, Featherston, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-23-19:30"
    ],
    "displayDate": "Sat 23 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97298/Greta-OLeary---River-Dark-Album-Release-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "This August 23rd join alt-folk songwriter Greta O'Leary (trio) for one intimate and special show at Sacred Heart Church, Greytown, performing O’Learys debut record 'River Dark'.\n\n‘A folk-rooted aesthetic that feels almost gothic’ (RNZ).\n\nTaking her brand new album on tour for the first time this winter, Greta O'Leary performs 'River Dark' across the motu in celebration of its release. 'River Dark' is O'Leary's debut. ‘Tender, steadfast and unraveling’, it shot to #9 on the Aotearoa Official Albums Chart, features the SRN #1 singles 'Baby I'm a Singer' and 'Baptised at the Desktop Computer' and has been featured by RNZ, the SRN and Rolling Stone Magazine. O’Leary will be joined in Pōneke by her trio, Amy Borovich (HINA, Anna Coddington) and Nava Tekela-Pule (Erny Belle, LEAO).\n\nTāmaki Makaurau singer-songwriter and musician GRETA O'LEARY writes with clarity of vision, making introspective observations that seamlessly interlock with her spare, spacious and enthralling songcraft. Through soaring instrumentation, astute and occasionally absurd lyrics of self-reflection and her poignant voice, her debut is ‘slightly spooky, wryly funny, and expertly written’ (Tony Stamp).\n\nCelebrated local songwriter GRETA O'LEARY is releasing her highly anticipated debut album RIVER DARK. The obscure, dreamlike record was created alongside producer Jol Mulholland at LAB Studios, with Greta's hypnotic songwriting and unmistakable vocals accentuated through the skillful musicianship of instrumentalists Cass Basil (Tiny Ruins, The Veils), Alastair Deverick (Boycrush), Callum Passells (Hans Pucket) and Anita Clark (Motte). Listeners are invited deeper into Greta’s immersive and enthralling world.\n\n“My first record, a collection of personal, ridiculous and truth telling songs. It took a long time to get here. I was a child shy and unclear, completely confused, absolutely not onboard with future, with goals or activity. I was in the field below the house, I was at the pond with the dog, I played make believe longer than most. I was taught to be quiet.”\n\n*****************************************\n\nRiver Dark the album - https://music.drm.co.nz/river-dark\n\nBaby I’m a Singer Music Video (Greta O’Leary) -\nhttps://youtu.be/Wjy8xmq6JKs?si=c5xnXtxQ6-Yfzk5x\n\nGreta O'Leary Tour Dates\n16 August - Auckland Guide Hall - Auckland\n22 August - Secret Show - Whanganui*\n23 August - San Fran - Wellington*\n24 August - Sacred Heart - Greytown*\n30 August - Stewart St - Raglan*\n31 August - Leigh Sawmill - Leigh\n3 September - Dawn - Ōakura*\n4 September - Hamilton - Last Place\n* (trio show)\n\nTickets $25\nTo reserve your tickets email: commonground.wai@gmail.com"
  },
  {
    "id": "Greta O'Leary And Goodnight My Darling - River Dark Album Release Tour-San Fran, Wellington-Under The Radar",
    "name": "Greta O'Leary And Goodnight My Darling - River Dark Album Release Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97297-289392.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-08-24-18:00"
    ],
    "displayDate": "Sun 24 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97297/Greta-OLeary-And-Goodnight-My-Darling---River-Dark-Album-Release-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "This August 24th join alt-folk songwriter Greta O'Leary & Te Whanganui a Tara artist Goodnight My Darling for one intimate and special show at San Fran, performing new and recently released works in celebration of emergence and O’Learys debut record 'River Dark'. ‘A folk-rooted aesthetic that feels almost gothic’ (RNZ). Taking her brand new album on tour for the first time this winter, Greta O'Leary performs 'River Dark' across the motu in celebration of its release.\n\n'River Dark' is O'Leary's debut. ‘Tender, steadfast and unraveling’, it shot to #9 on the Aotearoa Official Albums Chart, features the SRN #1 singles 'Baby I'm a Singer' and 'Baptised at the Desktop Computer' and has been featured by RNZ, the SRN and Rolling Stone Magazine. O’Leary will be joined in Pōneke by her trio, Amy Borovich (HINA, Anna Coddington) and Nava Tekela-Pule (Erny Belle, LEAO).\n\nTāmaki Makaurau singer-songwriter and musician GRETA O'LEARY writes with clarity of vision, making introspective observations that seamlessly interlock with her spare, spacious and enthralling songcraft. Through soaring instrumentation, astute and occasionally absurd lyrics of self-reflection and her poignant voice, her debut is ‘slightly spooky, wryly funny, and expertly written’ (Tony Stamp).\n\nCelebrated local songwriter GRETA O'LEARY is releasing her highly anticipated debut album RIVER DARK. The obscure, dreamlike record was created alongside producer Jol Mulholland at LAB Studios, with Greta's hypnotic songwriting and unmistakable vocals accentuated through the skillful musicianship of instrumentalists Cass Basil (Tiny Ruins, The Veils), Alastair Deverick (Boycrush), Callum Passells (Hans Pucket) and Anita Clark (Motte). Listeners are invited deeper into Greta’s immersive and enthralling world.\n\n“My first record, a collection of personal, ridiculous and truth telling songs. It took a long time to get here. I was a child shy and unclear, completely confused, absolutely not onboard with future, with goals or activity. I was in the field below the house, I was at the pond with the dog, I played make believe longer than most. I was taught to be quiet.”\n\n*****************************************\n\nGoodnight My Darling is the vision and project of up and coming Te Whanganui a Tara based singer-songwriter Maxine Macaulay. With elements of shoegaze, folk and dreamy melody, Macaulay says her ever evolving vibe is a poetic expression of her life and the places around her. Her songs take you on a cinematic journey, while her ethereal vocals lull you into a quiet sense of peace and appreciation. Her 2022 nine-track self-titled album, is a mix of soul-stirring tunes including ode to love, loss and rebirth ‘The Carriage’, ‘Until I Return’ and the story of a relationship’s end in ‘The Trees Have Eyes’.\n\nSince 2022 GMD has released singles ‘Ruby’ and ‘The Empress’ speaking to\ncreative repression, Motherhood and female empowerment. Joining her for her first show since becoming a Mother are band Mitch Kirk, Kim Andrews, Bella Florence and Shaun Blackwell (Hemi Hemingway & John the Baptist). With plans to further morph and develop her experiential sound, Goodnight My Darling is certainly one to watch.\n\nDoors: 5.30PM\nShow: 6.00PM\nSeated show\n\nRuby Music Video (Goodnight My Darling) -\nhttps://youtu.be/hTrQ57GzfWY?si=ygDovdkrXZQhyAqe\n\nRiver Dark the album - https://music.drm.co.nz/river-dark\n\nBaby I’m a Singer Music Video (Greta O’Leary) -\nhttps://youtu.be/Wjy8xmq6JKs?si=c5xnXtxQ6-Yfzk5x\n\nGreta O'Leary Tour Dates\n16 August - Auckland Guide Hall - Auckland\n22 August - Secret Show - Whanganui*\n23 August - San Fran - Wellington*\n24 August - Sacred Heart - Greytown*\n30 August - Stewart St - Raglan*\n31 August - Leigh Sawmill - Leigh\n3 September - Dawn - Ōakura*\n4 September - Hamilton - Last Place\n* (trio show)\n\nTickets from Moshtix.co.nz"
  },
  {
    "id": "Danica Bryant + The Band: The Feast Tour-Valhalla, Wellington-Under The Radar",
    "name": "Danica Bryant + The Band: The Feast Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96901-294045.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-28-20:30"
    ],
    "displayDate": "Thu 28 Aug",
    "url": "https://www.undertheradar.co.nz/gig/96901/Danica-Bryant--The-Band-The-Feast-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Join the 'Feast' with Danica Bryant and her iconic three-piece not-a-girl-band! This live show celebrating the release of Bryant's debut album is the band's third national tour, sure to be a pop-rock party for the ages.\n\nA pop-folk singer-songwriter with a gritty rock-edge, Danica Bryant's music tackles provocative themes from celebrity culture to neurodiversity through an unabashedly queer feminist lens.\n\nHer “playful indie pop” (Rolling Stone) has seen her open for legends like Elton John and Robbie Williams, hit #2 on the NZ Hot Singles Chart with her 2024 release ‘Acid’, and undergo mentorship with Kiwi icon Bic Runga. Performing alongside Tyler Blythe and Nat Bennett as a three-piece not-a-girl-band, Bryant has undergone multiple successful New Zealand tours and played festivals including Gardens Magic, Outfield and Cuba Dupa.\n\nWith her “venomous yet passionate” debut album (Ambient Light), Danica is an unabashedly fresh voice on the pop music scene. This is a meal you don't want to miss.\n\nWELLINGTON SUPPORT FROM KINGSTON ROSE"
  },
  {
    "id": "Agatha Pantha and BDSN With A Side Of Don And Beans-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "Agatha Pantha and BDSN With A Side Of Don And Beans",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97143-986574.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-29-19:30"
    ],
    "displayDate": "Fri 29 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97143/Agatha-Pantha-and-BDSN-With-A-Side-Of-Don-And-Beans.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Expect the unexpected from Wellington-based Agatha Pantha - a folk/rock four-piece whose sounds range from bouncing rhythms to dark, tangled ballads to anthemic rock numbers. Fronted by singer and ukelele player Mo Blishen, and filled out with Kent Hogan on guitar, Nik Straughier on bass and Sam King on drums, Agatha Pantha is the product of four unlikely allies joined by musical fortitude and lived experience, here to provide a therapeutic soundtrack to the every day.\n\nJoining them are fellow Wellington Band BDSN, fronted by Nigel Parry. Satirical songs with a hard edge and soft centre, a bit like a box of chocolates. Joined by Scott Pilgrim, Darrel Greaney and Ben McHardy.\n\nSpecial guests Don and Beans provide folky ballads of love and loss to start the night off.\n\nSomething for everyone."
  },
  {
    "id": "Tribute Fest-Wildkiwi Distillery, Upper Hutt, Wellington-Under The Radar",
    "name": "Tribute Fest",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97121-513314.jpg",
    "venue": "Wildkiwi Distillery, Upper Hutt, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-08-29-23:30"
    ],
    "displayDate": "Fri 29 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97121/Tribute-Fest.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "? TRIBUTE FEST – UPPER HUTT'S HARD ROCK + METAL NIGHT ?\nFRIDAY 29TH AUGUST | FROM 6PM\nWILDKIWI DISTILLERY\n\nGet ready for a full-throttle night of chaos, distortion and anthems at WildKiwi Distillery – as Rail Records unleashes the first ever Upper Hutt TRIBUTE FEST, a high-voltage tribute to the gods of rock, metal, punk and industrial.\n\nSLIPKNOT – by The Feeders\nTHE PRODIGY – by The Firestarters\nNIRVANA – by The Neverminds\nGREEN DAY – by GreenGaze\nMARILYN MANSON – by The Antichrist Superstar\n\nPLUS a full-noise performance from heavyweights KAOSIS.\n\nSupported by two of Aotearoa's top rock and metal DJs.\nDJ ApenuT (Nu Metal)\nDJ Subpop (Grunge)\n\nWall to wall riffs, raw energy, and nothing but attitude. This is the hard rock night Upper Hutt’s been waiting for.\n\nThis is your chance to scream along to every word, throw horns with the crowd, and tear it up with a room full of legends.\nDon’t miss out – Tribute Fest is going to go off.\n\nR18"
  },
  {
    "id": "Riot Fest: Wellingtons Ultimate Tribute Party-Valhalla, Wellington-Under The Radar",
    "name": "Riot Fest: Wellingtons Ultimate Tribute Party",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97226-262213.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-08-30-01:01"
    ],
    "displayDate": "Sat 30 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97226/Riot-Fest-Wellingtons-Ultimate-Tribute-Party.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Get ready for Wellington's ultimate tribute party as RIOT FEST brings together the most explosive tribute acts under one roof! This high-energy night celebrates the biggest names in rock, metal, punk, and grunge with authentic performances that will transport you straight to the mosh pit.\n\nFeatured Tribute Acts:\n\n•KAOSIS - Nu-Metal Party Band\n\n•SLIPKNOT Tribute by The Feeders\n\n•THE PRODIGY Tribute by The Firestarters\n\n•NIRVANA Tribute by The Neverminds\n\n•GREEN DAY Tribute by Greendaze\n\n•MARILYN MANSON Tribute by The Anti-Christ Superstar\n\nPlus Special Guest DJs:\n\n•DJ Apernut (Nu-Metal)\n\n•DJ Suddop (Grunge)\n\nExperience the raw energy and iconic sounds of legendary bands brought to life by Wellington's finest tribute musicians. From Slipknot's crushing metal to Nirvana's grunge anthems, Green Day's punk rock energy to The Prodigy's electronic chaos - this is one night that promises to deliver non-stop headbanging action.\n\nTickets (exc Gst + BF)\n\n•Early Bird: $20\n\n•General Admission: $30\n\n•Door Sales: $40\n\n•Available online at railtix.net\n\nPresented by Rail Records, Women's Refuge, Bloodblast Distribution & Heavy Mag\n\nDon't miss Wellington's most anticipated tribute party of the year - where legendary music lives on!\n\nTerms:\n\nR18. No Refunds. In the unforeseen event that an act withdraws from the lineup, the Promoter reserves the right to replace the withdrawn act with a substitute act of equal or greater value."
  },
  {
    "id": "Buffalo, Buffalo, Buffalo - An Ias Cushion Concert-Inverlochy Art School, Wellington-Under The Radar",
    "name": "Buffalo, Buffalo, Buffalo - An Ias Cushion Concert",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97374-841999.jpg",
    "venue": "Inverlochy Art School, Wellington",
    "coordinates": {
      "lat": -41.2941697,
      "long": 174.7700143
    },
    "dates": [
      "2025-08-31-17:00"
    ],
    "displayDate": "Sun 31 Aug",
    "url": "https://www.undertheradar.co.nz/gig/97374/Buffalo-Buffalo-Buffalo---An-Ias-Cushion-Concert.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "IAS Cushion Concerts presents local bands in the intimate environment of historic Inverlochy House.\n\nThis August join us for 'songs of road trips, relationships and reality tv' with Buffalo, Buffalo, Buffalo.\n\nThis seven-piece herd of instrument addicts play a mix of electronic and acoustic to produce pop-rock that is equal parts playful, whimsical and catchy.\n\nThe group have been playing together for two years and have an EP on the way.\n\nFree entry for tamariki and no worries if cushion's aren't your thing - we have chairs!\n\n\nNgā mihi nui to our friends at Wellington City Council for sponsoring our 2025 Cushion Concert series,"
  },
  {
    "id": "The Grogans 'Stagger' NZ Tour 2025-San Fran, Wellington-Under The Radar",
    "name": "The Grogans 'Stagger' NZ Tour 2025",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96635-977362.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-09-05-20:30"
    ],
    "displayDate": "Fri 05 Sep",
    "url": "https://www.undertheradar.co.nz/gig/96635/The-Grogans-Stagger-NZ-Tour-2025.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Ready to take these new tracks on the road, The Grogans new album Stagger is\nout, plus the band are excited to announce a headline tour across New Zealand.\nExploring another side of The Grogans' music, Stagger is a patchwork of different\nsounds and sonic inspirations that all come together in the one album, it came\nfrom this idea that it was a jagged and stylistically different album track to\ntrack, explain The Grogans.\nKicking off their tour at Loons in Christchurch on Wednesday 3 September, the\nband then head to Yonder in Queenstown on Thursday 4 September, San Fran in\nWellington on Friday 5 September before wrapping up at Double Whammy\nAuckland on Saturday 6 September. Prior to their Aotearoa dates, the trio will also\nbe playing a seven date tour throughout Australia along with stops in LA and New\nYork for North American shows this June.\n\nCapturing the magnetic energy of their live shows, Stagger touches on themes of\nmental health, taking care of yourself and your loved ones, the occasional love song,\nand more. As the catchy chorus first single and album opener ‘Oh Boy’ leads into\nsonic powerhouse of a tune ‘Come Up (Goes Down)’, ‘In My Heart’ slows it down to\na new easy listening direction, followed by ‘Have a Little Dream’ - as dreamy as the\ntitle suggests - and the big open echoed instrumentation of ‘Once In A While’.\nAdding new textural effects in ‘Roll Back’ and last single ‘Roundabout’, ‘Happier\nMan’ dips into a heavier psych realm with a reminder that striving to be a better\nand happier person should be a goal for everyone. ‘Worry About Everything’\nis an upbeat tune sure to have you worrying about nothing, and feel good album\ncloser ‘All My Days’ ends on a more serious note that outlines the beauty and the\nbeast of live music and the personal struggles that come with the lifestyle and\ntouring.\n\nMixing on the road definitely added something different to this album.\nUsually, I’m in the same spot whilst mixing and can come and go from each\ntrack mentally, but this time the album was attached to us at the hip. We would\nbring a set up through most of America and record/mix in green rooms and on\nthe bandwagon. It was definitely worth it, as we had to work with what we had\nto finish the album. Only being able to reference mixes on headphones and\nJBL speakers towards the end of the album process was definitely harder than\nin a studio. However, as a band, we have never really been able to sit still, so it\nworked nicely. Each mix has its own personality, and I guess that’s what we\nwanted for this staggered album. - The Grogan’s Quin Grunden on mixing and\nengineering the album on the road across the US & Canada through June-July 2024.\n\nStream Stagger Album: https://thegrogans.lnk.to/stagger\n\nIncluded in Rolling Stone’s Future of Music 2025 and described by triple j as 'one\nof the most consistently hardworking live acts in the country’, The Grogans\ncommitment to making incredibly varied, distinct music, sharing good experiences at\ntheir live show and genuine elation on playing together is clear to see and explains\nwhy they are one of Australia’s brightest bands. In recent years, they have delighted\ntheir international fans with a headline 2024 tour across Europe, Ireland, and the UK,\na stop at the Netherlands’ Misty Fields Festival, joining Ocean Alley on their North\nAmerican Summer Tour, and more. Never ones for slowing down, 2024 was filled\nwith local shows, sharing the stage with Teen Jesus and The Jean Teasers for their\n‘Fix It With Salt’ tour, and a 5th anniversary tour of their LP ‘Just What You Want.\n\nTickets for all dates go on sale Wednesday 28 May at midday."
  },
  {
    "id": "Great Sounds Great Festival 2025-Multiple venues across the Cuba Street precinct, Wellington-Under The Radar",
    "name": "Great Sounds Great Festival 2025",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96878-765180.jpg",
    "venue": "Multiple venues across the Cuba Street precinct, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-09-06-16:00"
    ],
    "displayDate": "Sat 06 Sep",
    "url": "https://www.undertheradar.co.nz/gig/96878/Great-Sounds-Great-Festival-2025.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Eyegum Music Collective presents GREAT SOUNDS GREAT, a multi-venue music and arts festival taking over Pōneke's Cuba Street precinct for one night only on Saturday 6 September 2025. Showcasing 40 of Aotearoa's best artists across 10 neighbouring venues, this is one big party you shouldn't miss.\n\nEyegum has worked hard to curate a programme that is sure to offer something for everyone, from first time gig-goers to seasoned live music obsessives. The eclectic lineup includes perennial indie maestros The Bats, capital hometown heroes The Phoenix Foundation, hip hop superstar JessB, troubadour-turned-party starter Anthonie Tonnon, captivating genre-bender Reb Fountain, the incredible local-by-way-of-Naarm Jen Cloher, plus a selection of up-and-coming artists handpicked from Eyegum's Free Wednesday weekly showcase series, and everything in between. There will also be plenty more to be announced soon.\n\nExcitingly for 2025, we will be adding three new venues: St Peter's on Willis, Flying Nun Records and 13 Garrett Street (sponsored by Radio Active), as well as a travelling electronic stage curated by Tonic Collective. This means more artists and music to experience in a variety of special and unique spaces throughout the night.\n\nTicket holders will receive a wristband that will give them access to each of the participating venues throughout the event. Information on how to pick up wristbands will be provided to ticket holders closer to the time.\n\nTickets are on sale now at eyegum.co.nz/great-sounds-great\n\nWhen: from 4pm Saturday 6 September 2025\nWhere: San Fran, Meow, Valhalla, Rogue & Vagabond, Bedlam & Squalor, Hotel Bristol (2 stages), St Peter's on Willis, Flying Nun Records, 13 Garrett St\nWho: The lineup will include Anthonie Tonnon, Baby Zionov, Bad Taste, BADTAB, Baeoli, Bathysphere, The Bats, By A Damn Sight, Cindy, Eveline Breaker, Goya, Half/Angel, Hans Pucket, Iris Little, Jazmine Mary, Jen Cloher, JessB, JHL, Jim Nothing, Jordan Hamel, Leah Dodd, LEAO, Louisa Nicklin, The Phoenix Foundation, Reb Fountain, Rebecca Hawkes, Shayne P Carter (solo), Sig Wilder & Friends, Sofia Machray, Space Bats, Attack!, The Spectre Collective: live-scored cinema, Star Time, plus more artists to be announced soon."
  },
  {
    "id": "Shaun Kirk - New Zealand Tour 2025-The Petone Depot, Lower Hutt, Wellington-Under The Radar",
    "name": "Shaun Kirk - New Zealand Tour 2025",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/95253-257874.jpg",
    "venue": "The Petone Depot, Lower Hutt, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-09-10-19:30"
    ],
    "displayDate": "Wed 10 Sep",
    "url": "https://www.undertheradar.co.nz/gig/95253/Shaun-Kirk---New-Zealand-Tour-2025.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Hailing from the music-filled streets of Melbourne, Australia, Shaun Kirk is an award-winning blues and soul troubadour recognized for his exceptional talent as a born entertainer. His unique talent has not only earned him many accolades but also much praise from fellow artists, such as three-time Grammy Award Winner Fantastic Negrito, who has declared his show as One of the best one-man shows he’s ever seen!\n\nKirk's vocals exude a gritty, soulful depth that seems to transcend far beyond his years, with critics continually acclaiming him as one of the finest blues voices Australia has ever heard (Buzz Mag). Complementing his vocal artistry, Kirk's vintage guitar tones and raw grooves pay tribute to the timeless influences that have shaped his musical journey, resulting in a distinctive sound fast becoming his own.\n\nShaun’s musical journey has taken him to stages all over the world, where he's not only performed but consistently sold out shows, leaving audiences enthralled by his magnetic presence. From iconic festival stages like Bluesfest Byron Bay, where he's become a familiar name, to sharing the billing with legends like Robert Plant of Led Zeppelin, John Mayer, Paolo Nutini, John Butler Trio, and The Teskey Brothers; Kirk's artistic prowess is in esteemed company. Moreover, he's also had the honour of opening for household names such as blues maestro Joe Bonamassa, soul sensation Allen Stone, and the indomitable Beth Hart; further solidifying his place in the landscape of contemporary music. This remarkable journey is a testament to Kirk's unmatched talent and ability to connect with audiences across genres and generations.\n\nWHAT THE PRESS ARE SAYING ABOUT SHAUN KIRK...\n\n“It’s rare to see someone bring down the house as an opener, but Australia’s Shaun Kirk did exactly that. He connected with the crowd immediately”\n– Soundcheck Entertainment, Canada\n\n“One of the most explosive acts Australia has to offer”\n– Mixdown Magazine\n\n“Simply astounding. Definitely a must for any blues lover.”\nTsunami/Forte Magazine\n\nMy faith in this generation’s music has been restored.\n- Dearhead Press"
  },
  {
    "id": "Mallrat - Light Hits My Face Like A Straight Right-Meow, Wellington-Under The Radar",
    "name": "Mallrat - Light Hits My Face Like A Straight Right",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96519-45103.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-09-11-20:00"
    ],
    "displayDate": "Thu 11 Sep",
    "url": "https://www.undertheradar.co.nz/gig/96519/Mallrat---Light-Hits-My-Face-Like-A-Straight-Right.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Mallrat Brings “Light Hit My Face Like A Straight Right” Tour To New Zealand\n\nAustralian indie pop princess Mallrat will return to New Zealand this September on the Light Hit My Face Like a Straight Right World Tour, following a run of sold out shows across Europe and USA.\n\nSophomore album Light Hit My Face Like A Straight brings dance music that has heart and potent magic which will be manifested into life on stage, alongside all your favourite Mallrat hits and accompanied by her incredible live band.\n\nThe adored songwriter and producer’s work catapulted Mallrat across the globe with critical acclaim from NPR, Stereogum, NME, NYLON, PAPER Magazine, The New York Times, Billboard, Noisey and more, further affirming Mallrat as a beacon primed for the world stage in 2025.\n\nJoining Mallrat on her New Zealand headline shows is none other than Aotearoa’s own indie pop darling, Riiki Reid — bringing her signature style and infectious energy to the stage for an unforgettable night of music.\n\n\nNew Zealand Headline Dates\n\n11th September, Meow\n13th September, Tuning Fork\n\nAlso appearing at Snow Machine In Queenstown\n\nTickets will be available this Wednesday 9am NZST from lilmallrat.com"
  },
  {
    "id": "Shady Nasty Trek Tour-Valhalla, Wellington-Under The Radar",
    "name": "Shady Nasty Trek Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97278-240035.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-09-12-20:30"
    ],
    "displayDate": "Fri 12 Sep",
    "url": "https://www.undertheradar.co.nz/gig/97278/Shady-Nasty-Trek-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Following the release of their debut album TREK and a string of sold-out shows across Sydney (Eora), Brisbane (Meanjin), and Melbourne (Naarm), Sydney post-punk trio Shady Nasty announce their debut tour in Aotearoa/New Zealand this September. A world bound by modding cars, immigrant heritage and digital obsessions, Kevin Stathis, Haydn Green and Luca Watson, together play a left-field breed of punk that recalibrates their formal training to its most uncustomary extremes. Wherever they play and no matter the room size, devout adherents clammer to propel a heaving mosh. Experience TREK live as Shady Nasty debut the record with an all-new live show, with special guests to be announced.\n\nPresented by Select Music & Goose Garden. Tickets available at shadynasty.online"
  },
  {
    "id": "Vincent Vega Plays Tarintino-Rogue and Vagabond, Wellington-Under The Radar",
    "name": "Vincent Vega Plays Tarintino",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96151-403067.jpg",
    "venue": "Rogue and Vagabond, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-09-19-21:30"
    ],
    "displayDate": "Fri 19 Sep",
    "url": "https://www.undertheradar.co.nz/gig/96151/Vincent-Vega-Plays-Tarintino.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "A night of surf, soul and rockn'roll bangers from Quentin Tarantino's cult classic films, played with great vengeance & furious anger by Wellingtons favourite surf-rock saviours Vincent Vega. Expect tunes from Pulp Fiction, Reservoir Dogs, Once Upon A Time In Hollywood, The Hateful Eight, Death Proof and more.\n\nFeaturing special guests Lisa Tomlins on vocals and Louis TM on keys and vocals, as well as the usual suspects in Richard Te One (drums), Nick Lissette (bass) and Chris Armour (guitar)\n\nMusic from 9:30pm, FREE ENTRY"
  },
  {
    "id": "Cowboy Dan: Dreams That Feel Like Falling Aotearoa Album Tour-MOON, Wellington-Under The Radar",
    "name": "Cowboy Dan: Dreams That Feel Like Falling Aotearoa Album Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97222-738131.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-09-25-20:30"
    ],
    "displayDate": "Thu 25 Sep",
    "url": "https://www.undertheradar.co.nz/gig/97222/Cowboy-Dan-Dreams-That-Feel-Like-Falling-Aotearoa-Album-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Tāmaki Makaurau jangle heroes Cowboy Dan set out across Te Ika-a-Māui to celebrate the release of their debut full-length album, Dreams That Feel Like Falling.\n\nOnce aptly described as The Bats on the right amount of Red Bull, Cowboy Dan has been treating audiences across the motu to energetic, emotionally charged tunes since 2015. Their live shows have consistently delivered good times to fans and new friends alike.\n\nOff the back of two delightful EPs: We Will Hesitate, When We Eventually Wait (2017, Mixed by Jonathan Pearce); Sentimental Now That We're Leaving (2021, Mixed by Rohan Evans), the debut LP, Dreams That Feel Like Falling, showcases the bands expansive sonic pallet, with a mix of distortion, introspection, heart and bite.\n\nGather your pals and get on out for a night of alternative Aotearoa tunes. Special guests for each stop of the tour to be announced soon xxx"
  },
  {
    "id": "Brant Bjork Trio: Wellington-Valhalla, Wellington-Under The Radar",
    "name": "Brant Bjork Trio: Wellington",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97228-612784.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-09-25-01:01"
    ],
    "displayDate": "Thu 25 Sep",
    "url": "https://www.undertheradar.co.nz/gig/97228/Brant-Bjork-Trio-Wellington.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Brant Bjork has spent over a quarter of a century at the heart of California’s desert rock scene. From cutting his teeth as the drummer and songwriter for Kyuss’s legendary early albums to carrying the torch for fuzz-driven rock with Fu Manchu from 1994 to 2001, Bjork’s impact is undeniable. Over the past two decades, he has produced albums for other artists, launched numerous side projects, built an extensive solo career as a singer, guitarist, and bandleader, and founded his own record label. His story is one of relentless, boundary-pushing creativity.\n\nIn 2024, Bjork re-formed the Brant Bjork Trio, teaming up with Michael Amster (Nebula, Mondo Generator) on drums and longtime friend—and desert rock pioneer—Mario Lalli on bass.\n\nIn 2025, the trio heads to New Zealand for three exclusive shows celebrating their latest album, Once Upon a Time in the Desert. This is a rare chance to catch a true icon of desert rock live—an experience not to be missed.\n\nJoining them on all three dates are Australian rockers Full Tone Generator. Born on the beaches of Australia by Andy Fernando and brought to life in the Californian desert, Full Tone Generator brings the heat with a powerful blend of riff-heavy rock and raw energy.\n\nSecure your tickets today!"
  },
  {
    "id": "Keeley Shade - Anymore Tour-MOON, Wellington-Under The Radar",
    "name": "Keeley Shade - Anymore Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97369-378642.jpg",
    "venue": "MOON, Wellington",
    "coordinates": {
      "lat": -41.3132459,
      "long": 174.7798505
    },
    "dates": [
      "2025-09-26-20:30"
    ],
    "displayDate": "Fri 26 Sep",
    "url": "https://www.undertheradar.co.nz/gig/97369/Keeley-Shade---Anymore-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Don’t miss Keeley Shade’s debut headline tour across Aotearoa this August and September, in support of her EP Anymore. Keeley invites you into a world where vulnerability meets power, bringing her magnetic alt-pop catalogue to the stage with live shows in Auckland, Christchurch and Wellington. Known for crafting every part of her music, from writing and producing to mixing and performing, she is a rising force with a boundless approach to sonic textures.\n\n*Support artists to be announced\n\nOther shows:\nChristchurch - Space Academy - 29 August\nAuckland - Big Fan - 13 September"
  },
  {
    "id": "The Fun-Raiser Tour with Albi And The Wolves-Vogelmorn Upstairs, Wellington-Under The Radar",
    "name": "The Fun-Raiser Tour with Albi And The Wolves",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97188-777052.jpg",
    "venue": "Vogelmorn Upstairs, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-09-28-16:30"
    ],
    "displayDate": "Sun 28 Sep",
    "url": "https://www.undertheradar.co.nz/gig/97188/The-Fun-Raiser-Tour-with-Albi-And-The-Wolves.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Are you ready for a rollocking, soul filling, good folkn' time? You simply must not miss the energetic live show that Albi & The Wolves present! A show that’ll get you on your feet and fill you with joy.\n\nThe band is hitting the road to fundraise for a European tour in 2026, so you're not only getting to see one of the most fun bands New Zealand has to offer. You are helping them debut there!\n\nChris Dent, Pascal Roggen, Hannah De Koster and Micheal Young play original songs that are relatable and catchy, dancing on the edge of what could be considered folk. Intricate arrangements are filled with harmony, soaring violin, and most of all. Joy.\n\nSo, come join the Wolfpack and help the team make the dream a reality."
  },
  {
    "id": "Albi And The Wolves - 1st October-Hilltop Private House Concerts, Wellington-Under The Radar",
    "name": "Albi And The Wolves - 1st October",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96921-753934.jpeg",
    "venue": "Hilltop Private House Concerts, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-10-01-19:30"
    ],
    "displayDate": "Wed 01 Oct",
    "url": "https://www.undertheradar.co.nz/gig/96921/Albi-And-The-Wolves---1st-October.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Gate opens 7pm Music Starts 7.30pm Wednesday 1st October 2025\nAuckland based Albi and the Wolves set fire to stages and fill hearts with hope with their energetic and relatable alternative indie folk songs. Proud albino frontman Albi (Chris Dent), Pascal Roggen and Michael Young have crafted a stage show brimming with energy yet with pauses for reflection. The trio has a huge sound created simply by acoustic guitar, electric violin, double bass and three voices. Since 2014, Albi & the Wolves have gone from strength to strength touring Australia, New Zealand and Rarotonga. In 2018, they took home the Best Folk Artist Award at the NZVMAs.\nWhat makes the band special is their sense of community. Whether it’s connection through dance, singing or laughter, their performances inspire audiences to keep coming back for more. Just love them!\nCome along and enjoy their great gig in our special space, up close and personal.\nNot for profit, supporting our dedicated musicians. Suggested donation $40\nTeas, Coffee and Snacks provided. You're welcome to bring anything you'd like to eat or drink.\nParking available in the Coupon zones of Upland Rd & Glasgow St free after 6pm weekdays, and free all through the weekends. The Wilson Carpark at the top of the Cable Car charges 24/7."
  },
  {
    "id": "Bec Sandridge Presents: Always A Fan AU + NZ Tour-Secret Location, Wellington-Under The Radar",
    "name": "Bec Sandridge Presents: Always A Fan AU + NZ Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96863-217423.jpg",
    "venue": "Secret Location, Wellington",
    "coordinates": {
      "lat": -41.2887953,
      "long": 174.7772114
    },
    "dates": [
      "2025-10-02-20:00"
    ],
    "displayDate": "Thu 02 Oct",
    "url": "https://www.undertheradar.co.nz/gig/96863/Bec-Sandridge-Presents-Always-A-Fan-AU--NZ-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "BEC SANDRIDGE // NATIONAL TOUR 2025\nVery special guests TBA\n\nBec Sandridge is hitting the road with her band to celebrate her bratty new single Always A Fan. Expect melodrama, bigger hooks, fuzzed-out guitars, and a few unsolicited overshares—delivered with grit and polish.\n\nKnown for her theatrical, no-holds-barred live show, Sandridge has played Falls Festival, World Pride, Groovin the Moo, Indiestad and London Calling, toured the UK and Europe, and supported Mitski, St. Vincent, Saah Blasko, Yungblud, Ladyhawke, Kimbra, and Tegan and Sara. Her new single Always A Fan—co-produced with Nick Zaharias (MAY-A, The Buoys)— featuring collaborators like Tony Buchen (G Flip, Smashing Pumpkins), Dave Jenkins Jr (Daniel Johns, Vera Blue, and multi-Grammy-winner Cian Riordan (St Vincent, Billie Eilish, Lana Del Rey).\n\nHer 2024 Great Southern Nights show was the first in the series to sell out.\nNow she’s back with fresh chaos, new sounds, and a high tolerance for emotional exposure.\nTICKETS ON SALE NOW."
  },
  {
    "id": "Reaper (AUS) Feat. Pervertor, DAHTM and Dole Bludger-Valhalla, Wellington-Under The Radar",
    "name": "Reaper (AUS) Feat. Pervertor, DAHTM and Dole Bludger",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97306-887153.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-10-03-20:30"
    ],
    "displayDate": "Fri 03 Oct",
    "url": "https://www.undertheradar.co.nz/gig/97306/Reaper-AUS-Feat-Pervertor-DAHTM-and-Dole-Bludger.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Australia’s filthy speed metal punks REAPER are crawling out of the gutter and crossing the ditch to bring New Zealand to its knees.\nFusing the venom of punk with the raw aggression of speed metal, this is a blitzkrieg of riffs, fury and total graveless rebellion.\nExpect nothing but snarling riffs, rabid speed, and the sound of annihilation tearing through the fuckin’ speakers.\n\nWELLINGTON — VALHALLA — OCTOBER 3rd -with supports from PERVERTOR, DAHTM and DOLE BLUDGER!\n8pm, $20\nBring ya pocket money for merch!\n\nStuds. Leather. Speed. Violence.\nReaper is coming… and there will be no graves left to fill"
  },
  {
    "id": "Dear Antler, Adoneye, King Homeboy And Electric Tapestry-Valhalla, Wellington-Under The Radar",
    "name": "Dear Antler, Adoneye, King Homeboy And Electric Tapestry",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96558-614448.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-10-09-19:30"
    ],
    "displayDate": "Thu 09 Oct",
    "url": "https://www.undertheradar.co.nz/gig/96558/Dear-Antler-Adoneye-King-Homeboy-And-Electric-Tapestry.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "DEAR ANTLER - ADONEYE - KING HOMEBOY - ELECTRIC TAPESTRY\nValhalla - Thursday 9th October - doors at 7pm\nRock, hip-hop, electric guitar solos, epic songwriting, beatboxing, epic drumming - occasionally all in the same song..."
  },
  {
    "id": "Pumpkinhead - Sloth 30th Anniversary Tour-Meow, Wellington-Under The Radar",
    "name": "Pumpkinhead - Sloth 30th Anniversary Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/95631-43086.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-10-10-01:01"
    ],
    "displayDate": "Fri 10 Oct",
    "url": "https://www.undertheradar.co.nz/gig/95631/Pumpkinhead---Sloth-30th-Anniversary-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Pumpkinhead celebrate the 30th anniversary of their critically acclaimed album Sloth this year, performing three exclusive never to be repeated reunion shows.\n\nSloth entered the New Zealand Album Charts on 30 April 1995, peaked at number 28 and stayed in the charts for 4 weeks. Their single “I Like” made it to number 16 in the Official Top 40 singles chart 10 March 1995.\n\n“Now “Sloth”, Pumpkinhead’s debut album, compresses the quintet’s live energy into a head spinning whirlpool of fierce punky rock, powerful pop, and tempo-hopping Faith No More style metal. Not for the innocent!” – 4.5 stars – NZ HERALD 1995\n\n“Sloth is the sound of a band that’s already found its feet, the sound of a band that’s played 500 gigs before recording their debut album. What we’ve got here is a classy, polished debut. “I Like” these songs a lot” – Kevin List – RIP IT UP 1995"
  },
  {
    "id": "Paul Ubana Jones Plays The Shed Lower Hutt-The Shed, Lower Hutt, Wellington-Under The Radar",
    "name": "Paul Ubana Jones Plays The Shed Lower Hutt",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96096-615346.jpg",
    "venue": "The Shed, Lower Hutt, Wellington",
    "coordinates": {
      "lat": -41.3114319,
      "long": 174.8836101
    },
    "dates": [
      "2025-10-10-20:00"
    ],
    "displayDate": "Fri 10 Oct",
    "url": "https://www.undertheradar.co.nz/gig/96096/Paul-Ubana-Jones-Plays-The-Shed-Lower-Hutt.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An intimate soulful performer, an acoustic guitar sensation, winner of three New Zealand Music Awards.\nPaul has shared the stage and toured with the best: BB King, Bob Dylan, Taj Mahal, Keb Mo, Crowded House, Tuck and Patti… He has delighted festival audiences at the Dublin Blues Festival, Byron bay Blues festival, Vancouver Island Folk Festival, Blues at Bridgetown and many others in Europe.\n\n“A national treasure; Paul Ubana Jones is so much more than one man with a\nguitar. He is a conjuror of unique and original songs, rooted in primal Blues and Soul”\n\n“The most exciting Electro Acoustic Artist to visit our shores”\nGood Morning News, Santa Monica"
  },
  {
    "id": "Kora-Meow, Wellington-Under The Radar",
    "name": "Kora",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97435-518167.jpg",
    "venue": "Meow, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-10-11-01:01"
    ],
    "displayDate": "Sat 11 Oct",
    "url": "https://www.undertheradar.co.nz/gig/97435/Kora.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "KORA are back - and sound bigger, deeper and more electrifying than ever. With a long-awaited new album on the horizon, and a tour to match, the iconic Aotearoa band is set to reawaken the hearts of fans both old and new.\n\nKnown as one of the country’s most powerful and dynamic acts fusing elements of roots, reggae, funk, rock, dub, and electronic music into a sonic identity that is entirely their own. Their music is heavy and melodic and grounded in kaupapa Māori, driven by innovation, storytelling, and groove.\n\nTheir performances bring together heavy bass, soaring vocals, and raw energy, blending musical mastery with raw power to create an immersive experience. Whether headlining major festivals or packing out venues around Aotearoa, Kora’s ability to move a crowd is unmatched."
  },
  {
    "id": "Yoko-Zuna: A Live Tribute To Kaytranada-Meow Nui, Wellington-Under The Radar",
    "name": "Yoko-Zuna: A Live Tribute To Kaytranada",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97245-577187.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-10-17-22:30"
    ],
    "displayDate": "Fri 17 Oct",
    "url": "https://www.undertheradar.co.nz/gig/97245/Yoko-Zuna-A-Live-Tribute-To-Kaytranada.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "This October, Aotearoa electronic/progressive hip-hop powerhouse Yoko-Zuna will make their long anticipated return to Pōneke, presenting the music of KAYTRANADA in the already hallowed hall of Meow NUI.\n\nOver the past decade Yoko-Zuna have firmly established themselves as one of the country’s most exciting live acts and a favourite on the festival circuit. Just back from a world tour with hip-hop multihyphenate CHAII, the four piece made up of Swap Gomez, J.Y Lee, Kenji Iwamitsu-Holdaway, & Frank Eliesa once again join forces to perform their live tribute to the genre-defying beat wizard.\n\nLouis Kevin Celestin aka KAYTRANADA is a Haitian-Canadian record producer and DJ. He first made waves in 2010 with a steady stream of mixtapes, remixes, and original tracks released under the name Kaytradamus. By 2013, reintroducing himself as KAYTRANADA, he began turning heads across the global music scene. The momentum only grew—by 2014, he landed a deal with the influential label XL Recordings. In 2016, he dropped his debut studio album, 99.9%, which was met with widespread critical acclaim. He followed it up in 2019 with Bubba—a genre-blurring triumph that earned him two Grammy Awards, including Best Dance/Electronic Album, solidifying his place as one of the most innovative voices in contemporary music.\n\nTickets on sale from Friday 4th July at 12PM"
  },
  {
    "id": "Amped Up!-Brewtown, Upper Hutt, Wellington-Under The Radar",
    "name": "Amped Up!",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97213-105433.jpg",
    "venue": "Brewtown, Upper Hutt, Wellington",
    "coordinates": {
      "lat": -41.1306893,
      "long": 175.0674182
    },
    "dates": [
      "2025-10-25-16:00"
    ],
    "displayDate": "Sat 25 Oct",
    "url": "https://www.undertheradar.co.nz/gig/97213/Amped-Up!.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "New Zealand’s loudest night of mean as metal mayhem is locked and loaded.\n\nJoin us here at Brewtown for AMPED UP 2025, featuring NZs heaviest double-header!\n\nBlindspott – returning to the stage with their signature blend of raw emotion and heavy-hitting aggression.\nAND\nDevilskin - delivering precision, power, and the searing vocals of Jennie Skulander.\nwith support from Shepherds Reign - completing this un-holy trinity with their commanding, tribal-infused metal.\n\nThree bands. One stage. No second chances.\n\nAs always, Brewtown will be serving up heaps of unbeatable beverage options from our festival bars ft. craft beer, bourbon, wine, non-alcs and heaps more.\n\nAnd we’ve got a line-up of serious feeds from some of the region's top foodies.\n\nScore your ticket. Feel the volume. Get AMPED UP!\nR18"
  },
  {
    "id": "The Saints-Meow Nui, Wellington-Under The Radar",
    "name": "The Saints",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/theSaints2025.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-11-01-01:01"
    ],
    "displayDate": "Sat 01 Nov",
    "url": "https://www.undertheradar.co.nz/gig/95051/The-Saints.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "The Saints ’73-’78 announce their New Zealand debut this spring, with concerts at The Powerstation in Auckland on 31 October and Meow Nui in Wellington on 1 November, before they head north to the UK and US.\n\nThe Plus1 24-hour presale begins 9am Tuesday 25th February at plus1.co.nz\n\nTickets are on general sale at plus1.co.nz from 9am Wednesday 26th February.\n\nFeel and Plus1 proudly present the band’s New Zealand tour which follows their hugely successful Australian tour in 2024 to crowds of 12,000 people across 12 shows.\n\nFeaturing founding Saints members, guitarist Ed Kuepper and drummer Ivor Hay alongside honorary Saints; singer Mark Arm of Seattle rockers Mudhoney, former The Birthday Party / Bad Seeds guitarist Mick Harvey and bassist Peter Oxley of Australia’s legendary Sunnyboys.\n\nThe Saints 73-78 carry on where the original band left off in 1978 performing the material from their three incendiary albums (I’m) Stranded (1977), Eternally Yours (1978) and Prehistoric Sounds (1978).\n\n“The Saints first three albums rank among the best records ever made. They have been a part of my life since stumbling upon them in the early 80s. Their influence looms large in Mudhoney world. I am stoked, stunned, and humbled that I get to joi in on this Rock ‘n’ Roll Reality Camp with Ed, Ivor, Peter and Mick!”– Mark Arm\n\nThe tour also comes off the back of arecent 4 LP box set of 1977’s ground breaking debut (I’m) Stranded which features the original album remastered forvinyl for the first time in over 40 years, the previously unreleased 1976 mix of the album, a 5-song live performance from April 1977 at Sydney’s Paddington Town Hall, a full live show from the London’s Hope and Anchor in November 1977 plus all recordings from the 1977 Top 40 charting This Perfect Day and 1-2-3-4 ep sessions."
  },
  {
    "id": "Cowboy Junkies - Celebrating 40 Years-The Opera House, Wellington-Under The Radar",
    "name": "Cowboy Junkies - Celebrating 40 Years",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96689-719140.jpg",
    "venue": "The Opera House, Wellington",
    "coordinates": {
      "lat": -41.2913572,
      "long": 174.7779946
    },
    "dates": [
      "2025-11-06-19:30"
    ],
    "displayDate": "Thu 06 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96689/Cowboy-Junkies---Celebrating-40-Years.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Cowboy Junkies will be performing a career-spanning show from The Trinity Session to their recent album, Such Ferocious Beauty!\n\nTour Dates\nTuesday 4th November – Town Hall, Auckland\nThursday 6th November – Opera House, Wellington\nFriday 7th November – Regent Theatre, Palmerston North\nSunday 9th November – Isaac Theatre, Christchurch\nTuesday 11th November – Fortitude Music Hall, Brisbane\nThursday 13th November – Civic Theatre, Newcastle\nFriday 14th November – State Theatre, Sydney\nTuesday 18th November – Astor Theatre, Perth\nThursday 20th November – Woodville Town Hall, Adelaide\nSunday 23rd November – Palais Theatre, Melbourne\n\nAbout Cowboy Junkies\n\nSometimes revolutions begin quietly.\n\nIn 1988, Cowboy Junkies proved that there was an audience waiting for something quiet, beautiful and reflective. The Trinity Session was like a whisper that cut through the noise — and it was compelling. It stood out in the midst of the flash and bombast that came to define the late 80’s. The now classic recording combined folk, blues and rock in a way that had never been heard before and went on to sell more than a million copies."
  },
  {
    "id": "No Cigar-Meow Nui, Wellington-Under The Radar",
    "name": "No Cigar",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96982-259930.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-11-07-20:30"
    ],
    "displayDate": "Fri 07 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96982/No-Cigar.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Breakout Aotearoa five-piece NO CIGAR have announced a three-date tour across New Zealand this November, in celebration of their highly anticipated third studio album Under the Surface, due for release July 30th.\n\nSince forming in 2019, NO CIGAR have built a fiercely loyal fanbase across Aotearoa and beyond, carving out a unique niche that blends elements of indie, surf, and alternative rock. Their upcoming album is crafted for the stage — shaped by the band’s dynamic chemistry and a deep connection with their audience.\n\nNO CIGAR’s 2023 sophomore album The Great Escape spent more than 74 consecutive weeks on the NZ Top 20 Albums Chart and featured the breakout hit “Concubine,” voted the 10th best rock song of 2024 by listeners of The Rock FM.\n\nTheir past tours across NZ, Australia and the UK have consistently sold out, driven by a word-of-mouth buzz and a reputation for electric, unforgettable performances. This tour will host their biggest headline shows on home soil to date and are not to be missed!"
  },
  {
    "id": "Guns 2 Roses - World's Best GNR Tribute-San Fran, Wellington-Under The Radar",
    "name": "Guns 2 Roses - World's Best GNR Tribute",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96305-357578.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-11-08-20:30"
    ],
    "displayDate": "Sat 08 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96305/Guns-2-Roses---Worlds-Best-GNR-Tribute.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Guns 2 Roses, the UK's most notorious Guns N' Roses tribute band established in 2002, is set to perform in New Zealand for the first time. They will play the classic GNR debut album Appetite For Destruction in its entirety top to bottom, along with a set of fan favourites.\n\n“THE MOST NOTORIOUS GUNS N ROSES TRIBUTE IN HISTORY EST 2002 – THE ONLY GNR TRIBUTE TO PLAY LIVE WITH 4 DIFFERENT MEMBERS OF GUNS N ROSES! THEY HAVE PLAYED ALL THE TOP VENUES AND FESTIVALS IN THE UK – EUROPE – DUBAI – INDIA & USA. GUNS 2 ROSES ARE THE LONGEST RUNNING, CLOSEST LOOKING AND MOST INTERNATIONALLY RECOGNISED G’N’R TRIBUTE IN THE WORLD!”\n\nHaving sold out shows worldwide, Guns 2 Roses aims to recreate the energy of GNR's 1988 NYC Ritz performance. For fans of classic GNR, this is a performance not to be missed.\n\n?Saturday, November 8: San Fran, Wellington.\n?with System of a Down tribute Steal This Name! performing Toxicity in full.\n\nDon't miss this opportunity to experience the ultimate GNR tribute live in New Zealand."
  },
  {
    "id": "Paul Ubana Jones-The Shed, Lower Hutt, Wellington-Under The Radar",
    "name": "Paul Ubana Jones",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96097-569121.jpg",
    "venue": "The Shed, Lower Hutt, Wellington",
    "coordinates": {
      "lat": -41.3114319,
      "long": 174.8836101
    },
    "dates": [
      "2025-11-11-20:00"
    ],
    "displayDate": "Tue 11 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96097/Paul-Ubana-Jones.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "An intimate soulful performer, an acoustic guitar sensation, winner of three New Zealand Music Awards.\nPaul has shared the stage and toured with the best: BB King, Bob Dylan, Taj Mahal, Keb Mo, Crowded House, Tuck and Patti… He has delighted festival audiences at the Dublin Blues Festival, Byron bay Blues festival, Vancouver Island Folk Festival, Blues at Bridgetown and many others in Europe.\n\n“A national treasure; Paul Ubana Jones is so much more than one man with a\nguitar. He is a conjuror of unique and original songs, rooted in primal Blues and Soul”\n\n“The most exciting Electro Acoustic Artist to visit our shores”\nGood Morning News, Santa Monica"
  },
  {
    "id": "Other Voices Perform The Music Of The Cure - Wellington-Valhalla, Wellington-Under The Radar",
    "name": "Other Voices Perform The Music Of The Cure - Wellington",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96092-409899.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-11-15-21:00"
    ],
    "displayDate": "Sat 15 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96092/Other-Voices-Perform-The-Music-Of-The-Cure---Wellington.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Sanctuary Events present\n\nThe Music of\nTHE CURE\n\nPerformed Live by\nOTHER VOICES\n\nA 30+ song showcase of music from THE CURE’S most prolific period, 1979 to 1989.\nOTHER VOICES will be performing a selection of songs from EVERY album throughout that decade. Expect to hear fan favourites, deep cuts and classic songs from the albums; Three Imaginary Boys, Boys Don’t Cry, Seventeen Seconds, Faith, Pornography, Japanese Whispers, The Top, Head on the Door, Standing on a Beach, Kiss Me x3 and Disintegration.\n\nOTHER VOICES are a Christchurch based 4 piece post-punk and indie covers band.\nFeaturing Penny Cain on Vocals/guitar/keyboards, Linda Baran on Bass, Nick Ford on Guitar/keyboards and Wade Byers on Drums/samples.\nPerforming solidly around New Zealand over the last 7 years OTHER VOICES have built up a loyal following.\n\nAll their shows across NZ in 2024 and early 2025 sold out so get your tickets early!\nLimited Super Early Bird presales $20+bf\nLimited Early Bird presales $25+bf\nGeneral Release presales $30+bf\n\nTickets from UTR.co.nz\n\nR18\nR.O.A.R"
  },
  {
    "id": "Rob Thomas - The All Night Days Tour-Michael Fowler Centre, Wellington-Under The Radar",
    "name": "Rob Thomas - The All Night Days Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96577-876799.jpg",
    "venue": "Michael Fowler Centre, Wellington",
    "coordinates": {
      "lat": -41.2895258,
      "long": 174.7780167
    },
    "dates": [
      "2025-11-15-20:00"
    ],
    "displayDate": "Sat 15 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96577/Rob-Thomas---The-All-Night-Days-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Multi-platinum singer-songwriter Rob Thomas today announced three nationwide New Zealand dates on his global The All Night Days Tour, celebrating his forthcoming sixth solo album All Night Days and the 20th anniversary of his acclaimed debut solo record …Something to Be.\n\nThe All Night Days Tour will travel to theatres this November, taking in Auckland’s Kiri Te Kanawa Theatre on Tuesday 11th, Te Pae Christchurch Convention Centre on Thursday 13th, before finishing up at Wellington’s Michael Fowler Centre on Saturday 15th.\n\nPromoted in New Zealand by TEG Van Egmond, this highly anticipated tour marks Rob’s first New Zealand solo headline shows, and follows last year’s sold-out tour with Matchbox Twenty.\n\nAfter such amazing Matchbox shows in 2024, it’s so great to revisit the solo catalogue, and I can't wait to come back and share these songs with my Kiwi fans. It’s going to be a very special run of shows, said Thomas.\n\nManaging Director of TEG Van Egmond, Christo Van Egmond said “We’re absolutely thrilled to be bringing Rob Thomas back to New Zealand for this incredible run of shows. To see an artist of his calibre in intimate theatre settings is a rare treat, and it’s going to be a truly memorable experience for fans around the country.”\n\nThe upcoming tour promises to deliver the captivating live performances that Thomas is known for, and audiences can expect a night filled with timeless hits including “Lonely No More,” “This Is How A Heart Breaks,” “Her Diamonds,” “Street Corner Symphony,” the Grammy-winning Santana collaboration “Smooth,” as well as Matchbox Twenty favourites like “3AM” and “Unwell.” Rob will also perform his powerful new single “Hard To Be Happy,” giving fans a taste of All Night Days."
  },
  {
    "id": "Sharon Van Etten And The Attachment Theory | Wellington-The Opera House, Wellington-Under The Radar",
    "name": "Sharon Van Etten And The Attachment Theory | Wellington",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/96970-481727.jpg",
    "venue": "The Opera House, Wellington",
    "coordinates": {
      "lat": -41.2913572,
      "long": 174.7779946
    },
    "dates": [
      "2025-11-25-20:00"
    ],
    "displayDate": "Tue 25 Nov",
    "url": "https://www.undertheradar.co.nz/gig/96970/Sharon-Van-Etten-And-The-Attachment-Theory--Wellington.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "BANISHED MUSIC & STRANGE NEWS PRESENT\nSHARON VAN ETTEN & THE ATTACHMENT THEORY\n\nTUESDAY 25 NOVEMBER - THE OPERA HOUSE, WELLINGTON*\nTHURSDAY 27 NOVEMBER - ISAAC THEATRE ROYAL, CHRISTCHURCH*\nSATURDAY 29 NOVEMBER - THE OTHERS WAY FESTIVAL, AUCKLAND\n\n* with special guest SHANNON LAY (USA)\n\nTickets from Banished Music\n\n“...right up there with Van Etten’s most majestic tracks ever” - www.consequence.net\n\n“A new dawn for the music of the night.” – The Times\n\n“...you could be forgiven for thinking that this latest incarnation of Sharon Van Etten has seen her reborn.” – The Herald (Glasgow)\n\nFollowing the gigantic recent announcement that Sharon Van Etten & The Attachment Theory are headlining The Others Way Festival this November, Banished Music and Strange News are delighted to reveal the band are also set to play their very own shows in Wellington and Christchurch, with very special international guest Shannon Lay joining in support at both shows.\n\nHot on the (six-inch patent black stiletto) heels of their self-titled album, Tuesday 25 November will see Sharon returning to Wellington’s Opera House with her remarkable new band in tow, and playing Christchurch’s Isaac Theatre Royal on Thursday 27 November, before heading up to slay The Other’s Way’s very first outdoor Karangahape Road stage.\n\nThat her band’s debut album is her own seventh album is a testament to Van Etten’s willingness to reinvent and follow her instincts for change, even after this long on the job. Now sixteen years into an extraordinary career, it seems our heroine has fully accepted her mantle as one of the world’s great rock stars, fronting her gothic-tinged new outfit to widespread awe and acclaim, Devra Hoff on bass guitar and backing vocals, Teeny Lieberson on keys, guitar, and backing vocals, and Jorge Balbi on drums.\n\n“The Attachment Theory are a tight unit, woven together by Devra Hoff’s inventive, intelligent bass lines... this show was less about [Sharon’s] past and more about her future, which appears to lie with The Attachment Theory - a band who, on this evidence, are bringing the very best out of her.” – Manchester Evening News\n\nAlso performing at The Others Way, and playing support in Wellington and Christchurch, American songwriter Shannon Lay is much of a punk as she is a folk singer, citing both The Ramones and Nick Drake as influences. As a member of garage rocker Ty Segall’s Freedom Band, Lay can certainly make a racket, but for these shows, she will be opening as a solo act. The Guardian were quick to assure us that “This is no mere indie-folk musician,” and Pitchfork said her most recent studio album “presents a quiet, lovely, undramatic rendering of the dramatic”.\n\nWe truly could not be more excited to be welcoming Queen Shazza back to Aotearoa for these shows, and with the addition of both her band The Attachment Theory and Shannon Lay’s opening spot, you should be dang well excited too!\n\n“Sharon Van Etten and The Attachment Theory’s self-titled record is an early Album of the Year contender” - www.independent.co.uk"
  },
  {
    "id": "Ben Ottewell And Ian Ball By Request Tour | Wellington-San Fran, Wellington-Under The Radar",
    "name": "Ben Ottewell And Ian Ball By Request Tour | Wellington",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/97113-133667.jpg",
    "venue": "San Fran, Wellington",
    "coordinates": {
      "lat": -41.2941512,
      "long": 174.7755614
    },
    "dates": [
      "2025-11-25-01:01"
    ],
    "displayDate": "Tue 25 Nov",
    "url": "https://www.undertheradar.co.nz/gig/97113/Ben-Ottewell-And-Ian-Ball-By-Request-Tour--Wellington.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Ben Ottewell and Ian Ball, founding members of the legendary band Gomez, are bringing their very special By Request tour to Aotearoa this November.\n\nCalling all fans, Tijuana Lady’s, actually Me, You, Everybody to See The World through the eyes of Ian Ball and Ben Ottewell as they Bring Their Lovin’ Back Here to New Zealand\n\nExpect the best tunes from the best of 25 years of touring to Australia and the best albums Bring It On, Liquid Skin, and beyond all delivered with Ben Ottewell’s unmistakable growl and Ian Ball’s melodic brilliance.\n\nNo rules. Just two mates, two guitars, some electronic stuff, and decades of songs that have soundtracked road trips, breakups, breakdowns and breakthroughs.\n\nIt’ll be intimate and loose, but it’s your chance to hear the songs you love, the way you’ve never heard them before. By request.\n\nMake sure you fill out the song request form here: bit.ly/GomezByRequest"
  },
  {
    "id": "Pixies - 2025 New Zealand Tour-St James Theatre, Wellington-Under The Radar",
    "name": "Pixies - 2025 New Zealand Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/pixies_20251080x1920_nz.jpg",
    "venue": "St James Theatre, Wellington",
    "coordinates": {
      "lat": -41.2933004,
      "long": 174.7797564
    },
    "dates": [
      "2025-11-26-01:01"
    ],
    "displayDate": "Wed 26 Nov",
    "url": "https://www.undertheradar.co.nz/gig/93584/Pixies---2025-New-Zealand-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "PIXIES have announced a 2025 New Zealand tour which will see the alt-rock legends perform two consecutive nights in both Auckland and Wellington. On the first night, they’ll play classic albums, 1990’s Bossanova and 1991 follow up Trompe Le Monde in their entirety, followed by a cross catalogue set and songs from their new album The Night The Zombies Came on the second night.\n\nPixies have just released their tenth studio album The Night the Zombies Came to critical acclaim, with MOJO saying, This most thrillingly deathly of bands remains alive and DIY stating, Pixies remain one of the most consistent, influential bands on the planet.\n\nPixies wowed UK fans in August with their mainstage performance at London’s All Points East, described as “raucous” by Rolling Stone UK after their sold-out Glasgow Academy show was tipped as “a full-on head rush of classics by the Scottish Sun and as relevant in 2024 as they were over 35 years ago by Glasgow World.\n\n35 years since their groundbreaking Platinum-certified album Doolittle catapulted the band into the UK Top Ten, and 20 years since their celebrated reformation at Coachella, Pixies are deep into their second act, and in the midst of a creative purple patch."
  },
  {
    "id": "Nadia Reid Enter Now Brightness Tour-Meow Nui, Wellington-Under The Radar",
    "name": "Nadia Reid Enter Now Brightness Tour",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/95893-636268.jpg",
    "venue": "Meow Nui, Wellington",
    "coordinates": {
      "lat": -41.2954948,
      "long": 174.7779739
    },
    "dates": [
      "2025-12-12-20:00"
    ],
    "displayDate": "Fri 12 Dec",
    "url": "https://www.undertheradar.co.nz/gig/95893/Nadia-Reid-Enter-Now-Brightness-Tour.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "This December acclaimed songwriter Nadia Reid journeys back to New Zealand and Australia in celebration of Enter Now Brightness; her critically lauded fourth album which was released on Chrysalis in February 2025.\n\nDecember 12 / Wellington / Meow Nui\n\nPresale 10am (NZST), Wednesday 16th April\nGeneral on sale 10am (NZST), Friday 18th April\nRegister for presale at banishedmusic.com/subscribe\n\nThe Manchester-based expatriate New Zealander is known for her ruminative and well-crafted folk-inflected songwriting, and with Enter Now Brightness she presents a record of poise and great beauty, the sound of a cellular shift, of pain giving way to tenderness and joy."
  },
  {
    "id": "Cryptopsy-Valhalla, Wellington-Under The Radar",
    "name": "Cryptopsy",
    "imageUrl": "https://www.undertheradar.co.nz/images/showImages/allSoVilePoster2025.jpg",
    "venue": "Valhalla, Wellington",
    "coordinates": {
      "lat": -41.2948002,
      "long": 174.7753363
    },
    "dates": [
      "2025-12-15-01:01"
    ],
    "displayDate": "Mon 15 Dec",
    "url": "https://www.undertheradar.co.nz/gig/96881/Cryptopsy.utr",
    "source": "Under The Radar",
    "eventType": "Music & Concerts",
    "description": "Valhalla Touring are proud to announce direct from Canada, one of the worlds most brutal Death Metal bands, the mighty CRYPTOPSY, headlining 2 shows to close out the year of 2025, on their ALL SO VILE tour!!!\n\nMore than 30 years into their storied career, Montreal Death Metal innovators Cryptopsy return with their ninth studio album, An Insatiable Violence, set for release on June 20, 2025 on Season of Mist.\n\nRevered in extreme Metal circles for such groundbreaking classics as 1994’s Blasphemy Made Flesh and the 1996 magnum opus None So Vile, Cryptopsy find yet another gear on An Insatiable Violence, which further solidifies the band’s place in the upper echelon of Death Metal.\n\nComing out of the pandemic, the band dedicated themselves to staying on top of their game more than ever before, with the intention of consistently putting out a new record every two years. That started with 2023’s acclaimed As Gomorrah Burns, which WON them a CANADIAN GRAMMY, and continues 21 months later with An Insatiable Violence.\n\nCRYPTOPSY will destroy December 2025 in Auckland/Tamaki Makaurau and Wellington/Te Whanganui-a-Tara"
  }
]
