{
  "events": [
    {
      "id": "2b or nt 2b-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "2b or nt 2b",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/a35ad15a-2a7f-4151-b51c-4e49435e5eb5.jpeg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8240",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nSix characters from classic plays meet as present day teenagers at midnight on The Bridge to Nowhere (the one in the Hutt..)  The endless angst of Chekhov and Ibsen, the personal dilemma solilioquies of Shakespeare and the ancient agonies of Sophocles transform to snappy one-liners and hilarious antics as the young people competitively re-enact moments from their dysfunctional lives. Mixing original text and texting, quotes and online questioning, the young people struggle with contemporary versions of age old problems - love, family, loneliness and belonging, to find their way forward.\nMeeting first on 'Whats the Point .com' they agree to 'end it all.\" But really, Antigone and Hamlet want to spite their uncles, Masha (the Seagull) wants sympathy for her humiliating love triangle, Irena (Three Sisters) wants to get out of Foxton and Hedda (Hedda Gabler) wants to control them all, while Helena (A Midsummer Nights Dream) is very keen to meet Hamlet - \" He sounds pretty much a mess. I'll just wash my hair..\"\nAn award winning play by Micky Delahunty returning to the Fringe eighteen years after its first performance in the same spot and performances in schools and theatres round the country.\nSo if you love the classics AND/OR are young OR know some young people OR were ever young yourself!? - you will find this comedy celebrating the power of human connection as funny and relevant as ever.\n \n \n\n",
      "description": "Six characters from classic plays meet as present day teenagers at midnight on The Bridge to Nowhere (the one in the Hutt..)  The endless angst of Chekhov and Ibsen, the personal dilemma solilioquies of Shakespeare and the ancient agonies of Sophocles transform to snappy one-liners and hilarious antics as the young people competitively re-enact moments from their dysfunctional lives.\nMixing original text and texting, quotes and online questioning, the young people struggle with contemporary versions of age old problems - love, family, loneliness and belonging, to find their way forward.\nMeeting first on 'Whats the Point .com' they agree to 'end it all.\"\nBut really, Antigone and Hamlet want to spite their uncles, Masha (the Seagull) wants sympathy for her humiliating love triangle, Irena (Three Sisters) wants to get out of Foxton and Hedda (Hedda Gabler) wants to control them all, while Helena (A Midsummer Nights Dream) is very keen to meet Hamlet - \" He sounds pretty much a mess.\nI'll just wash my hair..\" An award winning play by Micky Delahunty returning to the Fringe eighteen years after its first performance in the same spot and performances in schools and theatres round the country.",
      "labels": []
    },
    {
      "id": "A Man Named Dave-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "A Man Named Dave",
      "imageUrl": "https://eventotron.imgix.net/09-01-2025-035119-1805.jpg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8201",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA Man Named Dave tells the story of an ordinary man with an extraordinary problem. Dave lives a perfectly normal life--so normal, in fact, that every moment is dictated by The Narrator. Day after day, he trudges through his monotonous 9-5, until one morning he decides to flip the script.\nWhat follows is a chaotic and playful journey to independence, as Dave wrestles for control of his own story. Along the way, his co-workers--appliances, office supplies, and unexpected allies--spring to life. Some help him, some hinder him, but all push him closer to discovering what it really means to take charge of his own destiny.\nBlending voiceover, puppetry, and live performance, A Man Named Dave is a witty and imaginative exploration of self-determination in an absurd world.\n\n",
      "description": "A Man Named Dave tells the story of an ordinary man with an extraordinary problem.\nDave lives a perfectly normal life--so normal, in fact, that every moment is dictated by The Narrator.\nDay after day, he trudges through his monotonous 9-5, until one morning he decides to flip the script.\nWhat follows is a chaotic and playful journey to independence, as Dave wrestles for control of his own story.\nAlong the way, his co-workers--appliances, office supplies, and unexpected allies--spring to life.",
      "labels": []
    },
    {
      "id": "Alien Comedy--Fringe",
      "name": "Alien Comedy",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/9f897e57-d953-4f5f-84ab-51c24374db7e.jpeg",
      "venue": "",
      "coordinates": {
        "lat": -41.2887953,
        "long": 174.7772114
      },
      "dates": [
        "2026-03-05-01:01"
      ],
      "displayDate": "Thu 05 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8255",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nIf you like watching an assortment of Stand-up comedians, while enjoying pizza and beverages, then Alien Comedy is for you.\nJoin the cult following, its Wellington's second longest running Comedy Show. First Thursday of every month, 8pm at Moon Bar in Newtown.\nFringe Festival Editions! Two shows in one night!\n\n",
      "description": "If you like watching an assortment of Stand-up comedians, while enjoying pizza and beverages, then Alien Comedy is for you.\nJoin the cult following, its Wellington's second longest running Comedy Show.\nFirst Thursday of every month, 8pm at Moon Bar in Newtown.\nFringe Festival Editions!\nTwo shows in one night!",
      "labels": []
    },
    {
      "id": "Amid the Summer's Malice-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "Amid the Summer's Malice",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/5c96afab-aa5b-4f63-b8e4-bb3f0a1d85a9.jpeg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-07-17:00"
      ],
      "displayDate": "Sat 07 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8233",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nAmid the Summer's Malice is a re-write of A Midsummer Night's Dream that focuses in on agency and consent, while still keeping the humour. Follow Hermia as she navigates escaping an arranged marriage, gets lost in the streets with her friends Lysander and Demetrius, stumbles into Oberon's love potion plot, deals with the fairy king's meddling, and then come out the other side with Lysander happily in love with her, and she is magically drugged to love him back. Classic Midsummer! Meanwhile, poor Richard (just call him Dick) is putting on a one-man show for the big wedding, and of course, nothing could possibly go wrong there either. With all the magical transformations and love-potions, the implications for agency and consent could not be clearer; so come along to see this funny, colourful story told again, in a modern setting with updated language, and with modern issues at the core.\n\n",
      "description": "Amid the Summer's Malice is a re-write of A Midsummer Night's Dream that focuses in on agency and consent, while still keeping the humour.\nFollow Hermia as she navigates escaping an arranged marriage, gets lost in the streets with her friends Lysander and Demetrius, stumbles into Oberon's love potion plot, deals with the fairy king's meddling, and then come out the other side with Lysander happily in love with her, and she is magically drugged to love him back.\nClassic Midsummer!\nMeanwhile, poor Richard (just call him Dick) is putting on a one-man show for the big wedding, and of course, nothing could possibly go wrong there either.\nWith all the magical transformations and love-potions, the implications for agency and consent could not be clearer; so come along to see this funny, colourful story told again, in a modern setting with updated language, and with modern issues at the core.",
      "labels": []
    },
    {
      "id": "Bad Girls-Circus Bar, 17B Allen Street, Te Aro-Fringe",
      "name": "Bad Girls",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/f0f28056-4a2d-4c26-b6be-d799772c4d7e.jpeg",
      "venue": "Circus Bar, 17B Allen Street, Te Aro",
      "coordinates": {
        "lat": -41.2929705,
        "long": 174.7826363
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8221",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nAnna Dobbie (2025 Raw Comedy Quest finalist) and Meaghan Fisher (2025 NZICF Wellington Comedy Club Rainbow Showcase, 2025 Raw Comedy Quest semifinalist) are bad girls. Two of Wellington's best new comedians, they are teaming up to bring their insights into gender weirdness, the absurdity of straight culture, the exciting world of number plates, microaggressive toddlers, the Brooke van Velden of it all, and whether it's true that mosquitoes prefer the French. Sitting somewhere on the edges of almost any spectrum you can think of, Anna and Meaghan are sure to make you laugh - eye contact, however, is not guaranteed. Join this duo for an evening that will make you laugh, think, and wonder if that was the weirdest striptease you've ever experienced.\n\n",
      "description": "Anna Dobbie (2025 Raw Comedy Quest finalist) and Meaghan Fisher (2025 NZICF Wellington Comedy Club Rainbow Showcase, 2025 Raw Comedy Quest semifinalist) are bad girls.\nTwo of Wellington's best new comedians, they are teaming up to bring their insights into gender weirdness, the absurdity of straight culture, the exciting world of number plates, microaggressive toddlers, the Brooke van Velden of it all, and whether it's true that mosquitoes prefer the French.\nSitting somewhere on the edges of almost any spectrum you can think of, Anna and Meaghan are sure to make you laugh - eye contact, however, is not guaranteed.\nJoin this duo for an evening that will make you laugh, think, and wonder if that was the weirdest striptease you've ever experienced.",
      "labels": []
    },
    {
      "id": "Bangers and Mash Ups - A Jukebox Singalong-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "Bangers and Mash Ups - A Jukebox Singalong",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/a5445b10-b9c9-4187-adbd-81348d12b939.jpeg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-07-01:01"
      ],
      "displayDate": "Sat 07 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8247",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nGet ready to bang out your favourite hits in glorious harmony like never before - grab a friend for a night of mass karaoke mayhem that will have you on your feet and singing your heart out.\nDon't miss this jukebox mash-up of the greatest power ballads, rock and disco hits from the 60s to the 90s, banging out impromptu harmonies and picking up some new ones under the guidance of our funky vocal hosts and massive house choir who have come all the way from Australia!\nIt's the perfect night out for shower singers, pop divas and even air guitar pros. Join us for a fun night of singing, games and on-the-spot competitions. Lubricate your vocal cords, bring your dancing shoes and sense of adventure!\nBangers and Mash Ups is a 90 minute show that is best enjoyed standing / dancing! The Hannah auditorium will be transformed into a dancefloor, with wheelchair spaces and rest seats available. Additional general admission seating is available in the balcony.\n\n",
      "description": "Get ready to bang out your favourite hits in glorious harmony like never before - grab a friend for a night of mass karaoke mayhem that will have you on your feet and singing your heart out.\nDon't miss this jukebox mash-up of the greatest power ballads, rock and disco hits from the 60s to the 90s, banging out impromptu harmonies and picking up some new ones under the guidance of our funky vocal hosts and massive house choir who have come all the way from Australia!\nIt's the perfect night out for shower singers, pop divas and even air guitar pros.\nJoin us for a fun night of singing, games and on-the-spot competitions.\nLubricate your vocal cords, bring your dancing shoes and sense of adventure!",
      "labels": []
    },
    {
      "id": "Ben Miller: Volcano-29 Courtenay Place\n6011-Fringe",
      "name": "Ben Miller: Volcano",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/a54180dc-f41e-41ab-8cd9-766954c30d05.jpeg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Fri 06 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8340",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nWhat happens when a comedian walks into a volcano?\nIn 2023, Ben Miller was the artist in residence at Hawai'i Volcanoes National Park, the first ever stand-up comedian ever selected. This was probably a terrible idea on their part.\nCome watch this show where scientist turned stand-up comedian Ben Miller explores volcanology, entomology, Hawaiian history, space volcanoes, cats, cookies, and more.\nBen Miller is an NYC based scientist turned comedian who has been working for the past 9 years. In that time, he has performed at all the top clubs in the city such as Broadway Comedy Club, Carolines, and The Stand. Ben was once ranked as the top roast battler in NYC. He has a degree in Materials Science and Engineering, worked on a science bus, 3D printed cookies and has defused a few bar fights while on stage. In 2022, Ben Miller's debut hour, Stand-Up Science, had a completely sold-out run at the Edinburgh Fringe Festival and he now tours internationally.\n \nPraise for the show:\n \n\"Ben Miller's nerdy and vivid comic mind erupts in this hour-long set!\" - Winnipeg Free Press (4-star review)\n\"Ben does a fantastic job of getting the facts across and making us laugh at the same time! A real and rare treat. - The Mumble (4-star review)\n\"Ben had us laughing until we cried - very funny and very clever! - Audience member\n\n",
      "description": "What happens when a comedian walks into a volcano?\nCome watch this show where scientist turned stand-up comedian Ben Miller explores volcanology, entomology, Hawaiian history, space volcanoes, cats, cookies, and more.\nIn that time, he has performed at all the top clubs in the city such as Broadway Comedy Club, Carolines, and The Stand.\nBen was once ranked as the top roast battler in NYC.\nHe has a degree in Materials Science and Engineering, worked on a science bus, 3D printed cookies and has defused a few bar fights while on stage.",
      "labels": []
    },
    {
      "id": "Ben Miller: Volcano-29 Courtenay Place\n6011-Fringe",
      "name": "Ben Miller: Volcano",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/2c0c2cdd-3bc3-4d86-a2ba-c701b1332c77.jpeg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-04-19:30"
      ],
      "displayDate": "Wed 04 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8294",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nWhat happens when a comedian walks into a volcano?\nIn 2023, Ben Miller was the artist in residence at Hawai'i Volcanoes National Park, the first ever stand-up comedian ever selected. This was probably a terrible idea on their part.\nCome watch this show where scientist turned stand-up comedian Ben Miller explores volcanology, entomology, Hawaiian history, space volcanoes, cats, cookies, and more.\nBen Miller is an NYC based scientist turned comedian who has been working for the past 9 years. In that time, he has performed at all the top clubs in the city such as Broadway Comedy Club, Carolines, and The Stand. Ben was once ranked as the top roast battler in NYC. He has a degree in Materials Science and Engineering, worked on a science bus, 3D printed cookies and has defused a few bar fights while on stage. In 2022, Ben Miller's debut hour, Stand-Up Science, had a completely sold-out run at the Edinburgh Fringe Festival and he now tours internationally.\n \nPraise for the show:\n \n\"Ben Miller's nerdy and vivid comic mind erupts in this hour-long set!\" - Winnipeg Free Press (4-star review)\n\"Ben does a fantastic job of getting the facts across and making us laugh at the same time! A real and rare treat. - The Mumble (4-star review)\n\"Ben had us laughing until we cried - very funny and very clever! - Audience member\n\n",
      "description": "What happens when a comedian walks into a volcano?\nCome watch this show where scientist turned stand-up comedian Ben Miller explores volcanology, entomology, Hawaiian history, space volcanoes, cats, cookies, and more.\nIn that time, he has performed at all the top clubs in the city such as Broadway Comedy Club, Carolines, and The Stand.\nBen was once ranked as the top roast battler in NYC.\nHe has a degree in Materials Science and Engineering, worked on a science bus, 3D printed cookies and has defused a few bar fights while on stage.",
      "labels": []
    },
    {
      "id": "Blip to the Future-Cuba Street-Fringe",
      "name": "Blip to the Future",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/056f87c9-e9c0-4dc4-a5e1-e9a4c2ff3112.jpeg",
      "venue": "Cuba Street",
      "coordinates": {
        "lat": -41.2970403,
        "long": 174.7736217
      },
      "dates": [
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Fri 06 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8223",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nIf you are reading this, I have crashed into your present. Unless you've already read this, then\nwe are stuck in a loop until you have a talk with yourself. Your future self.\nTinker with time my-chime machine and sound yourself out to blip to the future.\n\n",
      "description": "If you are reading this, I have crashed into your present.\nUnless you've already read this, then we are stuck in a loop until you have a talk with yourself.\nYour future self.\nTinker with time my-chime machine and sound yourself out to blip to the future.",
      "labels": []
    },
    {
      "id": "Bug Songs Not Love Songs-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "Bug Songs Not Love Songs",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/68c4f555-9fb3-46ed-8134-36f356d534af.jpeg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8210",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nYour wall. Two bugs. They're gonna sing at you.\nEvery bug knows of Bauble (Lia Kelly) and Skump (Phoebe Caldeiro), the two ladybugs that play a weekly concert on living room wall, in their fittingly named band Bugs On A Wall. Every bug also knows that this concert will tragically be their last before house gets fumigated. Join our little ladybug band for a night of their greatest hits such as: Praying Mantis Wedding, Questions for Humans  and Bugs Find A Way, and answer the biggest question on all our minds: “What music would a bug choose to play at its funeral?”\nCome in your best bug outfit and join Lia and Phoebe, as they explore identity and intersectionality in a set of original comedy songs. Directed by award winning comedian Alayne Dick.\n\"Phoebe Caldeiro's original composition was very impressive... Lin-Manuel? Take notes.\" - Salient Magazine (not a quote from this show but you know, still pretty cool for someone to say about her)\n\"Musician Lia Kelly starts the show playing the piano. This girl LOVES playing the piano. She is living for it and I am living for her living for it.\" - Theatreview (also not a quote from this show but she does still really like playing the piano)\nBUG BUNDLE\nGet 30% off full priced tickets when bought alongside Gemma vs The Normal Worms and/or Crush The Bug.\n\n",
      "description": "They're gonna sing at you.\nEvery bug knows of Bauble (Lia Kelly) and Skump (Phoebe Caldeiro), the two ladybugs that play a weekly concert on living room wall, in their fittingly named band Bugs On A Wall.\nDirected by award winning comedian Alayne Dick.\n\"Phoebe Caldeiro's original composition was very impressive... Lin-Manuel?\nTake notes.\"",
      "labels": []
    },
    {
      "id": "CONCERT 26 - Cancelled-29 Courtenay Place\n6011-Fringe",
      "name": "CONCERT 26 - Cancelled",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/2c840bb6-de25-4997-ba15-0857a19c1af2.jpeg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8297",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nEver felt that wave of tears trying to burst out of you whilst listening to a really good song?\nI haven't, cos I just let it all flow. Seriously, I cry a lot. I need help.\nYour help! Come and see my live gig! Cry with me! \nCONCERT 26 is an intense set of evocative covers, performed live with instruments and vocals, accompanied by dance. Cultivating a space to feel, heal and express together - and play through some absolute bangers!\nA messy amalgamation of rock, pop, punk, funk and disco. What more could you want?\n\"In an endless scroll, red heart shapes speed by\" - SOAK\n\"Everyone that I know is broken\" - The Beths\n\"Everything I do it just comes undone\" - Coldplay\n\n",
      "description": "Ever felt that wave of tears trying to burst out of you whilst listening to a really good song?\nI need help.\nCONCERT 26 is an intense set of evocative covers, performed live with instruments and vocals, accompanied by dance.\nCultivating a space to feel, heal and express together - and play through some absolute bangers!\nA messy amalgamation of rock, pop, punk, funk and disco.",
      "labels": []
    },
    {
      "id": "Circus of the Night-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "Circus of the Night",
      "imageUrl": "https://eventotron.imgix.net/09-24-2025-071807-8287.jpg",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8316",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nRoll up, roll up, the circus is in town!\nLeave your kids at home because things get weird after dark.\nThis is a show for professional performers to let loose and perform acts that are not fit for a traditional family-friendly circus show. From dangerous circus tricks to risqué burlesque acts to just plain strange, this show has everything.\nProduced by Athena Rose, with acts from Wellington's best circus performers.\n\n",
      "description": "Roll up, roll up, the circus is in town!\nLeave your kids at home because things get weird after dark.\nThis is a show for professional performers to let loose and perform acts that are not fit for a traditional family-friendly circus show.\nFrom dangerous circus tricks to risqué burlesque acts to just plain strange, this show has everything.\nProduced by Athena Rose, with acts from Wellington's best circus performers.",
      "labels": []
    },
    {
      "id": "DUNE BUT WORSE-29 Courtenay Place\n6011-Fringe",
      "name": "DUNE BUT WORSE",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-082806-3891.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8300",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nBring spice.\n\n",
      "description": "Bring spice.",
      "labels": []
    },
    {
      "id": "David Klein presents: Birds-1 Marion Street, Te Aro, Wellington-Fringe",
      "name": "David Klein presents: Birds",
      "imageUrl": "https://eventotron.imgix.net/10-07-2025-034106-2814.jpg",
      "venue": "1 Marion Street, Te Aro, Wellington",
      "coordinates": {
        "lat": -41.2938711,
        "long": 174.7768365
      },
      "dates": [
        "2026-03-02-18:30"
      ],
      "displayDate": "Mon 02 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8214",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nGoodnight Kiwi. Bird of the Year. The hoiho on your fiver. Hatupatu and the Birdwoman. The kākā screaming outside. A silly show with real bird facts. Fringe 2015's Best Newcomer finally hatches a new show - a love letter to Wellington and manu we share the city with.\nThis live presentation combines facts, jokes, video, prizes and songs into an engaging slice of science storytelling. Bird numbers are way up all over the city - it's a great time to be a bird or bird fan. Learn about the wildlife swooping past you and get excited for a Wellington that becomes wilder every day.\nFree Fact - most kākā are left-footed.\nDavid's last Fringe outing was Towards a Better Understanding of the Universe. Theatreview said, \"This is an autobiographical journey told through the Universe. Yes, the goddam amazing universe that we're all a part of. I'm hooked.\" The show also popped over to Melbourne Fringe where reviews glowed it was \"almost as perfect an hour as you could have.\"\nTowards evolved into Tour de Science - a science storytelling show. The Tour was on a bike and pedalled all around Aotearoa (down to Rakiura and up to Kaitaia!). Across 60 towns and cities, audiences loved David's easy-going yarns that sneakily piled on some real education.\nMost recently, David branched out and became Plant Man: a show for children that wondered, \"What would it be like to be a plant?\" Kim Hill asked him about trees and vegetables and described him as \"cool as a cucumber.\"\nBe cool, get hooked and squawk about this new show. The title says it all - David Klein presents: Birds\n\n",
      "description": "Bird of the Year.\nBird numbers are way up all over the city - it's a great time to be a bird or bird fan.\nDavid's last Fringe outing was Towards a Better Understanding of the Universe.\nTowards evolved into Tour de Science - a science storytelling show.\nBe cool, get hooked and squawk about this new show.",
      "labels": []
    },
    {
      "id": "FATG Unplugged-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "FATG Unplugged",
      "imageUrl": "https://eventotron.imgix.net/10-06-2025-021527-1076.jpg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8234",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nAre you a fan of Tiny Desk Concerts?\nCalling out to anyone who loves going to a causal gig, and having a drink with friends. \nCome visit us at FATG for the launch of our new offer of acoustic sets this Fringe. Housed in our foyer, this free event allows for anyone to pop in for good music. \nGrab a mate and enjoy live music from outstanding local artists.\n \nLook out for FATG Unplugged on your social media channels as we announce our artists and special offers. \n\n",
      "description": "Are you a fan of Tiny Desk Concerts?\nCalling out to anyone who loves going to a causal gig, and having a drink with friends.\nCome visit us at FATG for the launch of our new offer of acoustic sets this Fringe.\nHoused in our foyer, this free event allows for anyone to pop in for good music.\nGrab a mate and enjoy live music from outstanding local artists.",
      "labels": []
    },
    {
      "id": "Four Questions-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "Four Questions",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-234441-3559.jpg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8246",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nFour-year-olds ask the biggest questions. As we grow, the answers get tangled--gender, identity, belonging, the slow loss of magic. In this contemporary dance work, a community cast explores moments of wonder, confusion and discovery--reminding us how it feels to see the world again with fresh eyes. Four Questions moves through the stretch and the ache of becoming, and finds, somewhere in the mess, a spark still glowing. Is this proof that the magic never really left?\n\n",
      "description": "Four-year-olds ask the biggest questions.\nAs we grow, the answers get tangled--gender, identity, belonging, the slow loss of magic.\nIn this contemporary dance work, a community cast explores moments of wonder, confusion and discovery--reminding us how it feels to see the world again with fresh eyes.\nFour Questions moves through the stretch and the ache of becoming, and finds, somewhere in the mess, a spark still glowing.\nIs this proof that the magic never really left?",
      "labels": []
    },
    {
      "id": "Fringe Bar Comedy Club: Best of the Fest-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "Fringe Bar Comedy Club: Best of the Fest",
      "imageUrl": "https://eventotron.imgix.net/10-08-2025-014903-2800.jpg",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-04-19:30"
      ],
      "displayDate": "Wed 04 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8270",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nCan't decide what to see this Fringe? Fringe Bar Comedy Club presents Best of the Fest. This stand-up comedy show features the best and brightest comedians from the NZ Fringe. Every Wednesday brings a fresh line-up and guaranteed midweek laughs. Come along and enjoy the festival's funniest acts in one night.\n\n",
      "description": "Can't decide what to see this Fringe?\nFringe Bar Comedy Club presents Best of the Fest.\nThis stand-up comedy show features the best and brightest comedians from the NZ Fringe.\nEvery Wednesday brings a fresh line-up and guaranteed midweek laughs.\nCome along and enjoy the festival's funniest acts in one night.",
      "labels": []
    },
    {
      "id": "Horizon-29 Courtenay Place\n6011-Fringe",
      "name": "Horizon",
      "imageUrl": "https://eventotron.imgix.net/10-20-2025-232940-4539.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8292",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nAdrift at sea, Richard and Luigi brave the seasons and days together as they progressively make their way toward the horizon. Will they give into the waves and let the ocean consume them or will they push through to see another day?\nHORIZON is a brand new aburdist-comedy play written by NZ playright Nathan King and directed/performed by Rose McKenzie and Charly Baker. The show takes typical absurdist tropes and flips them around from fatalism to hope. HORIZON is an attempt to be a voice in the dark, a sunset on the horizon (HA!) for people who feel they're lost, drifting in a sea they have no say over.\nIt's a crying call to the void saying, \"You matter, this matters, we matter, love matters, and you are worth the effort, time and energy it will take to get better.\"\nIf we have any strong testimony, it's the truth that it does get better. Everywhere. Always.\n\n",
      "description": "Adrift at sea, Richard and Luigi brave the seasons and days together as they progressively make their way toward the horizon.\nWill they give into the waves and let the ocean consume them or will they push through to see another day?\nHORIZON is a brand new aburdist-comedy play written by NZ playright Nathan King and directed/performed by Rose McKenzie and Charly Baker.\nThe show takes typical absurdist tropes and flips them around from fatalism to hope.\nHORIZON is an attempt to be a voice in the dark, a sunset on the horizon (HA!)",
      "labels": []
    },
    {
      "id": "Jak Darling - Floozy-Newtown Community & Cultural Centre, 7 Colombo Street-Fringe",
      "name": "Jak Darling - Floozy",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/11db0c8a-44ad-42bf-a645-ec98c5a548a8.jpeg",
      "venue": "Newtown Community & Cultural Centre, 7 Colombo Street",
      "coordinates": {
        "lat": -27.5579808,
        "long": 153.091614
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8259",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nJak Darling has courageously slept around so you don't have to!\n2025 Billy T Nominee and Te Whanganui-a-Tara’s rising star Jak Darling closes their legs and opens their heart for a brand new hour of wit, glamour and allure. After years of meticulous fieldwork Darling vulnerably shares the tops and bottoms of their sex life, exploring themes of lust, longing and loneliness. Featuring stand-up, poetry, theatre, tongue, cheek, and a whole … lot more.\nUnapologetically queer and unabashedly themselves, Floozy is a salacious celebration of unadulterated queer joy. Bring protection, an open mind, and a note-pad for intellectual intercourse, intimacy and no intermission!\n“It's amazing how much naughtiness you can get away with. Darling ought to teach it.” Margaret Austin, Theatreview, NZ\n“Jaw dropping and hilarious… Darling has got to be one of the funniest people in the city.” Sean Dugdale Martin, Art Murmurs, NZ\n\n",
      "description": "Jak Darling has courageously slept around so you don't have to!\n2025 Billy T Nominee and Te Whanganui-a-Tara’s rising star Jak Darling closes their legs and opens their heart for a brand new hour of wit, glamour and allure.\nAfter years of meticulous fieldwork Darling vulnerably shares the tops and bottoms of their sex life, exploring themes of lust, longing and loneliness.\nFeaturing stand-up, poetry, theatre, tongue, cheek, and a whole … lot more.\nUnapologetically queer and unabashedly themselves, Floozy is a salacious celebration of unadulterated queer joy.",
      "labels": []
    },
    {
      "id": "Jason Henderson Reads The Telephone Book-Welsh Dragon Bar, 10 Cambridge Terrace\n6011-Fringe",
      "name": "Jason Henderson Reads The Telephone Book",
      "imageUrl": "https://eventotron.imgix.net/10-10-2025-044310-2373.jpg",
      "venue": "Welsh Dragon Bar, 10 Cambridge Terrace\n6011",
      "coordinates": {
        "lat": -41.2936799,
        "long": 174.7840651
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8309",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA high-class dumpster fire re-ingnites.\nCelebrate Jason's literacy AND a lifetime's investment in voice and speech training.\nLuxuriate in his mellifluous, golden baritone voice as he reprises this 'un-award winning'*, least worthwhile, and most artistically dubious venture of his career.\nFrom 'Aagesen' to 'Zwartz', embark on a declamatory odyssey!\nThis show premiered as one of many** global events celebrating the 100th anniversary of the 1921 deep sea telephone cable from Key West, Florida, to Havana, Cuba.\n**no other events known at time of publication.\nCritical Praise:\n\"Ultimately forgettable.\"- an actual reviewer (we forget who)\n\"He studied acting. In New York. For this?\" \n\"You sounded like you were reading the telephone book.\" - NYC Acting Coach (If they could see him now... )\n\"I don't recommend it.\" - Jason Henderson\n\"...an insane and inconsequential farrago of sheer fantastic nonsense\" - Anna Russell on Mozart's The Magic Flute\n*NZ Fringe 2021 Awards - Nominated (Please note: This is NOT an award-winning show - it was *only* nominated)\n \n\n",
      "description": "A high-class dumpster fire re-ingnites.\nCelebrate Jason's literacy AND a lifetime's investment in voice and speech training.\nLuxuriate in his mellifluous, golden baritone voice as he reprises this 'un-award winning'*, least worthwhile, and most artistically dubious venture of his career.\nFrom 'Aagesen' to 'Zwartz', embark on a declamatory odyssey!\nThis show premiered as one of many** global events celebrating the 100th anniversary of the 1921 deep sea telephone cable from Key West, Florida, to Havana, Cuba.",
      "labels": []
    },
    {
      "id": "Just Eat the Damn Sausage-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "Just Eat the Damn Sausage",
      "imageUrl": "https://eventotron.imgix.net/08-19-2025-045109-7015.jpg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8235",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nPuberty, periods, pregnancy, perimenopause, piss, processed meat and please be quiet.\nIn a bold and brave new solo hour of comedy, multi-award winning comedian Harriet Moir flips the bird to the patriarchy and the multiple ways it has tried to keep her small and keep her quiet. \n\"Harriet delivers an hour of storytelling and musings focussing on the aging female body and the years of energy spent on bodily self-critique before arriving at a place of complete acceptance. This interspliced with many very funny references to felatio\". - Flat City Field Notes\n\"It's a story of discovery, shame, confusion, hilarity, pride, sensuality and everything in between\". - Theatreview \n\"Harriet holds the audience in the palm of her hands from the get-go\". - Theatreview\n\"A masterclass in kiwi comedy.\" - Flat City Field Notes\nHarriet lives in Dunedin with her two daughters and their ginger pussy, where she works as a comedian, writer, wedding and funeral celebrant, MC, actor, singer, writer, producer and entertainer. Mercifully not all at the same time. \nWinner - Best Comedy - Dunedin Fringe Festival 2025\nNominated - Best in Fringe - Dunedin Fringe Festival 2025\nWinner - Best Comedian - Dunedin Comedy Awards 2024\nWinner - Phil Davison Memorial Special Contribution to Fringe Life Award - Dunedin Fringe Festival 2024\n\n",
      "description": "Puberty, periods, pregnancy, perimenopause, piss, processed meat and please be quiet.\nThis interspliced with many very funny references to felatio\".\n- Flat City Field Notes \"It's a story of discovery, shame, confusion, hilarity, pride, sensuality and everything in between\".\n- Theatreview \"Harriet holds the audience in the palm of her hands from the get-go\".\n- Flat City Field Notes Harriet lives in Dunedin with her two daughters and their ginger pussy, where she works as a comedian, writer, wedding and funeral celebrant, MC, actor, singer, writer, producer and entertainer.",
      "labels": []
    },
    {
      "id": "Just To Be Close To You-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "Just To Be Close To You",
      "imageUrl": "https://eventotron.imgix.net/10-05-2025-124100-2892.jpg",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8273",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nOh, hello there. Are you ready to get up close and personal with renowned lounge singer Carl Poteraychke? Join us for a night filled with sensational music, impeccable vibrations, and unforgettable memories... just for an hour.\nWinner: Best of Fest, Outstanding Comedy, World Premier, Cultural Exchange, and Artists' Pick (2025 San Diego Fringe).\nNominated: Top of Fringe, Adelaide Exchange, and Daredevil Award (2025 Hollywood Fringe).\nCreated and performed by Cam Poter (America's Got Talent, Ecole Gaulier, HBO's Silicon Valley, @CamOnCam69).\nCo-devised with Jeremy Poter. Directed by Paulyboy and Shawn Stoner.\n\n",
      "description": "Oh, hello there.\nAre you ready to get up close and personal with renowned lounge singer Carl Poteraychke?\nJoin us for a night filled with sensational music, impeccable vibrations, and unforgettable memories... just for an hour.\nWinner: Best of Fest, Outstanding Comedy, World Premier, Cultural Exchange, and Artists' Pick (2025 San Diego Fringe).\nNominated: Top of Fringe, Adelaide Exchange, and Daredevil Award (2025 Hollywood Fringe).",
      "labels": []
    },
    {
      "id": "Lily Catastrophe presents: Burlesque at the Gods-29 Courtenay Place\n6011-Fringe",
      "name": "Lily Catastrophe presents: Burlesque at the Gods",
      "imageUrl": "https://eventotron.imgix.net/10-07-2025-071851-7405.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-07-21:30"
      ],
      "displayDate": "Sat 07 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8302",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nLily Catastrophe, Wellington's Burlesque Princess and star of comedy cabaret BOTTOM SURGERY, brings the Dionysian art of burlesque to the Gods at Paramount Theatre. \nJoin Lily--described as an \"it girl\" and \"one seriously amazing woman\"--in her returns to New Zealand Fringe 2026, as she summons a shimmering pantheon of New Zealand's finest burlesque performers in an opulent, rhinestoned evening filled with classic tease, divine performances, and glamorous sensuality. Burlesque at the Gods is sure to be a monumental event, hosted by one of Wellington's most exciting rising stars.\nCome worship at the seat of the Gods.\n\n",
      "description": "Lily Catastrophe, Wellington's Burlesque Princess and star of comedy cabaret BOTTOM SURGERY, brings the Dionysian art of burlesque to the Gods at Paramount Theatre.\nJoin Lily--described as an \"it girl\" and \"one seriously amazing woman\"--in her returns to New Zealand Fringe 2026, as she summons a shimmering pantheon of New Zealand's finest burlesque performers in an opulent, rhinestoned evening filled with classic tease, divine performances, and glamorous sensuality.\nBurlesque at the Gods is sure to be a monumental event, hosted by one of Wellington's most exciting rising stars.\nCome worship at the seat of the Gods.",
      "labels": []
    },
    {
      "id": "Listening Post: Gemma vs The Normal Worms (In the Flesh!)-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "Listening Post: Gemma vs The Normal Worms (In the Flesh!)",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/6a58781f-dc2e-4f10-8ad4-b19e0be56028.jpeg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8367",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nOur raunchy 4h 20m audio comedy Gemma vs The Normal Worms will be playing on demand for FREE at our charming audio installation at Hannah Playhouse.\n\nFeaturing headphones and craft supplies — stop by anytime to cosy down, doodle a worm, and allow yourself to inch deep into the bowels of the Lost Worm Galaxy...\n\nCheck out our trailer here.\n\n… The Normal Thing to Do would be: Listen to Gemma vs The Normal Worms …\n\n\nSupported by Hannah Playhouse and the Wellington City Council.\nThe Listening Post will be available from Feb 13 to March 8th: 5-9pm Tuesday-Friday, 3-9pm Saturday, 5-9pm Sunday.\nBUG BUNDLE\nGet 30% off full priced tickets when bought alongside Bug Songs Not Love Songs and/or Crush The Bug.\n\n",
      "description": "Our raunchy 4h 20m audio comedy Gemma vs The Normal Worms will be playing on demand for FREE at our charming audio installation at Hannah Playhouse.\nFeaturing headphones and craft supplies — stop by anytime to cosy down, doodle a worm, and allow yourself to inch deep into the bowels of the Lost Worm Galaxy...\nCheck out our trailer here.\n… The Normal Thing to Do would be: Listen to Gemma vs The Normal Worms … Supported by Hannah Playhouse and the Wellington City Council.\nThe Listening Post will be available from Feb 13 to March 8th: 5-9pm Tuesday-Friday, 3-9pm Saturday, 5-9pm Sunday.",
      "labels": []
    },
    {
      "id": "Messy-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "Messy",
      "imageUrl": "https://eventotron.imgix.net/10-07-2025-034240-7775.jpg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8199",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nFlatmates Gracie, deep in therapy and retail work, and Freya, accidental drug dealer, \"barely\" an artist, struggle with the psychological toll of their art degree and navigate life post-uni.\nGracie's rage gets the best of her, and Freya is losing hope. The play speaks to how tough it can be not to give up on the arts industry and how necessary mental health support is for our resilience.\nMessy is a dark comedy; quippy with fast intellectual dialogue. It pokes fun at the mundane drudgery of life, and highlights the beauty of creating art and leaning on your artistic community for support.\n\n",
      "description": "Flatmates Gracie, deep in therapy and retail work, and Freya, accidental drug dealer, \"barely\" an artist, struggle with the psychological toll of their art degree and navigate life post-uni.\nGracie's rage gets the best of her, and Freya is losing hope.\nThe play speaks to how tough it can be not to give up on the arts industry and how necessary mental health support is for our resilience.\nMessy is a dark comedy; quippy with fast intellectual dialogue.\nIt pokes fun at the mundane drudgery of life, and highlights the beauty of creating art and leaning on your artistic community for support.",
      "labels": []
    },
    {
      "id": "My Mother Should Have Had An Abortion-29 Courtenay Place\n6011-Fringe",
      "name": "My Mother Should Have Had An Abortion",
      "imageUrl": "https://eventotron.imgix.net/10-06-2025-001654-8935.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-05-20:30"
      ],
      "displayDate": "Thu 05 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8320",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA painfully honest solo show about depression, mothers, and why love and like aren't the same. \nAt eleven, Joyann confessed her suicide ideation for the first time out loud, not knowing her mother could understand more than she let on. \nNow, Joyann is unpacking the generational sadness and the uneasy gratitude of a Black woman who both wants to defund the police and thank them for holding space while she open-mouthed sobbed in their faces.\nThrough humor and honesty, Joyann attempts to turn grief into punchlines and healing.\n\"My Mother Should Have Had an Abortion\" is not a tragedy -- it's in the grand tradition of blaming our parents for everything wrong in our lives. \nA meditation on depression, migration, and the absurd ways we survive ourselves, this debut one-woman show finds humor in heartbreak, tenderness in shame, and connection in the messiest corners of being human.\nJoyann is a Toronto-born writer, teacher, and performer who has lived, volunteered, and worked worldwide -- From Canada to Cuba, China, Germany, Korea, Spain, and Antigua (where her family is from). A former morning show cohost and stand-up dabbler, Joyann blends personal storytelling with observation and radical vulnerability.\n \n\n",
      "description": "A painfully honest solo show about depression, mothers, and why love and like aren't the same.\nAt eleven, Joyann confessed her suicide ideation for the first time out loud, not knowing her mother could understand more than she let on.\nNow, Joyann is unpacking the generational sadness and the uneasy gratitude of a Black woman who both wants to defund the police and thank them for holding space while she open-mouthed sobbed in their faces.\nThrough humor and honesty, Joyann attempts to turn grief into punchlines and healing.\n\"My Mother Should Have Had an Abortion\" is not a tragedy -- it's in the grand tradition of blaming our parents for everything wrong in our lives.",
      "labels": []
    },
    {
      "id": "Neil Thornton: Agonist-Cavern Club, 22 Allen Street-Fringe",
      "name": "Neil Thornton: Agonist",
      "imageUrl": "https://eventotron.imgix.net/09-21-2025-024715-4687.jpg",
      "venue": "Cavern Club, 22 Allen Street",
      "coordinates": {
        "lat": 40.7154503,
        "long": -73.992023
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:7843",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nNeil Thornton, that grumpy bearded guy who's won all kinds of awards (Best Comedian, Best MC) is back with an hour of new material about his lifelong, ceaseless, and futile struggles and obsessions. Protagonists, Antagonists, and the questionable use of an injectable agonist.\n \n\"Thornton is just a master of the craft of comedy - the room is totally unified and he knows how to follow our responses.\" - Theatreview\n\"A bold performer with intelligent material. Constantly amusing and thought-provoking.\" - ruminator.co.nz\n \nOutstanding Contribution to the Industry, New Zealand Comedy Guild Awards, 2023\nBest Industry Helper, 2018, 2019, 2020 Wellington Comedy Awards\nBest MC, 2022 Wellington Comedy Awards\nBest Comedian, 2020 Wellington Comedy Awards\nBest Male Comedian, 2020 Cartel Comedy Awards\nBest Mentor, 2021 Cartel Comedy Awards\n\n",
      "description": "Neil Thornton, that grumpy bearded guy who's won all kinds of awards (Best Comedian, Best MC) is back with an hour of new material about his lifelong, ceaseless, and futile struggles and obsessions.\nProtagonists, Antagonists, and the questionable use of an injectable agonist.\n\"Thornton is just a master of the craft of comedy - the room is totally unified and he knows how to follow our responses.\"\n- Theatreview \"A bold performer with intelligent material.\nConstantly amusing and thought-provoking.\"",
      "labels": []
    },
    {
      "id": "Oliver Pol: Featherbrained-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "Oliver Pol: Featherbrained",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/3bf131c4-3b44-43ff-9d00-2952ead6ec8f.png",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Fri 06 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8275",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nOliver Pol is a silly goose.\n\nAfter years of overthinking and self-doubt, he's embracing it. The human brain can be a difficult thing to inhabit. Maybe, existentially, geese have had it right all along.\n\nSo Oliver's going to honk and flap his way over to the lighter side. It's time to make peace with having an algorithm irrevocably overrun by hairless cats. To swap alcohol for family-sized apple and rhubarb pies. To realise that giving yourself hickeys is cool and fine actually.\n\nJoin Oliver in his energetic solo standup comedy debut as he swaps introspection for silliness. Expect a playful, sharp, and surprisingly uplifting hour of comedy.\n\n",
      "description": "Oliver Pol is a silly goose.\nAfter years of overthinking and self-doubt, he's embracing it.\nThe human brain can be a difficult thing to inhabit.\nMaybe, existentially, geese have had it right all along.\nSo Oliver's going to honk and flap his way over to the lighter side.",
      "labels": []
    },
    {
      "id": "Operamoth-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "Operamoth",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/db11402e-8d98-4b76-92e6-b7aa06f354fe.jpeg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8192",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA cocoon bursts open into a fever dream.\nOperamoth is a contemporary dance that negotiates the ebbs and flows of holding things dear and allowing oneself to let go. Cycles of creation, preservation, and destruction are upset by dissonant gestural embroideries. Contorted postures and lashing appendages permeate three bodies as they melt towards collapse. Against the backdrop of a world turned sideways, how much pressure can our natural flow of life withstand?\nOperamoth pries open fossilised remains in a gathering of movement, wax, and sinew tethers. Exaggerated forms cascade through scenes of turbulence and harmony. This work presents a tangle of holding self, holding together, and holding none; folding audiences into a dreamlike vista. Meet us at the crest of growth and departure, where surreal pricklings scratch our tangible world.\nHailing from Tāmaki Makaurau, Ctenophora Co. is a group of dance artists interested in crafting nuanced and imaginative performance pieces. Their works span moments of extreme subtlety to visceral unwindings of movement.\n\n",
      "description": "A cocoon bursts open into a fever dream.\nOperamoth is a contemporary dance that negotiates the ebbs and flows of holding things dear and allowing oneself to let go.\nCycles of creation, preservation, and destruction are upset by dissonant gestural embroideries.\nContorted postures and lashing appendages permeate three bodies as they melt towards collapse.\nAgainst the backdrop of a world turned sideways, how much pressure can our natural flow of life withstand?",
      "labels": []
    },
    {
      "id": "Orin Performs Performative Stand-Up Comedy-Cavern Club, 22 Allen Street-Fringe",
      "name": "Orin Performs Performative Stand-Up Comedy",
      "imageUrl": "https://eventotron.imgix.net/10-18-2025-104147-6635.jpg",
      "venue": "Cavern Club, 22 Allen Street",
      "coordinates": {
        "lat": 40.7154503,
        "long": -73.992023
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:7840",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nOrin Ruaine-Prattley turns his back on the mainstream style that brought him early success and stumbles hairlessly into the world of alternative stand-up. He wrestles with politics and the predictability of mainstream comedy, finding humour in the cracks where stand-up falls apart. Critiquing comedians like Jimmy Carr, Joe Rogan, Chris Bishop and Elon Musk, Orin takes on figures who chase outrage and confuse controversy for substance.\nCan Orin's \"performative\" comedy speak truth to power? Or will his act become part of the same circus he so pretentiously tries to expose?\nLayered, experimental, and unapologetically satirical, Orin Performs Performative Stand-Up Comedy delivers a bold new voice in Aotearoa's comedy landscape.\nAwards:\n⭐ 2023 New Zealand International Comedy Festival Best Newcomer\n⭐ 2023 NZ Fringe Most Promising Pasifika Artist Nominee\n⭐ 2021 Wellington RAW Comedy Quest Winner\n⭐ 2021 Wellington Comedy Awards Best Newcomer\n\n",
      "description": "Orin Ruaine-Prattley turns his back on the mainstream style that brought him early success and stumbles hairlessly into the world of alternative stand-up.\nHe wrestles with politics and the predictability of mainstream comedy, finding humour in the cracks where stand-up falls apart.\nCritiquing comedians like Jimmy Carr, Joe Rogan, Chris Bishop and Elon Musk, Orin takes on figures who chase outrage and confuse controversy for substance.\nCan Orin's \"performative\" comedy speak truth to power?\nOr will his act become part of the same circus he so pretentiously tries to expose?",
      "labels": []
    },
    {
      "id": "PING PONG BALLER--Fringe",
      "name": "PING PONG BALLER",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/24f163c8-227a-41ab-86e5-4b4612f81508.jpeg",
      "venue": "",
      "coordinates": {
        "lat": -41.2887953,
        "long": 174.7772114
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8266",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nWinning in life isn’t about the size of your balls.\nIt’s about how you spin them.\nWouter Moerloose presents his debut stand-up hour about the triumph of attitude over accolades.\nThis Belgian raconteur spins sharp, self-aware stories from his chaotic journey towards the only thing he never knew he wanted: to make you laugh!\nExpect crying on planes, poorly chosen hobbies, and an unhealthy obsession with celebrities’ wealth – featuring (without their consent) an AK-47 hoarding grandfather, Latvia’s worst kidnapper, and some surprisingly horny sea mammals.\nPING PONG BALLER: the nearly-award winning show where almost does count!\nWouter’s accolades (just in case):\n* Raw Comedy Quest 2025: Canterbury Finalist / Auckland Semi-Finalist\n* Winner, Good Times Comedy Club 2025 “Goodest Newcomer” + Nominee, “People’s Choice”\n* Nominee, Best Newcomer South Island, 2025 NZ Comedy Guild Awards\nWith support from Ōtautahi-based Jarrod Cook (Winner, 2025 NZIF Pearls of Wisdom Award and Nominee, 2024 Best Newcomer South Island, NZ Comedy Guild Awards)\nBALLERS BONUS (because why not):\n• Every ticket goes into a nightly raffle to win a SMASH ROOM + axe-throwing session for two (worth $120). Buy a “Ticket + 10” and double your chances!\n• First 8 ticket buyers each night get a free drink ($12)\n\n",
      "description": "Winning in life isn’t about the size of your balls.\nIt’s about how you spin them.\nWouter Moerloose presents his debut stand-up hour about the triumph of attitude over accolades.\nThis Belgian raconteur spins sharp, self-aware stories from his chaotic journey towards the only thing he never knew he wanted: to make you laugh!\nExpect crying on planes, poorly chosen hobbies, and an unhealthy obsession with celebrities’ wealth – featuring (without their consent) an AK-47 hoarding grandfather, Latvia’s worst kidnapper, and some surprisingly horny sea mammals.",
      "labels": []
    },
    {
      "id": "Please adjust your G-string-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "Please adjust your G-string",
      "imageUrl": "https://eventotron.imgix.net/10-10-2025-053133-2628.jpg",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8269",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\n\"Please adjust your G-string\" is a theatrical memoir at its zaniest! Writer and performer Margaret Austin, in partnership with director and dramaturg Ralph McAllister, gives us an intriguing and wryly funny take on the experiences of the innocent New Zealander abroad. \nThere was nothing about Austin's conservative upbringing in 1950s Palmerston North, complete with a stint as Sunday school teacher, that gave any hint of the life of adventure that was to follow. \nIf there's one thing that bugs her about being a woman, it's the attention that big tits get! \"I was teased by my school mates in the swimming pool dressing room for not needing a bra,\" she says. But twenty years later, during her OE in Paris, her very small breasts proved to be a godsend and the reason why she got a job in the most famous music hall in the world. Legs mattered! That meant a year in the chorus line appearing topless before an audience 1,600 onlookers six nights of the week, 52 weeks of the year. \n \nArmed with the lessons of the dressing room - how to apply full body make up, get false eyelashes into place, and of course master the art of wearing a G-string - further adventures took her to the Cannes Film Festival as a rookie reporter. Brushing shoulders with fame at interviews and celebrity parties meant contacts with the likes of Anthony Hopkins, Catherine de Neuve and Christopher Reeves. \n \nOnce back in New Zealand in the late eighties, adventuring took a very different form. Or maybe not. Find out! \n\n",
      "description": "\"Please adjust your G-string\" is a theatrical memoir at its zaniest!\nWriter and performer Margaret Austin, in partnership with director and dramaturg Ralph McAllister, gives us an intriguing and wryly funny take on the experiences of the innocent New Zealander abroad.\nThere was nothing about Austin's conservative upbringing in 1950s Palmerston North, complete with a stint as Sunday school teacher, that gave any hint of the life of adventure that was to follow.\nBut twenty years later, during her OE in Paris, her very small breasts proved to be a godsend and the reason why she got a job in the most famous music hall in the world.\nLegs mattered!",
      "labels": []
    },
    {
      "id": "Ramen Lager-Garage Project Wild Workshop, Furness Lane, Te Aro-Fringe",
      "name": "Ramen Lager",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/ef5a9df9-e281-4b67-9875-b88c7cad7956.png",
      "venue": "Garage Project Wild Workshop, Furness Lane, Te Aro",
      "coordinates": {
        "lat": -41.2942428,
        "long": 174.77725
      },
      "dates": [
        "2026-03-03-01:15",
        "2026-03-04-01:15",
        "2026-03-05-01:15",
        "2026-03-06-01:15"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8339",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nFor the 13th year running, it’s our avant garde offering to celebrate New Zealand’s fantastic Fringe Festival. Ramen Lager, rice lager brewed with ramen noodles, shiromiso, kombu seaweed and just a little sprinkle of MSG. Crisp, clean lager with a subtle umami sweet body, balanced with delicate hop bitterness. Just like the Fringe, it’s weird but it’s wonderful.\n\nAvailable from all good venues throughout the 2026 festival.\n\n",
      "description": "For the 13th year running, it’s our avant garde offering to celebrate New Zealand’s fantastic Fringe Festival.\nRamen Lager, rice lager brewed with ramen noodles, shiromiso, kombu seaweed and just a little sprinkle of MSG.\nCrisp, clean lager with a subtle umami sweet body, balanced with delicate hop bitterness.\nJust like the Fringe, it’s weird but it’s wonderful.\nAvailable from all good venues throughout the 2026 festival.",
      "labels": []
    },
    {
      "id": "Redemption-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "Redemption",
      "imageUrl": "https://eventotron.imgix.net/10-06-2025-000827-6597.jpg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8325",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nChaos. Carnage. Courage. REDEMPTION.\nLocal chaos magnets, Ginge & Minge (Nina Hogg & Megan Connolly) are here to give failed comedy ideas a second chance.\nREDEMPTION offers hopeful 'redeemables' a chance to direct their dream sketches, improvised formats, scenes or comedic characters that haven't worked, been rejected, or just didn't receive the love they deserve.\nPrepare for epic flops and surprising superstar successes during this 50 minute special that combines Ginge & Minge's love of sketch and improv comedy with a cast of ready and game comedians from across Pōneke.\nBUT THE POWER IS IN YOUR HANDS.\nOnly YOU, the audience, gets to decide what will be REDEEMED and what was better left in the BIN.\nIf you love witnessing magic moments being made right before your eyes, commitment to big stupid ideas, gambling or just a good spectacle, this show is for you.\nWe can promise it'll be a show you can't forget.\nGinge & Minge are a comedy duo from Wellington. They have worked together for four years creating and touring improv and sketch comedy. Recently they were awarded Most Spectacular Organised Chaos at the NZ Fringe Festival for their sketch show House of Ick. However, Ginge & Minge cite their most important achievement as the fact they still like one another.\n\"Ginge & Minge are experienced performers, and it shows [...] they know how to play the audience and each other.\"\nArt Murmurs\n\"...The duo's chemistry, creativity and charisma ushers in a new era of comedy\"\nWellyott\n\n",
      "description": "REDEMPTION offers hopeful 'redeemables' a chance to direct their dream sketches, improvised formats, scenes or comedic characters that haven't worked, been rejected, or just didn't receive the love they deserve.\nPrepare for epic flops and surprising superstar successes during this 50 minute special that combines Ginge & Minge's love of sketch and improv comedy with a cast of ready and game comedians from across Pōneke.\nIf you love witnessing magic moments being made right before your eyes, commitment to big stupid ideas, gambling or just a good spectacle, this show is for you.\nGinge & Minge are a comedy duo from Wellington.\n\"Ginge & Minge are experienced performers, and it shows [...] they know how to play the audience and each other.\"",
      "labels": []
    },
    {
      "id": "Review Revue-29 Courtenay Place\n6011-Fringe",
      "name": "Review Revue",
      "imageUrl": "https://eventotron.imgix.net/10-20-2025-043653-3711.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8283",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nWhat if the review was the show?\n\nFor NZ Fringe 2026, an election year that couldn't come any sooner, musical comedy duo Bethany Miller and Logan Hunt imagine a best-of-all-possible-worlds-Aotearoa.\n\nThat's a tall order, so we've invited some friends (foes?) for feedback...\nEach night we're bringing in a local theatre reviewer to critique our musical live on stage, and you'll get to witness the results.\n\nSee below for the confirmed reviewers (from Theatreview, Art Murmurs and Regional News)!\n______\n\nABOUT THE DUO:\nNominated for \"MOMENTOUS MUSIC\" (NZ Fringe), Logan and Bethany have been making zany musicals every year since 2023, complete with crunchy social commentary, witty lyrics, and loveable/hateable characters. Logan loves to write, Bethany loves to improvise. This time, they've agreed to do both, at the mercy of live reviewers.\n\nTheir previous shows (Goody Goody Glam Pop, Touch Grass, and Battle Riffs) have been described as:\n- \"Supremely relevant social satire cleverly written and gorgeously portrayed\" (Theatreview)\n- \"Delightfully ‘Fringey’, frenetic and buoyant with glorious energy and musicality\" (Theatreview)\n- \"[Bethany Miller] is a consistently strong vocalist, as anyone who’s ever seen her perform will attest to.\" (Wellyott)\n- \"[Logan Hunt's] Tim Minchin-esque lyrics are brilliant and Miller’s performance of them a delight\" (Regional News)\n\nTHE CREATIVE TEAM:\nLogan Hunt - Co-Creator & Performer, Composer\nBethany Miller - Co-Creator & Performer, Producer\nFinn McKinlay - Keyboard\nBeans Wright - Violin\nChloe Marshall - Lighting designer/operator\nIsaac Hooper - Sound operator/support\nMalcolm Hunt - Graphic Design\nEm Maguire - Publicist, alongside Bethany Miller\n\nLIVE REVIEWERS:\nCampbell Wright (Tuesday)\nAlia Marshall (Wednesday)\nJohn Smythe (Thursday)\nTanya Piejus (Friday)\n\n",
      "description": "What if the review was the show?\nThat's a tall order, so we've invited some friends (foes?)\nfor feedback... Each night we're bringing in a local theatre reviewer to critique our musical live on stage, and you'll get to witness the results.\nSee below for the confirmed reviewers (from Theatreview, Art Murmurs and Regional News)!\nNominated for \"MOMENTOUS MUSIC\" (NZ Fringe), Logan and Bethany have been making zany musicals every year since 2023, complete with crunchy social commentary, witty lyrics, and loveable/hateable characters.",
      "labels": []
    },
    {
      "id": "School Disco!-293 Cuba Street, Te Aro, Wellington-Fringe",
      "name": "School Disco!",
      "imageUrl": "https://eventotron.imgix.net/10-17-2025-061106-9385.jpg",
      "venue": "293 Cuba Street, Te Aro, Wellington",
      "coordinates": {
        "lat": -41.2973459,
        "long": 174.7736051
      },
      "dates": [
        "2026-03-07-01:01"
      ],
      "displayDate": "Sat 07 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8335",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nLights are low, tunes are pumping, and we're stocked with Jolly drinks! Join us for the biggest night of the year, the School Disco! Neon lights, slow dances, choice beats. Bring your mates, your groove, and don't forget your pocket money for the tuck shop. See you in the hall!\n \nCreated and performed by the ensemble of Wellington Young Actors.\n\n",
      "description": "Lights are low, tunes are pumping, and we're stocked with Jolly drinks!\nJoin us for the biggest night of the year, the School Disco!\nNeon lights, slow dances, choice beats.\nBring your mates, your groove, and don't forget your pocket money for the tuck shop.\nSee you in the hall!",
      "labels": []
    },
    {
      "id": "Strawberry Baby - Cancelled-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "Strawberry Baby - Cancelled",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-051703-4949.jpg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8229",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nStrawberry Baby is a bold, camp, and colourful solo dance-theatre work, and the debut choreographic piece by Fiona Saunders. After a wonderful and successful premiere season in Auckland, this vibrant new work is heading to Wellington to delight new audiences.\nSet in a chaotic, bright pink bedroom, Strawberry Baby invites audiences into an intimate, immersive world that captures the messy, playful, and deeply personal experience of growing up and discovering one's identity.\nBlending contemporary dance, storytelling, and humour, the work follows a young girl navigating the pressures of beauty standards, neurodivergence, and queerness -- and the universal desire to belong.\nAt its heart, Strawberry Baby is a joyful act of rebellion against societal expectations, celebrating authenticity, imperfection, and the power of self-acceptance.\nPlayful yet raw, funny yet deeply sincere, Strawberry Baby is a love letter to anyone who's ever felt like they don't quite fit.\n\n",
      "description": "Strawberry Baby is a bold, camp, and colourful solo dance-theatre work, and the debut choreographic piece by Fiona Saunders.\nAfter a wonderful and successful premiere season in Auckland, this vibrant new work is heading to Wellington to delight new audiences.\nSet in a chaotic, bright pink bedroom, Strawberry Baby invites audiences into an intimate, immersive world that captures the messy, playful, and deeply personal experience of growing up and discovering one's identity.\nBlending contemporary dance, storytelling, and humour, the work follows a young girl navigating the pressures of beauty standards, neurodivergence, and queerness -- and the universal desire to belong.\nAt its heart, Strawberry Baby is a joyful act of rebellion against societal expectations, celebrating authenticity, imperfection, and the power of self-acceptance.",
      "labels": []
    },
    {
      "id": "SwapRox-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "SwapRox",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-015400-6204.jpg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8194",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nSome people are tops, some are bottoms but here at PopRox we're all switches. In the age of Tik Tok and Reels, our average attention span has maxed out at 7 minutes so PopRox has crafted a show where everything swaps on a buzzer. The cast, the musician and even the tech operator swap roles with each other after just 7 minutes. It's a character based, high-speed romp pushing top improv comedians to the brink of their skills and their sanity. If you don't like what you see, you'll have the chance to change it up and swap it around.\nExpect huge characters, heaps of laughs, stitch-ups and people so far out of their skill zone it'll remind you of the coalition government. No night is the same. Not even every quarter hour is the same.\nPopRox is a professional improv theatre company entering its 5th year of operation. Having dazzled audiences across Te-Whanganui-A-Tara, the motu and even the world, PopRox's slick and stylish improvisation has received critical acclaim and delighted sold out audiences.\nPopRox is:\nTara McEntee\nAustin Harrison\nDylan Hutton\nJed Davies\nLesa Macleod-Whiting\nLia Kelly\nMamaeroa Munn\nMillie Osborne\nNina Hogg\n\n",
      "description": "Some people are tops, some are bottoms but here at PopRox we're all switches.\nIn the age of Tik Tok and Reels, our average attention span has maxed out at 7 minutes so PopRox has crafted a show where everything swaps on a buzzer.\nThe cast, the musician and even the tech operator swap roles with each other after just 7 minutes.\nIt's a character based, high-speed romp pushing top improv comedians to the brink of their skills and their sanity.\nExpect huge characters, heaps of laughs, stitch-ups and people so far out of their skill zone it'll remind you of the coalition government.",
      "labels": []
    },
    {
      "id": "TNT!-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "TNT!",
      "imageUrl": "https://eventotron.imgix.net/10-23-2025-210834-6032.jpg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-06-01:01"
      ],
      "displayDate": "Fri 06 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8253",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nTNT! is a musical project incorporating the explosive power of big band jazz with the mana and beautiful lyricism of te ao Māori.\nIt features Wellington's Capital City Big Band and a team of top-notch musical personalities, led by Vaughn Roberts, fronted by Lisa Tomlins, Greg Crayford, and special guest Jeremy Hantler -- combining to do something creative and new, where big band meets te ao Māori.\nThe programme features bespoke musical arrangements, presented bilingually and sung in Te Reo Māori in a friendly and accessible format. It involves newly commissioned works, stage music, kaupapa Māori, big heart, and great excitement!\n \n\n",
      "description": "TNT!\nis a musical project incorporating the explosive power of big band jazz with the mana and beautiful lyricism of te ao Māori.\nIt features Wellington's Capital City Big Band and a team of top-notch musical personalities, led by Vaughn Roberts, fronted by Lisa Tomlins, Greg Crayford, and special guest Jeremy Hantler -- combining to do something creative and new, where big band meets te ao Māori.\nThe programme features bespoke musical arrangements, presented bilingually and sung in Te Reo Māori in a friendly and accessible format.\nIt involves newly commissioned works, stage music, kaupapa Māori, big heart, and great excitement!",
      "labels": []
    },
    {
      "id": "The Amplifier Show with Don Luchito-Courtenay Studios, 37 Courtenay Place\n6011-Fringe",
      "name": "The Amplifier Show with Don Luchito",
      "imageUrl": "https://eventotron.imgix.net/09-29-2025-015322-8857.jpg",
      "venue": "Courtenay Studios, 37 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938239,
        "long": 174.781853
      },
      "dates": [
        "2026-03-03-01:19",
        "2026-03-04-01:19",
        "2026-03-05-01:19"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8222",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nDon Luchito opens studio doors to welcome another year of NZ Fringe guests. Get the details on shows and creative talent every weekday, 10am. Tune in and let The Don help you decide what shows to attend. Listen on 88.6fm in Wellington & 'radioactive.fm' online.\n\n",
      "description": "Don Luchito opens studio doors to welcome another year of NZ Fringe guests.\nGet the details on shows and creative talent every weekday, 10am.\nTune in and let The Don help you decide what shows to attend.\nListen on 88.6fm in Wellington & 'radioactive.fm' online.",
      "labels": []
    },
    {
      "id": "The Circus* of Lord Azure the Miraculous (CLAM)-Innermost Gardens, 31 Lawson Place-Fringe",
      "name": "The Circus* of Lord Azure the Miraculous (CLAM)",
      "imageUrl": "https://eventotron.imgix.net/10-12-2025-235258-3577.jpg",
      "venue": "Innermost Gardens, 31 Lawson Place",
      "coordinates": {
        "lat": 42.3801927,
        "long": -71.0284615
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8366",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nDirecting a struggling new circus act is hard work, the financials, the festivals, the venues, the murders. When director Sam arrives for a show, only to find the star act have been slaughtered in their caravan, she comes to the grizzly conclusion that the murderer must be in the building (tent).\nThere's no other option than to press on with the rag-tag remains of her cast and keep the audience enthralled until the police are done chasing sheep off the highway.\nThis circus-murder-mystery-comedy, has all the elements of show-must-go-on style play, folded into a real time whodunnit. The small cast create an immersive experience that blends comedy with mystery and keeps the audience on the edge of their seats.\nBrought to you by the team behind Rubber Gloves, the multi award winning Nelson Fringe Festival show 2025.\n*Not a Circus. \n\n",
      "description": "Directing a struggling new circus act is hard work, the financials, the festivals, the venues, the murders.\nWhen director Sam arrives for a show, only to find the star act have been slaughtered in their caravan, she comes to the grizzly conclusion that the murderer must be in the building (tent).\nThere's no other option than to press on with the rag-tag remains of her cast and keep the audience enthralled until the police are done chasing sheep off the highway.\nThis circus-murder-mystery-comedy, has all the elements of show-must-go-on style play, folded into a real time whodunnit.\nThe small cast create an immersive experience that blends comedy with mystery and keeps the audience on the edge of their seats.",
      "labels": []
    },
    {
      "id": "The Cuck Chair-Circus Bar, 17B Allen Street, Te Aro-Fringe",
      "name": "The Cuck Chair",
      "imageUrl": "https://eventotron.imgix.net/09-23-2025-012239-8773.jpg",
      "venue": "Circus Bar, 17B Allen Street, Te Aro",
      "coordinates": {
        "lat": -41.2929705,
        "long": 174.7826363
      },
      "dates": [
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Thu 05 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8220",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nSo, you hate improv? Tell us why... then be forced to watch it.\nFrom the unhinged minds of Wellington's most insane comedy trio comes an original improv format that is so boundary-breaking and genre-defining that it made Van Gogh s**t his pants.\nWhat begins as punishment becomes prophecy, as Catfish Trifecta performs relentlessly, defiantly and with far too much commitment, finishing towards an unholy finale nobody asked for.\nYou won't be ready, but you're coming anyway.\n \nABOUT CATFISH TRIFECTA\nCatfish Trifecta (Mo Munn, Ralph Hilaga, and Joel Luscombe) is a Wellington-based comedy trio. The group formed after training together at the iO Summer Intensive in Chicago in 2024, and have since produced a new experimental concept show each month. Together they fuse experimental improv and devised comedy with general chaos into live comedy shows that are as sharp as they are unhinged. Catch them at the Circus Bar every last Thursday of the month.\n\n",
      "description": "So, you hate improv?\nTell us why... then be forced to watch it.\nFrom the unhinged minds of Wellington's most insane comedy trio comes an original improv format that is so boundary-breaking and genre-defining that it made Van Gogh s**t his pants.\nCatfish Trifecta (Mo Munn, Ralph Hilaga, and Joel Luscombe) is a Wellington-based comedy trio.\nTogether they fuse experimental improv and devised comedy with general chaos into live comedy shows that are as sharp as they are unhinged.",
      "labels": []
    },
    {
      "id": "The Enshitenment-The Fringe Bar, 26-32 Allen Street-Fringe",
      "name": "The Enshitenment",
      "imageUrl": "https://eventotron.imgix.net/10-12-2025-161049-8027.jpg",
      "venue": "The Fringe Bar, 26-32 Allen Street",
      "coordinates": {
        "lat": 40.7167354,
        "long": -73.9918103
      },
      "dates": [
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Fri 06 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8349",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nThe Age of Enlightenment was an intellectual and philosophical movement characterised by reason, tolerance, progress and scientific method.\nNow that's all turning to shit.\nNot a high-brow evening of erudite and political discourse, but merciless mockery of a bunch of dicks and absurdities where we might try to answer such deep, existential questions like:\nHas the world reached peak stupid yet? Yeh, nah! 67!\nCan a Kiwi be persuaded to eat the world's worst pie?\nAre we heading for 1984, Black Mirror and A Handmaid’s Tale, or just Idiocracy Live?\nWho will win medals in the See You Next Thursday World Championships?\nCan you finish this sentence: Donald Trump is a ...? (Best answer wins a prize)\n \nFeaturing President Donald Dump and other deplorables.\n\"NASTY, FOURTH-RATE COMEDY FROM A VERY DUMB RADICAL LEFT-WING LUNATIC – ZERO STARS” – Donald J Trump\nIn aid of local food banks - All profits from ticket sales and 100% of cash collected at shows will be donated to local food banks. Please bring some cash with you. Please come along and give generously otherwise we will be forced to give the world's worst pies to them and you don't want to responsible for that!\n\n",
      "description": "The Age of Enlightenment was an intellectual and philosophical movement characterised by reason, tolerance, progress and scientific method.\nNot a high-brow evening of erudite and political discourse, but merciless mockery of a bunch of dicks and absurdities where we might try to answer such deep, existential questions like: Has the world reached peak stupid yet?\nYeh, nah!\nCan a Kiwi be persuaded to eat the world's worst pie?\nPlease come along and give generously otherwise we will be forced to give the world's worst pies to them and you don't want to responsible for that!",
      "labels": []
    },
    {
      "id": "The Geoffrey Beaver Podcast LIVE!-29 Courtenay Place\n6011-Fringe",
      "name": "The Geoffrey Beaver Podcast LIVE!",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-190352-6583.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-07-15:00"
      ],
      "displayDate": "Sat 07 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8289",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\n \nThe Geoffrey Beaver Podcast - LIVE! is a new contained podcast-style comedy show featuring the grand return of the disgraced (he would prefer 'misunderstood') television personality (he would prefer 'journalist') Geoffrey Beaver. Coming back from a disastrous documentary in which Beaver falsely accused an aerobics club of being a Satanic cult, Geoffrey is once again trying to rectify his reputation in the viral podcast format. A self-proclaimed seeker of truth, he sees himself as a figure like Louis Theroux or David Farrier, when in reality, he is more akin to Alan Partridge and Sean Plunkett.\nUndoubtedly, Beaver's grand return will be met with none of the enthusiasm he expects, and the podcast landscape contains far stranger people than he could possibly imagine. From Prank calls, infuriating elders, conspiracy nut jobs, and an unusual autobiography reveal this return to the 'journalistic stage', may not be as grand as he hoped. \n \n \n\n",
      "description": "The Geoffrey Beaver Podcast - LIVE!\nis a new contained podcast-style comedy show featuring the grand return of the disgraced (he would prefer 'misunderstood') television personality (he would prefer 'journalist') Geoffrey Beaver.\nComing back from a disastrous documentary in which Beaver falsely accused an aerobics club of being a Satanic cult, Geoffrey is once again trying to rectify his reputation in the viral podcast format.\nA self-proclaimed seeker of truth, he sees himself as a figure like Louis Theroux or David Farrier, when in reality, he is more akin to Alan Partridge and Sean Plunkett.\nUndoubtedly, Beaver's grand return will be met with none of the enthusiasm he expects, and the podcast landscape contains far stranger people than he could possibly imagine.",
      "labels": []
    },
    {
      "id": "The Immortal Jellyfish-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "The Immortal Jellyfish",
      "imageUrl": "https://eventotron.imgix.net/10-19-2025-084650-7285.jpg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-03-01:21"
      ],
      "displayDate": "Tue 03 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8225",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nWe are everything and nothing. \nPlagued by Lynx-Africa. \nTap dancing. Plastic. Lana Del Rey. And how to cook the perfect roast. \nDeath is inevitable. \nThe Jellyfish is Immortal. \nCoriander tastes like soap. \nAnd when everything matters and nothing matters, who chooses what is moral? \nWho gets to decide our fate? \nAnd why is no one talking about the fish that can live forever? \nThey say to be a woman is to perform, so let me put a show on for you. \n\n\nThe Immortal Jellyfish is an absurdist, camp, comedic exploration of femininity, performance and existence itself - following the inner monologue of an existentialist housewife in an uncanny patriarchal world. Messy. Political. Playful. Unapologetic. And a little insane.\nMade by a powerhouse team of emerging female creatives, this show is a smorgasbord of collaboration, experimentation and everything we want to scream (and laugh about) right now.\n\nWritten and performed by Margot Coleman who is entering her final year of acting at Toi Whakaari: New Zealand Drama School, The Immortal Jellyfish is the debut show for emerging theatre company, Lupin de Krank Productions.  \n\n",
      "description": "We are everything and nothing.\nPlagued by Lynx-Africa.\nTap dancing.\nThe Jellyfish is Immortal.\nMade by a powerhouse team of emerging female creatives, this show is a smorgasbord of collaboration, experimentation and everything we want to scream (and laugh about) right now.",
      "labels": []
    },
    {
      "id": "The Meeting-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "The Meeting",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/ebc536f2-1db8-410c-b82c-ce7d47158d2e.jpeg",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8208",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nOne woman, seven characters: an explosion of satire and hilarious farce.\n\"Suddenly [she] bursts out, capturing the audience with her vibrant energy\" Lisa Allan, Flat City Field Notes\nA top secret, future-defining meeting is about to take place. Everything falls on an overworked cleaner, three bumbling P.A.s, and a paranoid secrete agent... Subversive and snappy, the circus of civil affairs in Aotearoa is brought to life with humour and vitality in this farcical one-woman political satire The Meeting.\nFrom two vibrant seasons in Otautahi to an international Commedia dell'Arte festival in Italy, The Meeting is making a debut season in Wellington before continuing to spread its chaos across Aotearoa.\nThis project was created by Lola Houghton, with and directed by Pedro Ilgenfritz, as part of Hagley Theatre School's Six Month Theatre Creation Course in partnership with Isaac Theatre Royal.\n\n",
      "description": "One woman, seven characters: an explosion of satire and hilarious farce.\n\"Suddenly [she] bursts out, capturing the audience with her vibrant energy\" Lisa Allan, Flat City Field Notes A top secret, future-defining meeting is about to take place.\nEverything falls on an overworked cleaner, three bumbling P.A.s, and a paranoid secrete agent... Subversive and snappy, the circus of civil affairs in Aotearoa is brought to life with humour and vitality in this farcical one-woman political satire The Meeting.\nFrom two vibrant seasons in Otautahi to an international Commedia dell'Arte festival in Italy, The Meeting is making a debut season in Wellington before continuing to spread its chaos across Aotearoa.\nThis project was created by Lola Houghton, with and directed by Pedro Ilgenfritz, as part of Hagley Theatre School's Six Month Theatre Creation Course in partnership with Isaac Theatre Royal.",
      "labels": []
    },
    {
      "id": "Third Chapter-Hannah Playhouse, 12 Cambridge Terrace-Fringe",
      "name": "Third Chapter",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-220110-7606.jpg",
      "venue": "Hannah Playhouse, 12 Cambridge Terrace",
      "coordinates": {
        "lat": -41.2937331,
        "long": 174.783602
      },
      "dates": [
        "2026-03-05-19:30"
      ],
      "displayDate": "Thu 05 Mar",
      "url": "https://tickets.fringe.co.nz/event/446:8244",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nD, Muss & JLaw is a jazz trio that embodies the spirit of creative rebellion, their music a potent fusion of genre-bending experimentation and emotional intensity. Comprised of pianist James 'Muss' Illingworth, drummer Darren 'D' Mathiassen, and bassist Johnny 'JLaw' Lawrence, this trio has forged a unique sound that defies categorization. Soundscapes oscillate between heavy jazz and thumping hip-hop beats, soaring to emotionally powerful improvisations and dissolving into moments of sublime euphoria.\nTheir compositions are a testament to their collective creativity, weaving together intricate polyrhythms, hypnotic melodies, and explosive improvisations that conjure the raw energy of a live performance. Illingworth's piano playing is a masterclass in dynamic range, shifting seamlessly from delicate nuance to thunderous crescendo, often augmented by his deft use of synthesizers and electronic textures. Mathiassen's drumming is a force of nature, his polyrhythmic wizardry propelling the music forward with unstoppable momentum, while Lawrence's bass lines provide the foundation, his earth-shaking tones anchoring the trio's sonic explorations.\nThe trio's connection is palpable, their synergy born of years of collaboration and experimentation. They've worked with some of the biggest names in music, from Shapeshifter to Bliss n Eso to Louis Baker to Allen Stone, and their experience has honed their craft, allowing them to push the boundaries of jazz and beyond.\nWhen D, Muss & JLaw takes the stage, the energy is electric. Their performances are a testament to their deep connection, their music a living, breathing entity that evolves and adapts in the moment. They're not just playing notes - they're conjuring emotions, telling stories, and transporting their audience to a realm of sonic wonder. This is their Third Chapter.\n\n",
      "description": "D, Muss & JLaw is a jazz trio that embodies the spirit of creative rebellion, their music a potent fusion of genre-bending experimentation and emotional intensity.\nComprised of pianist James 'Muss' Illingworth, drummer Darren 'D' Mathiassen, and bassist Johnny 'JLaw' Lawrence, this trio has forged a unique sound that defies categorization.\nSoundscapes oscillate between heavy jazz and thumping hip-hop beats, soaring to emotionally powerful improvisations and dissolving into moments of sublime euphoria.\nTheir compositions are a testament to their collective creativity, weaving together intricate polyrhythms, hypnotic melodies, and explosive improvisations that conjure the raw energy of a live performance.\nIllingworth's piano playing is a masterclass in dynamic range, shifting seamlessly from delicate nuance to thunderous crescendo, often augmented by his deft use of synthesizers and electronic textures.",
      "labels": []
    },
    {
      "id": "Tolerance-1 Kent Tce, Te Aro, Wellington 6011\n6011-Fringe",
      "name": "Tolerance",
      "imageUrl": "https://nzf.assets.red61.com.au/nzf/cb2f5722-7903-4dcd-9be2-666b6a6504a3.png",
      "venue": "1 Kent Tce, Te Aro, Wellington 6011\n6011",
      "coordinates": {
        "lat": -41.2935952,
        "long": 174.7846181
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8202",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nEight of Te Whanganui-a-Tara's most acclaimed emerging playwrights (Rachel Atlas, Rachel McLean, Campbell Wright, Zachary Klein, Viki Moananu, Amy Wright, Sophie Maree, and Matt Loveranes) tolerated one another, as they paired up to create four short plays on the theme of Tolerance. Come witness the result, an eclectic work about the ways we should (and shouldn't) put up with those around us, as the world burns down.\n\"Compromise was something special; I'm genuinely grateful that I got to witness this nexus of talent. Varied and out-there, yet restrained and expertly-crafted, it had it all. \" - Salient\nTolerance is the continuation of a project started last year with Compromise (Nominee, Best Organised Chaos NZ Fringe 2025) focused on bringing together playwrights to collaborate, build community amongst writers and supply a little bit of creative chaos. It is once again directed by Lia Kelly (Most Original Production Wellington Theatre Awards, One Night Band), and features a cast of vibrant local talent.\nFeaturing plays about self care at the end of the world, the power games of celebrity power couples, office politics, and interventions gone awry, Tolerance is bursting at the seams with ideas, laughs, and fluids of all varieties. Make sure to \"witness this nexus of talent\" (Salient), only in NZ Fringe.\n\n",
      "description": "Eight of Te Whanganui-a-Tara's most acclaimed emerging playwrights (Rachel Atlas, Rachel McLean, Campbell Wright, Zachary Klein, Viki Moananu, Amy Wright, Sophie Maree, and Matt Loveranes) tolerated one another, as they paired up to create four short plays on the theme of Tolerance.\nCome witness the result, an eclectic work about the ways we should (and shouldn't) put up with those around us, as the world burns down.\nVaried and out-there, yet restrained and expertly-crafted, it had it all. \"\nIt is once again directed by Lia Kelly (Most Original Production Wellington Theatre Awards, One Night Band), and features a cast of vibrant local talent.\nMake sure to \"witness this nexus of talent\" (Salient), only in NZ Fringe.",
      "labels": []
    },
    {
      "id": "We're Weird for Other Reasons-Gryphon Theatre, 22 Ghuznee Street-Fringe",
      "name": "We're Weird for Other Reasons",
      "imageUrl": "https://d1vlmco8ur52ud.cloudfront.net/01-15-2026-001007-7825.jpg",
      "venue": "Gryphon Theatre, 22 Ghuznee Street",
      "coordinates": {
        "lat": -41.2936076,
        "long": 174.7770631
      },
      "dates": [
        "2026-03-03-01:01",
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Tue 03 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8408",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA world-first theatre project entirely devised by members of the Ace/Aro/Aspec community. This is a joyful and insightful exploration of our varied experiences and identities, brought to the stage for our community, friends, the curious and kind.\nBrought to you by the creative teams behind Ungartered Territory and the Dr Drama Trilogy- We're Weird for Other Reasons promises to be fun, theatrical, enlightening and a celebration of an emerging identity through performance. \nSupported by Wellington City Council and Te Herenga Waka Victoria University of Wellington.\n\"it's also so powerful to be able to watch a piece and feel represented in a way that I've just never felt\"- Theatreview (Ungartered Territory)\n\n",
      "description": "A world-first theatre project entirely devised by members of the Ace/Aro/Aspec community.\nThis is a joyful and insightful exploration of our varied experiences and identities, brought to the stage for our community, friends, the curious and kind.\nBrought to you by the creative teams behind Ungartered Territory and the Dr Drama Trilogy- We're Weird for Other Reasons promises to be fun, theatrical, enlightening and a celebration of an emerging identity through performance.\nSupported by Wellington City Council and Te Herenga Waka Victoria University of Wellington.\n\"it's also so powerful to be able to watch a piece and feel represented in a way that I've just never felt\"- Theatreview (Ungartered Territory)",
      "labels": []
    },
    {
      "id": "Weekend Laughs Comedy-38 Fitzherbert Street, Petone, Lower Hutt\n5012-Fringe",
      "name": "Weekend Laughs Comedy",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-000236-7584.jpg",
      "venue": "38 Fitzherbert Street, Petone, Lower Hutt\n5012",
      "coordinates": {
        "lat": -41.2227099,
        "long": 174.8758616
      },
      "dates": [
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Fri 06 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8189",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nBrought to you by LT McGuinness Ltd and Laughs on Tour.\n \nWeekend Laughs is a comedy showcase of some top NZ and international talent, right in the heart of Petone at Abandoned Taproom.\n \nEach show features a changing line up of your favourite comedians, and up-and-coming talent.\n \nFriday 20th and Saturday 21st February features:\nJeremy Corbett\nThe host of 7Days, and one of NZ's favourite MCs and comedians, Jeremy has headlined stages around NZ, and is appearing for one night only on the Fringe Bar stage.\n\"A Classic Comedy legend\" Scott Blanks, Director of The Classic\n \nand Justine Smith\nHaving won the Billy T Award, the NZ Comedy Guild Best MC (three or four times) and the NZCG Best Female Comedian (like five or six times, losing count), Justine has established herself as one of the best bloody stand ups we have here in New Zealand.\n \nFriday 27th and Saturday 28th February:\nJack Ansett - as seen on TaskmasterNZ\nJack has also appeared on Guy Montgomery's Guy-Mont Spelling Bee, the NZ Comedy Gala, and 7Days.\n \nJames Nokise\nJames has carved out a reputation in New Zealand going after everything from gangs, to politicians, to stereotypes within Pacific culture. Winner of the 2019 Fred Award, and the 2025 Topp Prize for contributions to NZ comedy.\n \nFriday 6th and Saturday 7th March:\n\nBen Hurley\nAs seen on The Project, Seven Sharp, and more\nWith a massive but hugely likeable stage presence, Hurley can win over even the toughest room. A sharp improvisational mind and well honed original material make Hurley a popular act with audiences and critics alike.\n  \nHoani Hotene - 2025 Billy T Award winner\nA rising star in the NZ comedy scene, Hoani has opened for Joe Daymond, Tofiga, and more. His NZ Comedy Festival show sold out in 2025, and he returns for two nights only to his home base in Petone.\n \nAlso featuring 2026 Billy T Award nominee Kipling DC\n \nmore acts to be announced!\n \nThis event made possible with support from LT McGuinness Ltd, Kiwi Gaming Foundation, Hutt Mana Trust, Ava Lodge, and the Creative Communities scheme.\n\n",
      "description": "Brought to you by LT McGuinness Ltd and Laughs on Tour.\nWeekend Laughs is a comedy showcase of some top NZ and international talent, right in the heart of Petone at Abandoned Taproom.\nFriday 20th and Saturday 21st February features: Jeremy Corbett The host of 7Days, and one of NZ's favourite MCs and comedians, Jeremy has headlined stages around NZ, and is appearing for one night only on the Fringe Bar stage.\nFriday 6th and Saturday 7th March: Ben Hurley As seen on The Project, Seven Sharp, and more With a massive but hugely likeable stage presence, Hurley can win over even the toughest room.\nHoani Hotene - 2025 Billy T Award winner A rising star in the NZ comedy scene, Hoani has opened for Joe Daymond, Tofiga, and more.",
      "labels": []
    },
    {
      "id": "Yours Truly-29 Courtenay Place\n6011-Fringe",
      "name": "Yours Truly",
      "imageUrl": "https://eventotron.imgix.net/10-09-2025-141130-9454.jpg",
      "venue": "29 Courtenay Place\n6011",
      "coordinates": {
        "lat": -41.2938989,
        "long": 174.7820748
      },
      "dates": [
        "2026-03-04-01:01",
        "2026-03-05-01:01",
        "2026-03-06-01:01",
        "2026-03-07-01:01"
      ],
      "displayDate": "Wed 04 Mar + more",
      "url": "https://tickets.fringe.co.nz/event/446:8298",
      "source": "Fringe",
      "eventType": "Arts & Theatre",
      "long_description": "\nA whimsical show centered around the elements: earth, air, water, fire, and the sun and moon! Something that we ALL have in common is the natural world we exist in... which we tend to forget or take for granted, however we have our own unique relationships with it. By exploring these connections and broadening our understanding through research, storytelling, and play we will bring these elements to life by personifying them in a theatrical sense. Here we will create our own narrative where we can tell a story that is important to us. We shall build a physical and mental space where our cast, crew, and audience can escape and delve into their inner whimsy while grounding themselves in the natural world around them.\n'Yours Truly' will be a visually striking show with movement/physical theatre, lots of colour and fun costumes which will help us as a team explore and portray our story of the natural world. As for emotions there will be love, yearning, laughter, sadness, nostalgia, basically a place where everything can exist at once. We will bring attention to the small things in life that we forget to notice/feel while also being big and expansive in our imaginations to tell a story that is larger than us.\n\n",
      "description": "A whimsical show centered around the elements: earth, air, water, fire, and the sun and moon!\nSomething that we ALL have in common is the natural world we exist in... which we tend to forget or take for granted, however we have our own unique relationships with it.\nBy exploring these connections and broadening our understanding through research, storytelling, and play we will bring these elements to life by personifying them in a theatrical sense.\nHere we will create our own narrative where we can tell a story that is important to us.\nWe shall build a physical and mental space where our cast, crew, and audience can escape and delve into their inner whimsy while grounding themselves in the natural world around them.",
      "labels": []
    }
  ]
}