{
  "events": [
    {
      "id": "WAFF - Annecy Shorts Best Of Collection Adults '26-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Annecy Shorts Best Of Collection Adults '26",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_a2f18495-c357-46d9-a702-e25eaf6ca816.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-22-20:15"
      ],
      "displayDate": "Sun 22 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-annecy-shorts-best-of-collection-adults-26",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nAwarded international shorts collection",
      "description": "Details Awarded international shorts collection",
      "labels": []
    },
    {
      "id": "WAFF - Annecy Shorts Best Of Collection Kids 2026-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Annecy Shorts Best Of Collection Kids 2026",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_6e8de2fd-198a-4ee5-9460-43e4b025ab6f.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-22-10:00"
      ],
      "displayDate": "Sun 22 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-annecy-shorts-best-of-collection-kids-2026",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nThe Best of Annecy Kids assembles funny, touching and poetic short films that children will adore! New Zealand Premiere — These International shorts are Awards Winner in Annecy festival.",
      "description": "Details The Best of Annecy Kids assembles funny, touching and poetic short films that children will adore!\nNew Zealand Premiere — These International shorts are Awards Winner in Annecy festival.",
      "labels": []
    },
    {
      "id": "WAFF - ChaO-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - ChaO",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_37597e19-92a1-4e45-80a3-81e36c88a939.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-21-21:00"
      ],
      "displayDate": "Sat 21 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-chao",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Yasuhiro Aoki\nIn a future society where humans and mermaids coexist, Stephan, a regular office worker at a shipbuilding company, is suddenly proposed to by Chao – a princess from the mermaid kingdom! In the tradition of Studio Ghibli where imaginary world intertwines and create “more than human” situations.\n\nFor Teens, Young Adults, Adults\n\nNew Zealand Premiere — Winner Annecy Jury Award",
      "description": "Details Directed by Yasuhiro Aoki In a future society where humans and mermaids coexist, Stephan, a regular office worker at a shipbuilding company, is suddenly proposed to by Chao – a princess from the mermaid kingdom!\nIn the tradition of Studio Ghibli where imaginary world intertwines and create “more than human” situations.\nFor Teens, Young Adults, Adults New Zealand Premiere — Winner Annecy Jury Award",
      "labels": []
    },
    {
      "id": "WAFF - Dandelion's Odyssey-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Dandelion's Odyssey",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_59a7ac31-d40a-46ee-8d5d-0275623423c2.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-19-18:30"
      ],
      "displayDate": "Thu 19 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-dandelions-odyssey",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Momoko Seto\nDandelion, Baraban, Léonto and Taraxa, four dandelion achenes rescued from a succession of nuclear explosions destroying the Earth, find themselves hurled into the cosmos, stranded on an unknown planet, in search of a soil suitable for the survival of their species. But the elements, fauna, flora and climate are just some of the obstacles they must overcome.\nFor Kids, teens, Family, Adults\n\nNZ Premiere — Annecy Paul Grimault Award. Winner of the FIPRESCI Prize at Cannes 2025 (Critics’ Week)",
      "description": "Details Directed by Momoko Seto Dandelion, Baraban, Léonto and Taraxa, four dandelion achenes rescued from a succession of nuclear explosions destroying the Earth, find themselves hurled into the cosmos, stranded on an unknown planet, in search of a soil suitable for the survival of their species.\nBut the elements, fauna, flora and climate are just some of the obstacles they must overcome.\nFor Kids, teens, Family, Adults NZ Premiere — Annecy Paul Grimault Award.\nWinner of the FIPRESCI Prize at Cannes 2025 (Critics’ Week)",
      "labels": []
    },
    {
      "id": "WAFF - Female Landscape: Animation-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Female Landscape: Animation",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_0fb65d78-c903-49ad-ae9e-ba3d73209072.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-21-10:00"
      ],
      "displayDate": "Sat 21 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-female-landscape-animation",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nScreen Wellington presents an exceptional collection of animated short films by female filmmakers from UNESCO Creative Cities of Film around the world. This exclusive screening provides audiences an opportunity to discover fresh and innovative, international animation.\nThe Female Landscape Project exemplifies the cultural exchange, shared learning and support Wellington benefits from as a member of the UNESCO Creative Cities Network. Stay on after the screening for an inspiring talk with the featured filmmakers. Moderated by Nic Marshall, the audience will gain insights into different career pathways, challenges and triumphs, as well as the creative process behind these works and the stories that shaped them.\n\nAll tickets are booking fee only.",
      "description": "Details Screen Wellington presents an exceptional collection of animated short films by female filmmakers from UNESCO Creative Cities of Film around the world.\nThis exclusive screening provides audiences an opportunity to discover fresh and innovative, international animation.\nThe Female Landscape Project exemplifies the cultural exchange, shared learning and support Wellington benefits from as a member of the UNESCO Creative Cities Network.\nStay on after the screening for an inspiring talk with the featured filmmakers.\nModerated by Nic Marshall, the audience will gain insights into different career pathways, challenges and triumphs, as well as the creative process behind these works and the stories that shaped them.",
      "labels": []
    },
    {
      "id": "WAFF - Into the Mortal World-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Into the Mortal World",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_c8eaed99-cec3-4c61-b77f-701158b3b6f3.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-22-16:30"
      ],
      "displayDate": "Sun 22 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-into-the-mortal-world",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Din Zhong\nA visually rich Chinese fantasy epic telling the story of The Weaving Maiden's son, Jin Feng, who went down to the world for his mother, and teamed up with a young girl, Xiaofan, to subdue the Starry Nights. People and gods together, all the way to the thrills and dangers, the mystery of Xiaofan's life, the truth of the Weaving Maiden's crime also gradually surfaced.\n\nFor Kids, Teens, Family, Young Adults",
      "description": "Details Directed by Din Zhong A visually rich Chinese fantasy epic telling the story of The Weaving Maiden's son, Jin Feng, who went down to the world for his mother, and teamed up with a young girl, Xiaofan, to subdue the Starry Nights.\nPeople and gods together, all the way to the thrills and dangers, the mystery of Xiaofan's life, the truth of the Weaving Maiden's crime also gradually surfaced.\nFor Kids, Teens, Family, Young Adults",
      "labels": []
    },
    {
      "id": "WAFF - Little Amelie and the Character of Rain-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Little Amelie and the Character of Rain",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_a4af5766-3608-4313-ba98-4984391904e4.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-22-13:45"
      ],
      "displayDate": "Sun 22 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-little-amelie-and-the-character-of-rain",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Maïlys Vallade, Liane-Cho Han\nThe story traces the early childhood of Belgian writer Amélie Nothomb in Japan, exploring her unique vision of the world and her relationship with her nanny, Nishio-san.\n\nFor Kids, Teens, Family\n\nNew Zealand Premiere — Winner Annecy Jury Award. Nominee at the Golden Globe 2026 for Best Motion Picture - Animated.\n\nNominee at the Oscars 2026 for Best Animated Feature.",
      "description": "Details Directed by Maïlys Vallade, Liane-Cho Han The story traces the early childhood of Belgian writer Amélie Nothomb in Japan, exploring her unique vision of the world and her relationship with her nanny, Nishio-san.\nFor Kids, Teens, Family New Zealand Premiere — Winner Annecy Jury Award.\nNominee at the Golden Globe 2026 for Best Motion Picture - Animated.\nNominee at the Oscars 2026 for Best Animated Feature.",
      "labels": []
    },
    {
      "id": "WAFF - Mosley-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Mosley",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_fbb24545-9de3-4c04-a2ac-a453841e8858.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-21-14:30"
      ],
      "displayDate": "Sat 21 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-mosley",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Kirby Atkins\nIn ancient times, part of the Thoriphants nation migrated north to escape humans. Today, Mosley the young Thoriphant rebels against this life of servitude and embark on a treacherous journey to find the fabled city of Uprights, where the ancestors live in peace. First NZ-Chinese co-production.\n\nFor Kids, Teens, Family",
      "description": "Details Directed by Kirby Atkins In ancient times, part of the Thoriphants nation migrated north to escape humans.\nToday, Mosley the young Thoriphant rebels against this life of servitude and embark on a treacherous journey to find the fabled city of Uprights, where the ancestors live in peace.\nFirst NZ-Chinese co-production.\nFor Kids, Teens, Family",
      "labels": []
    },
    {
      "id": "WAFF - Space Cadet-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Space Cadet",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_bbab1fef-b4d5-4433-8e35-db1b07620d4b.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-21-12:30"
      ],
      "displayDate": "Sat 21 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-space-cadet",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Kid Koala\nA silent animated musical on an astronaut girl and her caring robot. The story embarks us in the journey of a young orphan girl and her dream to become an astronaut, nurtured and raised by a caring robot. As she successfully rises to the stars, her robot experiments with the very human feeling of attachment. An international festival favorite!\n\nFor Kids, Family\n\nNZ Premiere — Annecy Contrechamp Official Selection",
      "description": "Details Directed by Kid Koala A silent animated musical on an astronaut girl and her caring robot.\nThe story embarks us in the journey of a young orphan girl and her dream to become an astronaut, nurtured and raised by a caring robot.\nAs she successfully rises to the stars, her robot experiments with the very human feeling of attachment.\nAn international festival favorite!\nFor Kids, Family NZ Premiere — Annecy Contrechamp Official Selection",
      "labels": []
    },
    {
      "id": "WAFF - Stitch head-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - Stitch head",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_87696ab0-4a7c-467e-99b9-5239fdc6ce0f.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-20-16:00"
      ],
      "displayDate": "Fri 20 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-stitch-head",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Steve Hudson\nFollows Stitch Head, a small creature awoken by a Mad Professor in the castle Grotteskew. Stitch head must protect the professor's other creations from the townspeople of Grubbers Nubbin.\n\nFor Kids, Teens, Family, Adults\n\nNZ Premiere. International Co-Production",
      "description": "Details Directed by Steve Hudson Follows Stitch Head, a small creature awoken by a Mad Professor in the castle Grotteskew.\nStitch head must protect the professor's other creations from the townspeople of Grubbers Nubbin.\nFor Kids, Teens, Family, Adults NZ Premiere.\nInternational Co-Production",
      "labels": []
    },
    {
      "id": "WAFF - The Most Precious of Cargoes-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - The Most Precious of Cargoes",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_e0ffa0f1-3686-4cf4-8ca1-fedcf5fb6b3c.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-21-19:00"
      ],
      "displayDate": "Sat 21 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-the-most-precious-of-cargoes",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Michel Hazanavicius\nThe story centers on a Holocaust-surviving Jewish girl whose father throws her from a moving train heading to Auschwitz. Ultimately, she’s found by a woodcutter and his family…\n\nFor Teens 16+, Young Adults, Adults\n\nFirst animated feature in Cannes Main Competition since 2008.\n\nOpening film of Annecy 2024. NZ Theatrical Premiere.",
      "description": "Details Directed by Michel Hazanavicius The story centers on a Holocaust-surviving Jewish girl whose father throws her from a moving train heading to Auschwitz.\nUltimately, she’s found by a woodcutter and his family… For Teens 16+, Young Adults, Adults First animated feature in Cannes Main Competition since 2008.\nOpening film of Annecy 2024.\nNZ Theatrical Premiere.",
      "labels": []
    },
    {
      "id": "WAFF - The Square-The Roxy Cinema, 5 Park Road, Miramar, Wellington-Roxy Cinema",
      "name": "WAFF - The Square",
      "imageUrl": "https://img.vwassets.com/roxycinema.co.nz/vertical_a6a8c48e-a7f8-4ff4-a85a-7c1ecb970560.jpg",
      "venue": "The Roxy Cinema, 5 Park Road, Miramar, Wellington",
      "coordinates": {
        "lat": -41.3158511,
        "long": 174.816259
      },
      "dates": [
        "2026-03-20-19:45"
      ],
      "displayDate": "Fri 20 Mar",
      "url": "https://www.roxycinema.co.nz/movie/waff-the-square",
      "source": "Roxy Cinema",
      "eventType": "Film & Media",
      "long_description": "Details\nDirected by Kim Bo-Sol\nThis acclaimed South Korean independent animation takes us in North Korea, where we will discover a tormented triangle story of love, spying and friendship. Beautifully animated and visually enticing, this film is a must see!\n\nFor Teens16+, Young Adults, Adults\n\nNZ Premiere — Annecy Contrechamp Jury Award",
      "description": "Details Directed by Kim Bo-Sol This acclaimed South Korean independent animation takes us in North Korea, where we will discover a tormented triangle story of love, spying and friendship.\nBeautifully animated and visually enticing, this film is a must see!\nFor Teens16+, Young Adults, Adults NZ Premiere — Annecy Contrechamp Jury Award",
      "labels": []
    }
  ]
}